{"Content": "[ Illinois lawmakers expressed skepticism Wednesday that theyll be able to pass a new pension reform bill this spring, despite pressure from Gov. Bruce Rauner and major credit rating agencies to quickly replace the 2013 overhaul that the state Supreme Court struck down. The high court last week ruled that the plan to address Illinois worst-in-the-nation public-pension shortfall by reducing benefits was unconstitutional, sending lawmakers back to square one on an issue that has dogged them for years. On Wednesday, House lawmakers held their first hearing on the Republican governors proposed solution, and Rauner was scheduled to meet with Senate President John Cullerton, whos floating his own pension bill, about a path forward. But Rep. Elaine Nekritz, D-Northbrook, chair of the House Pension Committee, called the odds of a deal before the session ends May 31 \"slim.\", \"You dont just slap these things together,\" said Nekritz, noting that the 2013 deal took years to negotiate. Illinois five pension funds are short about $110 billion of whats needed long term to pay out benefits as promised, largely because the legislature for years didnt make the states required contributions. The payments now are taking up roughly one-fifth of the states general revenue fund, with next years payment reaching about $7 billion. Major credit rating agencies have given Illinois the worst rating of any state. Moodys Investors Service this week downgraded to junk bond status the credit rating for the city of Chicago and Chicago Public Schools, citing the Supreme Courts ruling and the citys deep pension debt. The rating agencies also have warned that the court decision puts additional pressure on the state to find a solution. Protesters set up Raunerville in front of the governors lakefront condo on May 13, 2015. Protesters set up Raunerville in front of the governors lakefront condo on May 13, 2015. Rauner has said approving another pension reform plan is \"essential\" and that he believes it can be done before the end of the month. He wants to allow state workers and retirees to keep the benefits theyve earned but move them to a less-generous plan going forward that he says would save the state $2.2 billion next year. He also wants to put a constitutional amendment on the 2016 ballot that would allow future pension benefits to be cut, in hopes of heading off any future lawsuits from labor unions or retirees. Cullerton, D-Chicago, is reviving a plan that he floated in 2013 but with some adjustments. His proposal would offer state workers a choice between keeping annual cost-of-living raises in retirement and being able to include future pay raises when calculating their retirement benefits. His office estimates that the plan would save about $1 billion in the first year. Cullerton and Rauner believe their proposals would be found constitutional, though others have expressed doubt that anything short of raising taxes to keep current benefit levels in place would pass the courts muster. Labor unions, which sued along with retirees and other groups to get the 2013 law thrown out, supported Cullertons plan when he first proposed it. But armed with the Supreme Courts unanimous decision, theyre no longer saying they back it. Even so, Cullerton said he believes his proposal has the best chance of getting the Legislatures approval because its been considered before and the Senate passed it in 2013. He said hes willing to push the legislation through in the next few weeks, but he needs the governors support before calling it for a vote. Rauners office said the governor is willing to consider other options, but didnt comment specifically about Cullertons plan. \"This is such an important issue for the state, we need to keep trying,\" said Kim Fowler, general counsel for the governors office of management and budget. Cullerton spokeswoman Rikeesha Phelon said the Senate president isnt looking at a specific timeline, saying \"whats important is to get it right.\", State Rep. Art Turner, D-Chicago, also said it will take a while to get consensus on a solution to the pension crisis. \"Its going to be an uphill battle,\" he said.]", "Date": "20150513", "Author": "[ Sara Burnett, Kerry Lester]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-illinois-pensions-st-0514-20150513-story.html", "Title": "[ Illinois legislators skeptical about new pension deal this spring]"}