{"Content": "[ In a sweeping bid to curb heat-trapping pollution that is altering the planets climate, President Barack Obama on Monday unveiled the first-ever limits on carbon dioxide emissions from the nations power plants. The landmark rules from the U.S. Environmental Protection Agency likely will accelerate changes already underway in energy markets, driven by an abundance of low-cost natural gas, fledgling efficiency programs and declining prices for wind and solar power. The rules also could provide an economic lifeline to the nations fleet of zero-carbon nuclear plants, many of which are owned by Chicago-based Exelon. Despite a long legacy of coal mining in Illinois, industry officials and state regulators say a move during the past decade toward cleaner, more efficient energy gives the state a head start to meet EPA-imposed targets to reduce emissions from coal- and gas-fired plants. If the presidents initiative survives promised legal challenges, it will pressure the energy industry to speed up a transition away from high-carbon coal plants, which also are major sources of lung-damaging soot and smog. The shift promises health benefits in Chicago and other cities with chronically dirty air. The coal industry, its allies in Congress and nearly all the Republican candidates for president argue the climate rules will devastate the national economy, drive up the cost of electricity and threaten blackouts. But Obama and administration officials said the initiative offers states enough time and flexibility to comply while saving consumers money on their electric bills. Combined with other government policies, including tighter fuel economy rules for cars and trucks and stricter efficiency standards for household appliances, the power plant rules seek to slow the pace of global warming. Most mainstream scientists say a failure to act will lead to droughts, floods and other disasters that over time will become more frequent, intense and expensive as the climate changes. You hear a lot of flattering but unverifiable numbers and predictions attached to the Obama administrations plan to reduce carbon emissions from power plants. (Itll be like removing 166 million cars from the highway! The health savings will far outstrip the cost!), But if you focus on one scary... You hear a lot of flattering but unverifiable numbers and predictions attached to the Obama administrations plan to reduce carbon emissions from power plants. (Itll be like removing 166 million cars from the highway! The health savings will far outstrip the cost!), But if you focus on one scary... \"I am convinced that no challenge poses a greater threat to our future than a changing climate,\" Obama told a group of EPA officials, scientists and supporters at the White House. \"If we want to protect our economy, security and childrens health, we are going to need to do more.\", Power plants that burn fossil fuels are the largest single source of greenhouse gases in the United States, accounting for nearly a third of the nations heat-trapping pollution in 2013. Obamas rules seek to cut emissions nationally by 32 percent from 2005 levels and strengthen the U.S. position in negotiations on a global climate agreement. Each state is to get an individual target for reducing emissions by 2030. Similar to earlier clean air regulations, the rules encourage state leaders to decide how to meet the goal but allow Washington to impose a plan if they dont. State plans are due in September 2016, though states that need more time can ask for a two-year extension. In Illinois, overall emissions will need to drop by about 31 percent from 2012 levels to 66.5 million tons  equivalent to taking 5.6 million cars off the roads. President Barack Obama says his new power plant regulations are \"the single most important step\" America has ever taken in the fight against climate change. Augut 3, 2015. (AP), President Barack Obama says his new power plant regulations are \"the single most important step\" America has ever taken in the fight against climate change. Augut 3, 2015. (AP), Illinois Gov. Bruce Rauner declined to comment on the new rules pending a more detailed review. Unlike many of his fellow Republican governors, Rauner is not expected to join in the legal challenges, in part because Exelons carbon-free nuclear plants account for nearly half of the states energy mix. Illinois also is home to the corporate headquarters of more than a dozen wind companies. Last month, Rauners top environmental regulator told an industry forum that Illinois is taking a \"no-regrets approach\" to complying with the climate rules. State officials have been meeting throughout the past year with officials from other states and various industries to discuss how to meet the EPA targets without disrupting the economy. \"Illinois is well positioned to meet the challenge with targeted policy initiatives that harness the states energy efficiency and renewable energy resources to complement our nuclear and coal resources,\" said Illinois EPA Director Lisa Bonnett, a longtime agency official retained by the Rauner administration. Coal and gas plants in Illinois emitted 2,208 pounds of carbon dioxide for every megawatt-hour of electricity generated in 2012, according to updated EPA data. The new rules will require the state to reduce that rate to 1,245 pounds per megawatt-hour  a decline of nearly 44 percent  by 2030. State laws mandating a greater reliance on renewable power and energy efficiency programs will help, though environmental groups and clean energy companies say legislation pending in Springfield is needed to ensure the laws work as intended. \"Illinois is poised to be a winner if we do this right,\" said Howard Learner, executive director of the nonprofit Environmental Law and Policy Center. Exelon, the parent company of ComEd and owner of six nuclear plants in Illinois, has long backed efforts to limit climate change pollution. The company has said that unless policies go its way, it might close three plants it says are losing money amid competition from wind farms and natural gas plants. The company applauded provisions in the new climate rules that credit existing nuclear plants if they boost output and encourage states to develop carbon-trading systems. The EPAs rules clear the way for informal agreements that could help states work together to reduce pollution, similar to successful efforts to reduce pollution that creates acid rain and smog. Regional electric grid operators have predicted such a multistate approach also would save consumers money. Illinois might have trouble securing cooperation from neighboring states. Wisconsin Gov. Scott Walker, who is seeking the Republican nomination for president, and Indiana Gov. Mike Pence are among GOP governors who have threatened to not comply with the administrations rules. Both represent states that rely more heavily on coal and have received substantial campaign contributions from the fossil fuel industry. Illinois still ranks fifth in coal production, though much of it is shipped out of state. Coal mines in Illinois employed about 4,200 workers in 2013, according to federal records. Coal interests contend the new rules, promoted by the White House as the Clean Power Plan, are part of a radical environmental agenda that comes at the expense of the American people. \"Instead of putting their priorities first, the president shamefully put his political legacy first,\" said Mike Duncan, president and CEO of the American Coalition for Clean Coal Electricity, an industry trade group. Low-cost natural gas already is putting severe financial pressure on the industry. On Monday, Alpha Natural Resources was the latest coal company to declare bankruptcy. Well before the climate rules were officially rolled out, power companies across the country had been shuttering dozens of the oldest, dirtiest, least-efficient coal plants and converting others to natural gas, which emits about half the carbon dioxide to generate the same amount of electricity. NRG Energy Inc. which recently bought four Illinois coal plants, announced last year it plans to convert its massive Joliet facility to natural gas. In 2013, the plant emitted 7.4 million tons of carbon dioxide  ranking it fourth highest among the states coal fleet. Including other changes, the company has said it would \"single-handedly\" help the state meet more than half of its goals under a draft version of Obamas climate rules. The company remains one of the nations largest single emitters of greenhouse gases, but CEO David Crane has told investors that coal power is giving way to residential solar panels and other forms of renewable energy. The states other major owner of coal plants  Houston-based Dynegy Inc.  stands to be affected more significantly by the climate rules. Six of its 10 coal plants are among the states top 10 emitters, and one, Baldwin in Randolph County, is in the top 25 nationally. A spokesman said the company is evaluating the rules. In his remarks, Obama tried to anticipate and rebut arguments from critics. \"There will be critics, cynics who say it cannot be done,\" he said. \"They will claim it will cost you money ... will kill jobs,\" and that its a \"war on coal\" that will harm minority and low-income Americans by eliminating their jobs. But climate change \"hurts those Americans the most,\" Obama said, citing statistics that show black and Latino children are far more likely to suffer from asthma exacerbated by poor air quality. Reflecting on the changes he has seen over time, Obama recalled the fire in Clevelands polluted Cuyahoga River in 1969 and the acid rain that degraded mountain forests in the eastern U.S. Laws and EPA programs have eased both problems during his lifetime. \"Weve got to know our history,\" he said, dismissing old and new criticism as \"simply excuses for inaction.\", \"They underestimate American business and American ingenuity,\" Obama said. \"We can figure this stuff out as long as were not lazy about it  as long as we dont take the path of least resistance.\", Tribune Newspapers correspondent Christi Parsons contributed from Washington. mhawthorne@tribpub.com, cdizikes@tribpub.com, Twitter @scribeguy, @cdizikes]", "Date": "20150803", "Author": "[ Michael Hawthorne, Cynthia Dizikes]", "Link": "http://www.chicagotribune.com/news/ct-climate-rules-illinois-met-20150803-story.html", "Title": "[ Obama unveils rules to limit carbon dioxide emissions, curb climate change]"}