{"Content": "[ Christianity, whose presence in the Middle East predates Islams by 600 years, is about to be cleansed from the Middle East. Egyptian Copts may have found some respite under Abdel-Fattah el-Sissi, but after their persecution under the previous Muslim Brotherhood government, they know how precarious their existence in 90 percent Muslim Egypt remains. Elsewhere, its much worse. Twenty-one Copts were beheaded by the Islamic State affiliate in Libya for the crime of being Christian. In those large swaths of Syria and Iraq where the Islamic State rules, the consequences for Christians are terrible  enslavement, exile, torture, massacre, crucifixion. Over the decades, many Middle Eastern Christians, seeing the rise of political Islam and the intensification of savage sectarian wars, have simply left. Lebanons Christians, once more than half the population, are now estimated at about a third. The number of Christians under Palestinian Authority rule in the West Bank has dwindled  in Bethlehem, for example, dropping by half. (The exception, of course, is Israel, where Christians, Arab and non-Arab, enjoy not just protection but civil rights. Their numbers are increasing. But thats another story.), Most endangered are the Christians of Syria. Four years ago they numbered about 1.1 million. By now 700,000 have fled. Many of those remaining in the country are caught either under radical Islamist rule or in the crossfire between factions. As the larger Christian world looks on passively, their future, like the future of Middle Eastern Christianity writ large, will be determined by Iran, Hezbollah, the Assad dynasty, the Islamic State, the Nusra Front, various other local factions and by regional powers seeking advantage. Meanwhile, on a more limited scale, there are things that can be done. Three weeks ago, for example, 150 Syrian Christians were airlifted to refuge and safety in Poland. Thats the work of the Weidenfeld Safe Havens Fund. It provided the flight and will support the refugees for as long as 18 months as they try to remake their lives. The person behind all this is George Weidenfeld: life peer, philanthropist, publisher (Weidenfeld & Nicolson, established 1949), Europeanist (founder of the Institute for Strategic Dialogue to promote classically liberal European values), proud public Jew (honorary vice president of the World Jewish Congress), lifelong Zionist (he once served as the chief of Cabinet to Israels first president, Chaim Weizmann) and, as he will delightedly tell you, the last person to fight a duel at the University of Vienna  with sabers, against a Nazi. (No one died.), Pentagon officials charged with targeting Islamic State in Syria are having some fun with their map of the region this week. Thats because they  finally!  have permission from the Turkish government to use the U.S. air base at Incirlik, Turkey, just 60 miles from the Syrian border. Until now,... Pentagon officials charged with targeting Islamic State in Syria are having some fun with their map of the region this week. Thats because they  finally!  have permission from the Turkish government to use the U.S. air base at Incirlik, Turkey, just 60 miles from the Syrian border. Until now,... Weidenfeld, 95, once invoked Torschlusspanik, \"a German phrase which roughly translates as the panic before the closing of the doors,\" to explain why \"Im a man in a hurry.\" Remarkably healthy and stunningly energetic (as distant cousins, we are often in touch), he appears nowhere near any exit doors. But he is aware of and deeply troubled by the doors closing in on a community in Syria largely abandoned by the world. In context, the scale of the initial rescue is tragically small. The objective is to rescue 2,000 families. Compared to the carnage in Syria wrought by the pitiless combatants  230,000 dead, half the 22 million population driven from their homes  its a paltry sum. But these are real people who will be saved. And for Weidenfeld, that counts. Yet he has been criticized for rescuing just Christians. In fact, the U.S. government will not participate because the rescue doesnt extend to Yazidis, Druze or Shiites. This comes under the heading of no good deed going unpunished. Its a rather odd view that because he cannot do everything, he should be admonished for trying to do something. If Weidenfeld were a man of infinite means, the criticism might be valid. As it is, he says rather sensibly, \"I cant save the world.\" The Arab states, particularly the Gulf monarchies, are surely not without resources. With so few doing so little for so many, hes doing what he can. The United States and Turkey are finalizing plans for a military campaign to push the Islamic State group out of a strip of Syrian territory along the Turkish border, a move that would further embroil Turkey in Syrias civil war and set up a potential conflict with U.S.-backed Kurdish forces. A... The United States and Turkey are finalizing plans for a military campaign to push the Islamic State group out of a strip of Syrian territory along the Turkish border, a move that would further embroil Turkey in Syrias civil war and set up a potential conflict with U.S.-backed Kurdish forces. A... And for him, its personal. In 1938, still a teenager, he was brought from Vienna to London, where the Plymouth Brethren took him in and provided for him. He never forgot. He is trying to return the kindness, he explains, to repay the good that Christians did for him years ago. In doing so, he is not just giving hope and a new life to 150 souls, soon to be thousands. He has struck a blow for something exceedingly rare: simple, willful righteousness. Washington Post Writers Group, Charles Krauthammer is a Washington Post columnist. letters@charleskrauthammer.com]", "Date": "20150730", "Author": "[ Charles Krauthammer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-syria-syrian-christians-refugee-poland-weidenfeld-safe-havens-fund-perspec-07-20150730-story.html", "Title": "[ Among the ruins, a case of righteousness]"}