{"Content": "[ On a gusty spring day in 1986, Natalie Jaresko asked 500 Chicagoans gathered at Daley Plaza to pray for the victims of Chernobyl in Ukraine, site of the worlds worst nuclear accident. Only five days had passed since the power plant explosion, but thats all the time the 21-year-old DePaul accounting major needed to pull together the vigil. In a snapshot taken at the event, she appeared slight, almost fragile, as she served as the emcee, flanked by more than 20 bishops, priests and ministers. \"She was driven and focused from an early stage in her life, just naturally,\" recalls childhood friend Lesia Smolak-Semitka, who helped Jaresko organize the event. \"I just remember standing there and being in awe as to how many people came together and the amount of clergy on the stage  it was really powerful.\", Jareskos swift reaction to tragedy in Ukraine was telling, and in ways no one could have predicted, prescient. Nearly three decades later, the child of Chicagos close-knit Ukrainian-American community responded to another cry for help from a besieged Ukraine, accepting an appointment as its finance minister late last year. In leaving her Kiev-based investment firm to join the pro-Europe administration of President Petro Poroshenko, she took on the herculean task of trying to bring the former Soviet republic back from the brink of economic collapse in the midst of an ongoing war with separatists trained and equipped by Russian President Vladimir Putins government. \"This is a near-impossible job for anyone because the problems confronting the country are so grave,\" said former U.S. Ambassador to NATO Ivo Daalder, president of the Chicago Council on Global Affairs. \"Political instability has been the name of the game, corruption is deeply endemic in society and the capacity for the country to meet the needs of its people is limited. Thats what she faces.\", Ukraine Finance Minister Natalie Jaresko is trying to bring stability to an economy in dire straits. She is focused on easing a $40 billion debt load, a burden stemming from the corruption and mismanagement of the previous administration as well as the ongoing conflict in the nations eastern regions. Ukraines plight is indeed daunting. War in the eastern regions between separatists and government forces has claimed about 6,000 lives. Hostilities persist despite a February cease-fire. The crushing costs of conflict, combined with the corruption and mismanagement rife within the administration of Poroshenkos predecessor, Viktor Yanukovych, have left Ukraine with a plummeting currency, an economy in deep recession and $40 billion in debt, a sum equal to nearly 73 percent of its annual economic output. The International Monetary Fund last month provided a $17.5 billion loan package on the condition that Kiev adopts significant structural reforms and cuts in government spending. Another $7.2 billion in assistance is expected from other international lenders. In short order, however, Jaresko must persuade bondholders to provide an additional $15.3 billion in relief. \"Sometimes I think, What would my (late) father think of me now?\" Jaresko, 49, said during an interview last month in New York City, where she was working to renegotiate Ukraines crippling debt load. \"I think hed be proud. Im combining what he loved into my life. He loved his ancestry, where he came from, his culture. And he loved what freedom, democracy and free markets did in the United States. Im combining those things in Ukraine.\", Ukraine finance minister Natalie Jaresko and her friends and family from Chicago talk about how she was shaped by growing up in Illinois. (Chicago Tribune), Ukraine finance minister Natalie Jaresko and her friends and family from Chicago talk about how she was shaped by growing up in Illinois. (Chicago Tribune), Four months into the job, she says shes driven by a deep sense of urgency: \"We dont have time  time is an absolute luxury for a country battling for its sovereignty.\", The daughter of Ukrainian immigrants, Jaresko grew up in west suburban Wood Dale, and later Chicagos Ukrainian Village neighborhood. Throughout her childhood she developed a deeply ingrained bicultural identity, at once American and Ukrainian. Her father, John, arrived in the United States in 1949, served in the U.S. Army during the Korean War, went to the Illinois Institute of Technology on the GI Bill and went to work selling insurance to factories. Her mother, Mary, worked bookkeeping jobs at Goldblatts and other Chicago companies. Jareskos parents spoke mostly English at home but also insisted that their children attend Ukrainian Saturday school and Ukrainian Orthodox church on Sunday. \"Monday through Friday, we were very American. On Saturday and Sunday, we were very Ukrainian, between Ukrainian school, seeing our grandparents and going to church,\" Jaresko said. On a recent Saturday before St. Patricks Day, when many Chicagoans reveled in all things Irish, Ukrainian-American children dressed in traditional embroidered tunics lined up on a well-worn school stage to salute Ukraines famed 19th-century poet Taras Shevchenko with songs and skits in Ukrainian. The performance took place in the brick schoolhouse next to St. Volodymyr Ukrainian Orthodox Cathedral on West Cortez Street in Ukrainian Village, the same place where Jaresko spent every Saturday morning during her childhood. \"Having to get up and go to school on a sixth day was not viewed as a positive thing in life,\" Jaresko said. It often meant missing events related to \"regular\" school, from football games to band concerts. \"I cant say you understand it as a child, but I understand it now,\" she continued. \"The (Ukrainian) school gave us the base, the love of country, the poetry, the culture, the arts, the literature, the history. We were learning all this at a time when Ukraine was not a free country, and the philosophy was we had to learn it because if we didnt, it might disappear.\", While Jaresko attended classes at DePaul in the 1980s, she rented an apartment in Ukrainian Village. She and her girlfriends bought rye bread at Anns Bakery and Deli, crashed wedding receptions and threw back shots of vodka at a Ukrainian social club on Chicago Avenue. Looking back, her girlfriends joke that they couldnt get too out of line because of what they called the \"BBC,\" or \"baba-to-baba connection.\", \"It was all the grandmothers looking out their windows,\" Smolak-Semitka recalled. \"Everybody knew everything.\", Jaresko realized she had a direct, Chicago way of talking and debating after graduating from DePaul, which she described as a welcoming place for immigrants and blue-collar students. After DePaul she moved on to a masters program at Harvards John F. Kennedy School of Government. \"Some (Harvard) professors said I shouldnt be so forceful in my discussions, I should step back from debates a little bit,\" she recalled. \"I said, thats how everyone talks in Chicago. ... Its a culture I grew up in, among immigrants, Greek-Americans, Italian-Americans. People spoke openly.\", Moving out of her comfort zone in Chicago to study at Harvard proved to be a critical turning point for Jaresko. It led to a post at the State Department in Washington, where she worked on U.S.-Soviet economic relations for several years. In 1992, a year after the Soviet collapse, she arrived in Kiev to take a job as the economic section chief at the newly opened U.S. Embassy. She remembers her first moments in the Ukrainian capital. Rain was falling as she was driven past the Byzantine-inspired St. Sophia Cathedral, built in the 11th century to rival the Hagia Sophia in Istanbul. She thought of her paternal grandparents, who together with her father spent World War II in German forced labor camps and the postwar years in displaced person camps before finding sponsors who brought them to the States. And she thought of her grandmother, Maria, and a 200-mile pilgrimage she made before the wartime upheaval. \"She took a wagon from Poltava in central eastern Ukraine, a horse-drawn wagon, to Kiev, to go to St. Sophia and light a candle,\" Jaresko said. \"To this day it is the pinnacle of the spiritual upbringing they gave me. Certain places in Kiev. ... tie me back to my roots.\", Her fathers parents ended up living in South Lawndale, where her grandfather loaded livestock carcasses onto hooks in a meatpacking plant. Her grandmother on her mothers side worked two factory jobs and cleaned homes in Winnetka on the weekends. \"They were very hardworking people with very basic needs and desires,\" Jaresko said, her eyes filling with tears. \"Family and church were everything.\", In 1995 she plunged into the investment business, taking on the launch of a U.S. government fund that would invest $150 million in small-to-midsize businesses in Ukraine and neighboring Moldova as a way to foster private enterprise. \"That was pretty gutsy stuff,\" said diplomat Richard Haass, president of the Council on Foreign Relations. Jaresko was among his students at Harvards Kennedy School in the 1980s, and one he remembers as being \"extremely smart, extremely articulate.\", Within a year, the fund became a cornerstone of Horizon Capital, a private equity firm she founded with three partners. Horizon subsequently attracted enough foreign investment to launch two more funds. To date, the three funds have raised about $600 million to invest in the region. The Poroshenko administration approached Jaresko about the finance minister post during Thanksgiving week last fall, a period when her mother and her brother, John, happened to be visiting from the States. Over an American-style turkey dinner, and throughout the weekend, the family talked about little else than the decision, which would require her to become a citizen of Ukraine. Taking the job meant giving up the business she helped found, taking a drastic pay cut and having less time with her 10- and 16-year-old daughters, a wrenching choice for Jaresko, a divorced mother whose ex-husband lives in the U.S. Over the course of the week, she came to realize her daughters had grown up in Ukraines reform movement  her older daughter serving food and tea to pro-Western demonstrators last winter and later visiting wounded soldiers in the hospital, her younger one selling her toys to help Crimean families who had lost their homes. \"My girls have really matured,\" Jaresko said. \"They have an understanding that everyone needs to do their part.\", After intense conversations with Poroshenko and Prime Minister Arseniy Yatsenyuk to hash out needed reforms, Jaresko said their talks boiled down to this: \"If not you, who? If not now, when?\", \"I ended up saying, Yes \", kbergen@tribpub.com, twitter@kathy_bergen]", "Date": "20150410", "Author": "[ Kathy Bergen]", "Link": "http://www.chicagotribune.com/news/globalcity/ct-nw-ukraine-finance-minister-0412-20150410-story.html", "Title": "[  Chicago child of immigrants takes on 'near-impossible' task in Ukraine]"}