{"Content": "[ In recent decades, there have been many ways to make money and one virtually infallible formula for losing it: running an airline. At times, it might have made more sense for the major carriers to set up bonfires of cash on tarmacs rather than actually transport people. Lately, though, they have figured out how to avoid squandering huge sums. Hint: It involves charging more for their services than it costs to provide them. This strange development has set off alarms among people in Congress who think aviation should be a charitable activity. Sen. Richard Blumenthal, D-Conn. recently charged, \"Consumers are paying sky-high fares and are trapped in an uncompetitive market with a history of collusive behavior.\" He called on the Justice Department to launch an antitrust investigation, and last week, it said it was doing just that. The suspicion is that the big airlines have been using winks and nods to limit the number of planes in the sky. When too many seats are available, fares get slashed, profits vanish and, time after time, carriers go bankrupt. When fewer seats are offered, the opposite happens. The department suspects that when company executives tell Wall Street analysts they have learned their lesson about overexpansion, they are sending a clear nonaggression message to other airlines. A Justice representative said their talk about \"discipline\" on capacity suggests \"potential unlawful coordination.\", Yes, it could. And if New Orleans shop owners who got flooded after Katrina respond to a hurricane warning by closing, it could mean they are colluding with each other to maximize price-gouging opportunities after the storm is over. Or it could mean they have enough sense not to repeat ruinous mistakes of the past. Your tropical vacation hasnt even begun, and youre already out $100. Between the airport parking fee, luggage cart rental and overweight suitcase charge, the aviation industry has already wiped out your margarita fund. If the routine costs and annoyances werent enough, the airlines were cooking... Your tropical vacation hasnt even begun, and youre already out $100. Between the airport parking fee, luggage cart rental and overweight suitcase charge, the aviation industry has already wiped out your margarita fund. If the routine costs and annoyances werent enough, the airlines were cooking... Investors sometimes insist on verifying the sound judgment of those who want their money. \"There have been about two years of conference calls in which Wall Street analysts have browbeat airline executives to either have discipline or they will bust their recommendations on their stock,\" aviation analyst Robert W. Mann Jr. told The New York Times. Who can blame them? Those analysts werent born yesterday, which is about when the domestic industry got flush. Between 2000 and 2009, it lost $54 billion. No wonder investing guru Warren Buffett once groused that when the Wright brothers got their flying machine into the air at Kitty Hawk, someone should have shot it down. Year after year, American travelers took full advantage of the industrys habit of cutting fares and expanding capacity. But if something is too good to last, it wont. At some point, the airlines need to make money to stay in business had to prevail, at least temporarily, over passengers desire for bargains. Emirates airline vigorously defended itself Tuesday against allegations by U.S. airlines that it gets unfair government subsidies, releasing a written rebuttal that goes on for some 200 pages and hosting an 80-minute news conference by its president. Allegations by Delta, American and Chicago-based... Emirates airline vigorously defended itself Tuesday against allegations by U.S. airlines that it gets unfair government subsidies, releasing a written rebuttal that goes on for some 200 pages and hosting an 80-minute news conference by its president. Allegations by Delta, American and Chicago-based... Lately, the airlines have managed to make money, mainly by making sure they dont fly so many planes that they cant fill them up. When seats are empty, these carriers know, loss-inducing fare wars ensue. When planes are packed, they can be assured of covering their costs. The strategy has worked reasonably well. Since 2007, reports The Wall Street Journal, inflation-adjusted fares are up 5 percent  but they are 16.3 percent lower than in 2000. This year, fares are actually shrinking. Profits have reached record levels, thanks in part to higher baggage fees and other irksome charges. But there is no guarantee the good times will keep rolling. A recession  or a surge of growth  could upset the carriers plans. Airlines, like other businesses, have to worry about two dangers: having too much capacity, which requires costly discounting, and having too little, which drives customers away. Either mistake can be devastating. Right now, many big airlines are erring on the side of caution, but they are not cutting back capacity. Total capacity in the third quarter is expected to be up by more than 5 percent, well above the rate of growth in the economy. The Justice Department seems to be confusing collusion with prudent caution induced by repetitive trauma. Anyone who wants to bet that the airlines will stay profitable the next time theres a terrorism scare or a slump in the economy will have no trouble finding takers. When airlines were on the verge of drowning a few years ago, our leaders didnt offer a life preserver. Now that the industry has its head above water, Washington shouldnt toss it an anchor. Steve Chapman, a member of the Tribune Editorial Board, blogs at chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150708", "Author": "[ Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-airlines-justice-department-anti-trust-prices-perspec-0709-20150708-column.html", "Title": "[ Are the airlines colluding or just cautious?]"}