{"Content": "[ President Barack Obamas historic visit to a federal prison Thursday shows that his head and his heart are in the right place on criminal justice reform. As he said a few days earlier, Mass incarceration makes our country worse off, and we need to do something about it. The president overhauled the clemency process in April 2014 to much fanfare. He said that he wanted more worthy applications on his desk and that he was ready to act aggressively to approve them. But its hard to square that rhetoric, and the compassion Obama demonstrated by meeting with prisoners this past week, with the miserly announcement July 13 that hed granted clemency to 46 people. During his entire presidency, he has shortened just 89 sentences. Thats more than his recent predecessors, but its still an absurdly low number, and his stinginess is at odds with his publicly stated goals on criminal justice reform. The federal prison population hit a record high under Obama: 219,298 people in 2013, about 10,000 more than when he took office  so the presidents hands are not clean in the mass-imprisonment problem he seeks to correct with small gestures that make no visible dent. But over-imprisonment is a social and moral problem, not just a legal one. Obamas new clemency program isnt working and probably can never work because he runs requests through the governments legal bureaucracy: the White House Office of General Counsel and the Justice Department. The president, a lawyer himself, has ordered cumbersome legal reviews based on six new criteria that have made the process grindingly slow and unproductive. Defining clemency, But clemency is not a legal function, and it shouldnt be treated that way. The Constitutions framers designed clemency to be extra-legal  a check on the legal system, not part of it. As Alexander Hamilton put it in the Federalist Papers, clemency exists for reasons of humanity and good policy and to provide easy access to exceptions. The founders gave the president solo, unfettered clemency responsibility (Hamiltons word) because governments naturally tend to make criminal law overly severe, and one person appears to be a more eligible dispenser of the mercy of government, than a body of men. As President Barack Obama talked to reporters after becoming the first American president to visit a federal prison, his thoughts appeared to flash back to the \"Choom Gang.\", That was the nickname of the pot-smoking crew to which the future president belonged in his Honolulu high school days, according... As President Barack Obama talked to reporters after becoming the first American president to visit a federal prison, his thoughts appeared to flash back to the \"Choom Gang.\", That was the nickname of the pot-smoking crew to which the future president belonged in his Honolulu high school days, according... Federal prisons are full of human beings who need the president to exercise common sense and humanity, not his powers of legal scrutiny. The president is imprisoner in chief, a special role akin to commander in chief. Clemency is attached to his executive authority over federal police powers and the prison system. Obama is supposed to consider everything  race, morality, fairness, social harmony, geography, orphaned children, society, politics  when making clemency decisions. Running clemency, as Obama does, as another rinse in the legal laundry cycle is an abrogation of his constitutional responsibility. So how could Obama better dispense mercy, as Hamilton intended? Instead of tweaking clemency, he should make big changes. Change agents, First, he could transfer clemency reviews out of the Justice Department and put them in the Department of Health and Human Services. Tell HHS public health specialists to make recommendations based on Hamiltons constitutional criteria: humanity and good policy. Use the department that specializes in individual and social well-being to restore Hamiltons vision of clemencys extra-legal nature. The Justice Departments role should be limited to comments, the same as other stakeholders. The department that prosecuted a case and advocated for a sentence is not the appropriate one to conduct a neutral clemency review. President Obama, speaking after touring the El Reno Federal Correctional Institution, says the criminal justice system needs to distinguish between young people who make mistakes and those who are truly dangerous. (AP), President Obama, speaking after touring the El Reno Federal Correctional Institution, says the criminal justice system needs to distinguish between young people who make mistakes and those who are truly dangerous. (AP), Next, Obama should grant clemency to broad categories of prisoners, rather than slogging through specific cases. The prison population is too big for justice to advance one case at a time. Theres precedent for doing it this way. Jimmy Carter did not name each Vietnam draft-dodger when he granted amnesty in 1977, wiping out tens of thousands of criminal convictions. Obama could declare: No marijuana sentence shall be longer than 10 years; crack cocaine sentences shall be equal to those for powder cocaine; all nonviolent federal drug sentences shall be reduced by 20 percent. He doesnt have to wait for Congress to curb prison spending, give reprieves to people still serving racially biased crack sentences or accomplish most of his other criminal justice goals. Obama should set a numerical target for commutations, and a big one. Dont just accept whatever the lawyer machine extrudes. Give staff a goal, say 1 percent of sentences  about 2,000 people annually. That may seem like a startlingly large number to those with no concept of how the federal prison population has soared. In truth, its modest. If Obama commuted 2,000 sentences this year and next to time already served, he would still leave office with more federal prisoners than when he entered the White House. Even better, the president should set a goal for the maximum number of federal inmates by the time he leaves  say, 200,000  and tell staff to get him the best cases to hit the target. Managing the prison population is a proper executive decision. Only in government do results seem secondary to process. Clemency can be a prison management tool too. The Bureau of Prisons should have each warden recommend deserving inmates. Four recommendations per warden would equal about 500 clemency candidates per year. Prisoner behavior would improve immediately and dramatically with this powerful incentive to win freedom. Congress foolishly abolished parole for federal crimes in 1984, but prisoners need inducements to change. Let the clemency competition begin!, Finally, Obama should open the process beyond the narrow confines of the Office of the Pardon Attorney. Ask judges, governors, members of Congress and others for recommendations, and formalize a broad review process. Some judges have already written to the president, asking that he grant clemency to defendants whom they were forced to sentence to shamefully long mandatory terms. Now these letters gather dust in Justice Department clemency files. Why not ask each federal court district to recommend one clemency case a year? Tell lawmakers to do the same and make them responsible for vetting their candidates. Challenge each U.S. attorney to comb his or her files for one deserving case per year. Ditto the NAACP and other outside advocacy groups. Crowdsource the review process instead of keeping it in the bureaucracys lockbox. Do the right thing, Obamas narrow, legalistic approach to clemency blocks his own broad reform goals and excludes many of the most deserving prisoners. One heartbreaking example of who doesnt make the cut: Antonio Bascaro, 80, the longest-serving marijuana prisoner in U.S. history. Bascaro is a wonderful man with a great family whom Ive come to know through my work with The Clemency Report, which writes about prisoners who deserve freedom. He has been behind bars for 35 years for a pot conviction. He wasnt a kingpin, violent or notorious. He was a utility man in one of many groups of Cubans who used fishing boats to transport marijuana from Colombia to Florida during the 1970s to be smoked by college kids (like me). The leader of his enterprise was released in 1994. The gringo who bought all the weed and distributed it nationwide was released in 1996. Only Bascaro, now using a walker and a wheelchair to get around prison, is still behind bars. The technical reason is that he has a fluky old law sentence and isnt scheduled for release until 2019, at age 84. Obamas clemency process is designed to focus on the legal dross of this ancient pot case, not the injustice of a harmless octogenarian spending his 35th year in prison for no good reason, in an era when four states and Washington, D.C. have legalized marijuana. Obama has the power to do what Hamilton envisioned: let Bascaro spend tomorrow night in the suburban Atlanta home of his daughter Aicha. Instead, the old man will spend another one of more than 12,600 nights, and counting, in a prison cell because the president mistakenly thinks he needs a legal algorithm to know right from wrong. Humanity and good policy is not a legal concept. But it is why George Washington pardoned Whiskey Rebellion participants. It is why Franklin Roosevelt gave clemency to people convicted of alcohol offenses during Prohibition and why John Kennedy commuted the mandatory minimum sentences of many drug offenders. It is why various presidents gave pirates, bank robbers, polygamists and others second chances. And its why Obama should send Antonio Bascaro a message today through CorrLinks, the federal prisoner email system, saying: I apologize for the delay, but I have good news. Washington Post, Dennis Cauchon, a former national reporter for USA Today, is editor of The Clemency Report, which identifies prisoners it believes deserve shorter sentences.]", "Date": "20150720", "Author": "[ Dennis Cauchon]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-obama-criminal-justice-reform-clemency-20150720-story.html", "Title": "[ Obama is wrong: Granting clemency isn't a legal decision ]"}