{"Content": "[ Justice Antonin Scalia added a stellar new entry to the annals of wickedly entertaining U.S. Supreme Court dissents on Thursday. You didnt have to read between the lines. You didnt need to know the subtleties of the governments defense of a legal challenge to Obamacare: That Congress had flubbed in drafting the law but everyone knew what Congress meant. \"Words no longer have meaning if an exchange that is not established by a state is established by the state,\" Scalia wrote in his icy dissent. \"Under all the usual rules of interpretation, in short, the government should lose this case. But normal rules of interpretation seem always to yield to the overriding principle of the present court: The Affordable Care Act must be saved.\", Obamacare? \"We should start calling this law SCOTUScare,\" Scalia wrote. Zing. Chief Justice John Roberts has now twice rescued the Affordable Care Act from legal challenges that would have crippled it. In 2012, Roberts wrote the opinion for a 5-4 majority that upheld the laws individual insurance coverage mandate. And the conservative chief justice  yes, he still tends to be a conservative  wrote the majority opinion in the 6-3 ruling issued Thursday. It does remind us of the long-ago comment from Mayor Richard J. Daleys press secretary, Earl Bush: \"Dont print what he said. Print what he meant.\", Thursdays U.S. Supreme Court decision to uphold a pivotal regulation under the Affordable Care Act is, of course, a tremendous victory for the Obama administration. But it also establishes a principle thats likely to haunt future presidents. (Disclosure: As administrator of the Office of Information... Thursdays U.S. Supreme Court decision to uphold a pivotal regulation under the Affordable Care Act is, of course, a tremendous victory for the Obama administration. But it also establishes a principle thats likely to haunt future presidents. (Disclosure: As administrator of the Office of Information... At any rate, the majority accepted the argument that, despite what the laws language said, Congress did not intend to restrict Obamacare subsidies only to people who got insurance through state-run exchanges. \"Congress passed the Affordable Care Act to improve health insurance markets, not to destroy them,\" Roberts wrote. \"If at all possible, we must interpret the Act in a way that is consistent with the former, and avoids the latter.\", Millions of people whose coverage was at risk, including more than 200,000 people in Illinois, no doubt sighed with relief. So, perhaps, did Illinois Gov. Bruce Rauner, who did not seem eager for a fight over whether Illinois should create an exchange to preserve subsidies. While the legal challenges to Obamacare are winding down, big financial and structural challenges remain. Many insurers are seeking big premium increases for the next year. Many Americans who signed up for health coverage earlier this year have fallen off the rolls because they didnt pay their premiums. President Barack Obama took a victory lap on Thursday, while some GOP presidential candidates and congressional leaders vowed to repeal the law. Its time, though, to move on some changes that would preserve the best-liked elements of Obamacare while easing some of the financial pressures, and reverse incentives it has created. Among them:,  Ease the mandate that forces employers to cover employees who work 30 hours a week or more as full-timers. Setting that standard at 40 hours would encourage employers not to greatly curb workers hours or cut full-time jobs.  Exempt businesses that have fewer than 100 employees from the mandate to provide coverage that kicks in next year. Many small businesses cant afford it.  Offer Americans more choices for coverage. A proposed \"copper\" option, for instance, would appeal to people who want low premiums and protection from the cost of treating a catastrophic illness or injury. Call it Obamacare or SCOTUScare, its the law of the land. It can be vastly improved. It should be.]", "Date": "20150625", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-obamacare-supreme-court-roberts-edit-20150625-story.html", "Title": "[ Roberts rules of order on Obamacare]"}