{"Content": "[ The consultant at the center of a federal investigation into his firms $20.5 million no-bid contract with Chicago Public Schools acknowledged Wednesday that he advised Mayor Rahm Emanuels transition team in 2011 on picking the administrations first school CEO. The Tribune has also learned that a former Emanuel aide who served on his transition team and is considered an architect of the mayors education policies has been questioned by federal authorities looking into the contract. The developments provide new evidence of City Halls connection to the scandal, which so far has centered on the ties between consultant Gary Solomon and Emanuels second school CEO, Barbara Byrd-Bennett, who worked for Solomon before she joined CPS. The mayor, asked last month whether his administration played any role in the no-bid contract to SUPES Academy LLC, told reporters: \"No, you obviously know that by all the information available. And the answer to that is no.\", But its now clear that federal investigators have sought information from Beth Swanson, the Emanuel aide who worked most closely with the school board and the school systems executives, and that Solomons ties to the administration predate the arrival of Byrd-Bennett at CPS. Solomon, the owner of SUPES Academy, confirmed to the Tribune through a spokesman that he was contacted by a member of the mayor-elects transition team shortly after the February 2011 election and had played a role in the selection of Jean-Claude Brizard as Emanuels first school CEO. Federal corruption investigators looking into a $20.5 million no-bid contract at Chicago Public Schools also have asked for any records related to an elite nonprofit education group that has long been at the center of city school reform efforts  the first indication that the public relations problem... Federal corruption investigators looking into a $20.5 million no-bid contract at Chicago Public Schools also have asked for any records related to an elite nonprofit education group that has long been at the center of city school reform efforts  the first indication that the public relations problem... \"Mr. Solomon received a call in 2011 asking about potential superintendent candidates for Chicago Public Schools and discussed Mr. Brizard and others,\" said spokesman Dennis Culloton. He would not comment on which member of the transition team contacted Solomon or whether he was further involved in the process of bringing Brizard to Chicago. \"He certainly suggested him to the transition team member,\" Culloton said. He also said that Solomon was not a member of the transition team, \"nor did he have any conversations with the mayor.\", Culloton declined to comment on whether federal investigators have questioned Solomon about his involvement with the Emanuel transition team. But Swanson, who led Emanuels education transition efforts, confirmed to the Tribune through her attorney that Solomon was one of the people she talked to about hiring Brizard. Swansons attorney, Nancy DePodesta, also confirmed that Swanson was questioned by federal investigators. Acting Chicago schools boss Jesse Ruiz announced Wednesday that the district was suspending payment on a $20.5 million no-bid contract at the center of a federal criminal probe, but he also defended his own vote for the 2013 deal in his role as vice president of the Chicago Board of Education. Acting Chicago schools boss Jesse Ruiz announced Wednesday that the district was suspending payment on a $20.5 million no-bid contract at the center of a federal criminal probe, but he also defended his own vote for the 2013 deal in his role as vice president of the Chicago Board of Education. Swanson, currently a vice president at the Joyce Foundation, was interviewed April 24 at the U.S. attorneys office in the Dirksen U.S. Courthouse, according to her attorney, who emphasized that Swanson was only a witness and was cooperative with investigators. DePodesta declined to provide details about the interview. \"She has been advised repeatedly and definitively that she is not a subject of the investigation,\" DePodesta said. \"Nor is she involved in any wrongdoing.\", Swanson says in her biography posted on the Joyce Foundations website that she \"worked with Mayor Emanuel and other leaders to define the citys education policy agenda from birth through college.\", On Thursday, Emanuel was asked if he personally knew Solomon. \"No,\" the mayor replied after taking part in a ribbon cutting for a Northwest Side restaurant supply business. Emanuel did not answer when asked if he or anyone in his administration were aware of Solomons history before he made the CEO recommendation. On Wednesday, Emanuel spokeswoman Kelley Quinn said Solomon was not part of the transition team, adding that \"hundreds of people worked with the mayors transition team and offered ideas and recommendations for Cabinet positions, including candidates for Chicago Public Schools.\", Asked whether federal investigators have sought to question anyone in the mayors office about the contract, Quinn said no. Swanson was Emanuels education point person when the Emanuel-appointed school board voted 6-0 to award the SUPES contract as recommended by Byrd-Bennett. An internal investigation by the inspector general for Chicago Public Schools began in 2013, and a source has said that federal authorities have been looking at evidence for at least a year. A spokeswoman for U.S. Attorney Zachary Fardon declined to comment. The first public signs of the federal investigation came April 15, when CPS officials acknowledged that they had received federal grand jury subpoenas. Three days after the investigation was made public, CPS announced Byrd-Bennett was taking a paid leave of absence. The CPS contracts now under scrutiny both replaced and greatly expanded on an initial $380,000 program to train midlevel school executives through an agreement between SUPES and the Chicago Public Education Fund, a private philanthropy with strong ties to the mayor, Gov. Bruce Rauner and U.S. Commerce Secretary Penny Pritzker. That initial training program featured Byrd-Bennett as SUPES lead coach. The funds executive director, Heather Anichini, said fund officials were contacted by federal authorities and expect to be witnesses in the investigation. The fund has long been closely aligned with education initiatives at CPS, and there is often significant overlap between the leadership of the school board, the mayors office and the fund. Rauners wife, Diana, a major player in education reform efforts, also served as a member of Emanuels education transition team. She declined to comment through a spokeswoman at her education group, Ounce of Prevention. Anichini said the funds involvement with SUPES began after Emanuel became mayor in May 2011 and overhauled the leadership team at CPS. Anichini said the fund agreed to back the first year of SUPES training at the request of CPS officials but later declined to fund an expansion that would add principal training. Within months, Brizard was let go and Byrd-Bennett was picked by Emanuel to be his replacement. On the day the school board formally signed off on her hiring in October 2012, it also approved an initial $2.1 million contract for SUPES, expanding its early work training administrators to training principals. Federal subpoenas dated mid-April asked CPS to turn over all records related to SUPES Academy and two other Solomon-owned firms, Synesi Associates and Proact Search Inc. The subpoenas also request employment records for Byrd-Bennett and three of her longtime aides, Tracy Martin, Sherry Ulery and Rosemary Herpel. Chicago TribunesJohn Chase, Bob Secter and David Kidwell contributed. dheinzmann@tribpub.com, jjperez@tribpub.com, jcoen@tribpub.com]", "Date": "20150507", "Author": "[ David Heinzmann, Juan Perez Jr., Jeff Coen]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-school-contract-investigation-swanson-20150507-story.html", "Title": "[ New light shed on City Hall's ties to CPS scandal]"}