{"Content": "[ \"First off,\" Scott Walker proclaimed, \"we took on the unions, and we won. We won!\", Taking on the unions is usually first off for Walker, the Wisconsin governor and Republican presidential candidate. It is the very rationale for his candidacy. And on Thursday, he took a detour from the campaign trail to appear here before the annual meeting of the conservative American Legislative Exchange Council, a group of state legislators dedicated in large part to defeating unions. ALEC, which inspired many of Walkers anti-labor efforts in Wisconsin, drew several hundred union protesters as legislators arrived here this week for its annual conference  and this delighted Walker. \"I understand you had a few protesters yesterday,\" he told the conservative legislators. \"For us, thats just getting warmed up. Thats nothing. We got 100,000 protesters.\", Walker then went on to celebrate his triumphs over the demonstrators who objected to his dismantling of Wisconsins public sector unions, portraying the pro-union forces as violent thugs. \"Those big government interests  they believe they can win by intimidating elected officials,\" he said. \"There were amazing things they did to try to intimidate us. The good news is we didnt back down. We remembered the reason we were elected was not to serve the few in our state Capitol, but to serve the masses.\", This is the essence of Walkers appeal  and why he is so dangerous. He is not as outrageous as Donald Trump and Sen. Ted Cruz of Texas, but his technique of scapegoating unions for the nations ills is no less demagogic. Sixty-five years ago, another man from Wisconsin made himself a national reputation by frightening the country about the menace of communists, though the actual danger they represented was negligible. Scott Walker is not Joe McCarthy, but his technique is similar: He suggests that the nations ills can be cured by fighting labor unions (foremost among the \"big government special interests\" hurting America), even though unions represent just 11 percent of the American workforce and have been at a low ebb. Wisconsin Gov. Scott Walker has advice for Illinois Gov. Bruce Rauner on July 27, 2015. (WGN-TV), Wisconsin Gov. Scott Walker has advice for Illinois Gov. Bruce Rauner on July 27, 2015. (WGN-TV), Earlier this year, Walker likened the union protesters in Madison, Wis. to the murderous ISIS: \"If I can take on 100,000 protesters, I can do the same across the world.\" Before that, he described public sector union members as the \"haves\" taking advantage of the \"have-nots\"  the taxpayers. He denounced the protests against his efforts to undo the unions as \"thuggery.\" He described collective bargaining as a \"corrupt system\" and diagnosed union leaders as having a \"sense of entitlement.\" After beating public sector unions and surviving recall, Walker this year signed anti-union right-to-work legislation. He has said he doesnt think the minimum wage serves a purpose, and he has opposed prevailing-wage and living-wage requirements. The bulk of Walkers stump speech to the Koch brothers-financed ALEC was about how his \"big, bold reforms took the power out of the hands of big government special interests\"  namely, unions. Left unmentioned: how his big, bold reforms produced only half the number of jobs he promised, and resulted in delayed debt payments and deep cuts to education to overcome a budget deficit. Wisconsin Gov. Scott Walker has a bald spot on the crown of his head that looks to be about 3 inches in diameter. No big deal. Walker, who on Monday formally announced his candidacy for the Republican nomination for president, is 47, and politicians of all stripes have overcome follicle deficits... Wisconsin Gov. Scott Walker has a bald spot on the crown of his head that looks to be about 3 inches in diameter. No big deal. Walker, who on Monday formally announced his candidacy for the Republican nomination for president, is 47, and politicians of all stripes have overcome follicle deficits... Walker, describing the bargain shopping he does at Kohls department store, said he would do the same with taxes. Arguing that \"few people could afford\" high tax rates, he proposed that \"we can lower the rates, broaden the base and increase the value of people participating in our economy. Years ago, a plan like that worked pretty well. We called it the Laffer Curve back then. Today, I call it the Kohls Curve.\", It was a zany analogy. Kohls offers discounted merchandise for middle- and low-income consumers. The Laffer Curve, as the basis for supply-side economics, meant huge tax breaks for the rich that never trickled down. But deception is the demagogues tool. Walker spoke Thursday about \"the death threats not just against me and my family but against our lawmakers,\" and about the nails put in the driveway of one lawmaker to puncture his tires. Such behavior is beyond the pale  though hardly unique to Walkers opponents. And some of Walkers claims  including the alleged threat to \"gut\" his wife \"like a deer\" and of protesters \"beating\" and \"rocking\" a car he was in  could not be substantiated by independent authorities. Such deception, however, is only in the service of the larger deceit at the core of his candidacy: By scapegoating toothless trade unions as powerful and malign interests, he enlists working people in his cause of aiding the rich and the strong. Washington Post, Dana Milbank is a Washington Post columnist. Twitter @Milbank]", "Date": "20150727", "Author": "[ Dana Milbank]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-scott-walker-unions-perspec-0727-20150724-story.html", "Title": "[ Why Scott Walker is so dangerous]"}