{"Content": "[ Vowing to win the Republican presidential nomination on his own merits, Jeb Bush launched a White House bid months in the making Monday with a promise to stay true to his beliefs  easier said than done in a bristling primary contest where his conservative credentials will be sharply challenged. \"Not a one of us deserves the job by right of resume, party, seniority, family, or family narrative. Its nobodys turn,\" Bush said, confronting critics who suggest he simply seeks to inherit the office already held by his father and brother. \"Its everybodys test, and its wide open  exactly as a contest for president should be.\", Bush sought to turn the prime argument against his candidacy on its head, casting himself as the true Washington outsider while lashing out at competitors in both parties as being part of the problem. He opened his campaign at a rally near his south Florida home at Miami Dade College, an institution with a large and diverse student body that symbolizes the nation he seeks to lead. \"The presidency should not be passed on from one liberal to the next,\" he declared in a jab at Democratic favorite Hillary Rodham Clinton. And he said: \"We are not going to clean up the mess in Washington by electing the people who either helped create it or have proven incapable of fixing it.\", That was an indirect but unmistakable swipe at Republican presidential rivals in the Senate. Among them is his political protege, Florida Sen. Marco Rubio, who welcomed Bush into the 2016 contest earlier in the day. Bush enters a 2016 Republican contest that will test both his vision of conservatism and his ability to distance himself from family. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. Neither his father, former President George H.W. Bush, nor his brother, former President George W. Bush, attended Mondays announcement. The family was represented instead by Jeb Bushs mother and former first lady, Barbara Bush, who once said that the country didnt need yet another Bush as president, and by his son George P. Bush, recently elected Texas land commissioner. Before the event, the Bush campaign came out with a logo  Jeb!  that conspicuously leaves out the Bush surname. Bush, whose wife is Mexican-born, addressed the packed college arena in English and Spanish, an unusual twist for a political speech aimed at a national audience. \"In any language, my message will be an optimistic one because I am certain that we can make the decades just ahead the greatest time ever to be alive in this world,\" he said. \"I will campaign as I would serve, going everywhere, speaking to everyone, keeping my word, facing the issues without flinching,\", In the past six months, Bush has made clear he will remain committed to his core beliefs in the campaign to come  even if his positions on immigration and education standards are deeply unpopular among the conservative base of the party that plays an outsized role in the GOP primaries. Tea party leader Mark Meckler on Monday said Bushs positions on education and immigration are \"a nonstarter with many conservatives.\", \"There are two political dynasties eyeing 2016,\" said Meckler, a co-founder of the Tea Party Patriots, one of the movements largest organizations, and now leader of Citizens for Self-Governance. \"And before conservatives try to beat Hillary, they first need to beat Bush.\", Yet a defiant Bush has showed little willingness to placate his partys right wing. Instead, he aimed his message on Monday at the broader swath of the electorate that will ultimately decide the November 2016 general election. Minority voters, in particular, have fueled Democratic victories in the last two presidential elections. Of the five people on the speaking program before Bush, just one was a white male. He was not planning to address immigration on Monday, but protesters left him little choice. Just as he introduced his mother, a group of several people removed their outer shirts, revealing yellow T-shirts that spelled out: \"Legal status is not enough.\", Bush responded by departing from his prepared remarks: \"Just so that our friends know, the next president of the United States will pass meaningful immigration reform, so that that will be solved  not by executive order.\", He prefers creating a path to legal status for the millions of immigrants now living in the country illegally as part of an overhaul, rather than a path to U.S. citizenship. Bush is one of 11 major Republicans in the hunt for the nomination. Wisconsin Gov. Scott Walker and Ohio Gov. John Kasich are among those still deciding whether to join a field that could end up just shy of 20. Bushs critics in both parties have criticized him as aggressively as they would if he were the clear Republican favorite. Kentucky Sen. Rand Paul said Monday theres \"Bush-Clinton fatigue\" in America. \"I think some people have had enough Bushes and enough Clintons,\" Paul said in an interview with The Associated Press. Associated Press]", "Date": "20150615", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-jeb-bush-president-campaign-20150615-story.html", "Title": "[ Jeb Bush enters 2016 presidential race, casts himself as outsider]"}