{"Content": "[ With three seats up for election April 7 on the Hinsdale High School District 86 Board, six candidates have divided themselves into two slates. \"Experience matters\" is the slogan of one slate. The other promotes itself as \"the conservative slate.\", Incumbent Jennifer Planson is running with Bill Carpenter and Kathleen Hirsman on the experience matters slate. The conservative slate consists of the board President Richard Skoda, Greg Gershuny and Fred Cappetta. Chris Frank is running as a write-in candidate. Teacher contract, One issue those elected this year will face is another teacher contract negotiation. The agreement approved in October will expire in June 2016, leaving contentious issues from last year ready to percolate again, including the salary schedule for teachers and retirement incentives, which grants raises in the final years before a teacher retires. Both slates oppose the incentives, commonly called \"pension spiking.\", \"Pension bumps are still legal, but they are economically unsustainable,\" Hirsman said. Planson said her goal for the current contract was to end pension spiking, and while it didnt happen, the did lower the annual raises from 6 percent to 3 percent. Planson said her goal is for pension spiking \"to be eliminated by the end of next contract.\", Skoda had sought to eliminate such raises from the current contract and has opposed them. His board majority asked the voters what they thought via an advisory referendum in November. Nearly 70 percent of District 86 voters opposed the practice. Planson and Carpenter both want staff raises to not exceed the consumer price index. School boards are limited in the current economy to increasing the property tax levy no greater than that index, which has been around 1.5 percent in recent years. The boards negotiating team last year proposed raises less than the consumer price index, because teachers also receive increases based on years working and advanced education. When such \"steps\" in the salary schedule are included, the average raise for District 86 teachers under the current contract is 3.9 percent. All the candidates agree the salary schedule needs to be revised. Planson said the Hinsdale High School Teachers Association is \"aware the salary schedule cannot be maintain currently as it is.\", Whether it will be changed drastically or incrementally, will be an ongoing conversation, she said. \"We cant just say we are going to get rid of it,\" Carpenter said. \"It may need to be adjusted,\" but in a way that teachers will accept, he said. The district also can economize in areas other than salary, such as how benefits are structured, he said. Skoda said he expects the next negotiations will be affected by action by state leaders with changes in the way pensions are paid for and the rules for negotiation with unions. Skoda said he does not expect the teachers association will be in a hurry to negotiate because \"the economy is improving.\" Consequently, the CPI could rise, which would have a positive impact on salaries. \"We believe there is enough revenue, it just needs to be managed more carefully,\" Skoda said. One way to do that would be to not give staff salary increases higher than the CPI and to have employees pay more for their benefits, he said. Skoda chose to seek a fifth term on the School Board because people associate his name with a position. They may think, \"This guy almost caused a strike,\" Skoda said. Or they may think of him as the person who voted for the zero levy. The outcome of the election will be like \"a referendum on how the board majority is handling things,\" he said. \"It will be a good, honest, fair way to get a bellwether of the community.\", Gershuny said he does not want to comment on a teachers contract \"without seeing the district finances. I really need to see all the data before I have an opinion. I think that is what the voters expect.\", Carpenter said he has learned a lot on the Cass District 63 School Board, which went from a budget deficit to a surplus during his two terms. \"I learned how to put a budget together and how to live within that budget,\" Carpenter said. \"My approach is you underestimate your revenues and overestimate your expenses.\", Board interaction, Hirsman has never held elected office, but as a lawyer she represented suburban school boards for 25 years. In 2009, Hirsman left the firm of Scariano, Himes and Petrarca to concentrate on teaching law. She started regularly attending District 86 Board meetings this school year. \"I found it very, very concerning,\" Hirsman said. She said she hopes of \"returning civility to the board.\" She believes a sense of respect and collegiality is lacking, which makes it difficult for the board members to reach consensus. Hirsman also said with her background she could advise the board \"how not to spend excessive amounts on legal fees.\", Carpenter also would want a more collegial board. Once a vote is taken, all the board members should support the decision, he said. \"There should never be any finger pointing or calling out,\" about how someone voted, Carpenter said. Cappetta, a lawyer and Vietnam veteran, said he learned how to lead in the military. \"The issues arent simple. They are made up of 50 little pieces,\" Cappetta said. \"Im going to read the packets (of information for each meeting). Im going to understand the details and I can make decisions on what is fair and right.\", Gershuny is the newest resident of all the candidates, having moved to Hinsdale with his family about 15 months ago from Georgia. He became interested in the School Board, he said, when he received \"a very interesting mailer.\", The mailer, sent out as the School Board was negotiating a new contract with the teachers, listed salaries of District 86 teachers compared with other public and private schools, and compared the rising cost of salary and benefits with the consumer price index. Community members at School Board meetings later challenged the accuracy of some of the data. But Gershuny, who is a native New Yorker, said he had never seen a School Board send out such detailed information. The mailer also reported the Hinsdale High School Teachers Association in May had given their officials authority to strike, a fact which \"didnt sit right with me,\" Gershuny said. \"I felt the compelling need to get involved,\" he said. Like Hirsman, Gershuny also was disturbed by \"the tremendous lack of decorum and mutual respect\" he saw between members of the School Board and the audience during meetings. Gershuny said his father was a liberal, and he himself has worked on congressional campaigns for Democratic candidates, so he can appreciate different points of view. \"I want to solve problems together,\" Gershuny said. Write-in, Frank said, if elected, he plans on \"representing the moderate and apolitical viewpoints of parents who are tired of the in-fighting.\", Frank registered as a write-in candidate after a committee of the DuPage County Election Commission in January determined he did not have enough valid signatures on his nominating petitions for his name to appear on the ballot. Among his goals would be \"to provide the best possible education at the best possible cost to district students by continually challenging the status quo and supporting new ways of doing things.\", Frank also said he would demonstrate sound fiscal management based on needs, not wants. The candidates, Jennifer Planson, Age: 46, Home: 14-year resident of Willowbrook, Children: Two, a sophomore and senior at Hinsdale Central, Occupation: Homemaker, Education: Bachelor of science in sociology from Illinois State University, Slate: Experience matters, Civic/service experience: Eight years on Gower Elementary District 62 Board, including four years as board president; four years on District 86 Board; coordinator for PADS program at United Methodist Church in Hinsdale. Kathleen Hirsman, Age: 60, Home: 30-year resident of Clarendon Hills, Children: None, Occupation: Full-time faculty member at Loyola University Law School, teaching school law and employment issues in the education workplace; adjunct faculty member in graduate education program at Concordia University. Education: Bachelor of arts from Kalamazoo College, masters degree in linguistics, with specialization in English as a Second Language, from University of Illinois Chicago; law degree from Loyola University Law School, Chicago. Slate: Experience matters, Civic/Service experience: Active in Notre Dame Parish in Clarendon Hills, Bill Carpenter, Age: 43, Home: 16-year resident of Darien, Children: Two, a sophomore and senior at Hinsdale South, Occupation: Self-employed accountant, Education: Bachelor of Science in accounting from University of Illinois at Chicago, Slate: Experience matters, Civic/Service experience: Two four-year terms on Cass Elementary District 63, vice president of Hinsdale South Athletic Club; past president of Darien Chamber of Commerce; past vice president and baseball commissioner of Darien Youth Club, Richard Skoda, Age: 61, Home: 36-year resident of Hinsdale, Children: Two daughters, ages 28 and 30, one a Hinsdale South graduate, one a Hinsdale Central graduate, Occupation: Retired teacher of 35 years, primarily at Morton West High School in Berwyn, and one year teaching history at Illinois State University, Education: Bachelor of science in history and English, masters degree in history, doctorate in history, all from Illinois State University, Slate: Conservative slate, Civic/Service Experience: Four four-year terms (1997 to 2009 and 2011 to 2015) on District 86 Board; former high school and volunteer soccer coach, Greg Gershuny, Age: 45, Home: Hinsdale since January 2014, Children: Three daughters, ages 13, 10 and 8, Occupation: Vice president of commodity trading at Hunter Douglas Metals, Education: Voice signal intercept training at Defense Language Institute in Monterey, Calif. while serving in the U.S. Army; bachelor of arts in Russian language from the State University of New York at Albany, Slate: Conservative slate, Civic/service experience: Six years total active duty and reserves in U.S. Army; volunteer girls soccer coach for five years, Fred Cappetta, Age: 74, Home: 38-year resident of Oak Brook, Children: Four, ages 36 to 49, oldest was a Hinsdale Central graduate, Occupation: Attorney, Cappetta & Associates, Ltd. in Oak Brook, Education: Bachelor of business administration, accounting, from University of Notre Dame; law degree from DePaul Law School, Slate: Conservative slate, Civic/Service experience: U.S. Army captain, Vietnam veteran; former dean of Worsham College of Mortuary Science; life trustee and former member of Fenwick High School Board of Trustees; former chairman of Oak Brook Fire and Police Commission, Chris Frank, Age: 46, Home: 18-year resident of Westmont, Children: Three sons, ages 12, 16 (a junior at Hinsdale Central) and 18, Occupation: Chemical engineer at BP Refining and Logistics Technology, Education: Bachelor of science in chemical engineering from University of Illinois; master of business administration from DePaul University, Slate: independent, write-in candidate, Civic/Service Experience: Assistant coach for youth baseball, three years; and assistant coach for youth football for one year]", "Date": "20150309", "Author": "[ Kimberly Fornek]", "Link": "http://www.chicagotribune.com/suburbs/hinsdale/news/ct-dhd-d86-elect-2015-tl-0312-20150309-story.html", "Title": "[ Seven vie for three seats on Hinsdale High School District 86 Board]"}