{"Content": "[ In August 1935, in the midst of the Great Depression, President Franklin D. Roosevelt signed The Social Security Act, establishing a national plan to provide economic security for the nations workers. The programs 80th anniversary is a good time to review the popular safety net. At the end of 2014, 59 million people were receiving Social Security benefits: 42 million retired workers and their dependents, 6 million survivors of deceased workers, and 11 million disabled workers and their dependents. Meanwhile, 166 million workers had earnings covered by Social Security. Social Security is a pay-as-you-go system, which is funded by payroll taxes. Every employee (and employer) pays a 6.2 percent tax (FICA) on earnings up to a limit, which changes each year with changes in the national average wage index. This year, the Social Security wage base is $118,500. If you are self-employed, you have to pay as both the employer and the employee, for a total of 12.4 percent. The wage base is not an arbitrary number: In 1983, the last time that Congress significantly reformed Social Security, it was pegged at an amount that would tax about 90 percent of all wage income in the United States. According to the National Committee to Preserve Social Security and Medicare, because high-end earnings have grown faster than the rest of the income curve, the current wage cap \"covers about 83 percent of wages.\" If the wage base were increased to cover 90 percent of earnings, the cap would rise to about $240,000. In 1977, Congress enacted a change in Social Security, whereby a planned 2011 rate hike became effective in 1990. As a result, the government received more money from taxes than was necessary to fund the Social Security obligations, creating a surplus that exists to this day. But with Baby Boomers retiring in large numbers, the surpluses are on track to shrink and eventually disappear. According to the 2015 annual report of the board of trustees, the Social Security Trust Funds assets are now $2.79 trillion, up by $25 billion from last year. The lions share of the increase is due to the improving labor market: As more people are employed, they have to pay into the system. The trustees estimate that this year, total income (85 percent payroll taxes, 11 percent interest on the reserves and 3 percent income taxes paid on benefits) will exceed its expenses by over $9.2 billion and that total annual income should exceed Social Security obligations through 2019. After 2019, the Treasury will start spending down the surplus, with estimates of depletion in 2035. What happens then? There will still be enough income coming into the program to pay 79 percent of all benefits owed. These projections assume that no legislative changes are enacted, which seems unlikely because Social Security is the major source of income for most of the elderly. How can we beef up Social Security? As mentioned above, lawmakers may tinker with the wage base or potentially increase the amount of payroll tax. According to the trustees, a 2.62 percentage point FICA tax increase (from 6.2 percent to 7.5 percent) could keep benefits at current levels through 2090. There has also been talk of cutting or means-testing benefits. The trustees predict that an immediate benefit cut of 16.4 percent would close the funding gap if it applied to everyone entitled to receive Social Security. The percentage would jump to 19.6 percent if cuts were limited to those who havent yet started receiving benefits. Finally, the program could also slowly increase full retirement age. This would likely phase in for younger Americans and it would occur over a long time horizon. The good news is that a combination of these ideas would solve the Social Security issue -- hopefully before the 100th anniversary. (Contact Jill Schlesinger, senior business analyst for CBS News, at askjill@JillonMoney.com.),  (c) 2015 Jill Schlesinger Distributed by TRIBUNE CONTENT AGENCY, LLC]", "Date": "20150813", "Author": "[ Jill Schlesinger, Tribune Content Agency]", "Link": "http://www.chicagotribune.com/business/sns-201508131200--tms--retiresmctnrs-a20150813-20150813-story.html", "Title": "[ Social Security at 80: A pillar of economic security for Americans]"}