{"Content": "[ The National Labor Relations Board on Monday dismissed a union election petition from Northwestern University football players, halting a push to organize college athletes. The unanimous decision by the five-member board puts an end to a nearly two-year saga that led to the first-ever union election by college football players. The case also started a national conversation about college athletes, their roles within school athletic systems and the conditions under which they play and study, a discussion that has resulted in some policy changes benefiting athletes. Despite the dismissed petition, the board did not rule on whether the football players are employees of the university under federal labor law, leaving the door open for the union to try again, which it has vowed to do. William Gould IV, a former NLRB chairman, said he wasnt surprised that the NLRB avoided a decision on whether football players are employees, given Congress hostility toward the board. Some Republican lawmakers have proposed to eliminate federal funding for the agency, calling it a pro-union organization and a government waste. \"The board has punted it,\" Gould said. \"The message the board has given us is that these are waters that they are reticent, reluctant, to tread in.\", In a statement, Northwestern said it was pleased with the decision. \"Northwesterns position remains that participation in athletics is part of the overall educational experience for our student-athletes, not a separate activity,\" Alan Cubbage, vice president for university relations, said in a statement. Cubbage said Northwestern intends to continue to work with its students, and others, to address the issues brought up by the unionization drive, including the long-term health impact of playing intercollegiate sports and providing additional grant-in-aid support for players. The NLRB blocked a historic bid by Northwestern University football players to form the nations first college athletes union, dealing a blow to a labor movement that could have transformed amateur sports. (AP), The NLRB blocked a historic bid by Northwestern University football players to form the nations first college athletes union, dealing a blow to a labor movement that could have transformed amateur sports. (AP), Among the unions demands were financial coverage for former players with sports-related medical expenses, the creation of an educational trust fund to help former players graduate and commercial sponsorship compensation for players. In reforming concussion protocols last year, the Big Ten conference partially adopted one of the unions demands. An independent athletic trainer is now required in the replay booth with a separate video monitor and the ability to contact officials on the field. The 14 schools in the conference now also honor scholarships throughout an athletes time in school, instead of putting them up for renewal annually. \"Northwestern football players lost this battle but college players in general are winning the war against the (National Collegiate Athletic Association),\" said Eldon Ham, a Chicago sports attorney and adjunct professor at the Illinois Institute of Technology Chicago-Kent College of Law. Ham added that the unionization campaign hurt the image of the schools and the NCAA, making them look greedy, and it advanced the idea of some day compensating college athletes for endorsements and royalties from video games, among other things. A week into fall camp, Northwestern already is 1-0. The National Labor Relations Boards decision to dismiss a union election petition means NUs long, national nightmare is over. Think thats putting it in overly dramatic terms? Maybe. But do you recall what coach Pat Fitzgerald told the Tribune... A week into fall camp, Northwestern already is 1-0. The National Labor Relations Boards decision to dismiss a union election petition means NUs long, national nightmare is over. Think thats putting it in overly dramatic terms? Maybe. But do you recall what coach Pat Fitzgerald told the Tribune... Because the board didnt outright reject the idea that football players are employees of the university, opting instead to skirt the issue, the unionization of college athletes still has a chance, Ham said. The board declined to \"assert\" jurisdiction over the case because doing so would not promote uniformity and labor stability in college football and could potentially upset the competitive balance between college teams, the board said in its opinion. The board analyzed the nature, composition and structure of college football and concluded that Northwestern football players would be attempting to bargain with a single employer over policies that apply league-wide. Northwestern is one of more than 120 schools in the football bowl subdivision of the NCAA. The majority of the schools are public universities and thus fall outside the boards jurisdiction. Also, some states have laws specifying that athletes at public universities are not employees. The board noted that Northwestern is the only private school that is a member of the Big Ten, and thus the board cannot assert jurisdiction over its competitors. And it added that cases concerning professional sports involve league-wide bargaining units, not individual ones. \"This, too, is a situation without precedent because in all of our past cases involving professional sports, the board was able to regulate all, or at least most, of the teams in the relevant league or association,\" the board said in its decision. If the players were allowed to unionize, they could bargain over NCAA policies that are meant to ensure competitive balance among the teams, potentially giving Northwestern football players an advantage. However, the board said that its decision does not \"preclude a reconsideration of this issue in the future.\" If circumstances change, it added, the board \"may\" revisit its policy. Ramogi Huma, a former UCLA linebacker and president of the College Athletes Players Association, or CAPA, the union seeking to represent Northwesterns football players, said the boards decision is disappointing because it \"delays the leverage the players need to protect themselves.\" Football players, he added, continue to face traumatic brain injuries. Huma said that while the decision leaves the union with no avenue to appeal, it doesnt prevent other college athletes from pushing for unionization. \"The fight for college athletes rights will continue,\" he said. However, Martin Malin, a professor of labor law at the Chicago-Kent College of Law, said another union election would be unlikely in the near future because while the decision only affects Northwestern, it could be applied to other college athletes. \"This is it,\" Malin said. Ballots from an April 2014 union election by Northwestern football players will be destroyed without being counted. The players voted on whether they wanted to be represented by CAPA after a regional director of the NLRB granted them employee status under federal labor law. Northwestern appealed the regional directors decision to the NLRB in Washington, so the ballots were sealed inside a box after the election. The legal fight began in January 2014, when the players filed an election petition with the Chicago office of the NLRB. \"Well eventually get a breakthrough,\" said Kain Colter, a former Northwestern quarterback and the face of the unionizing effort. acancino@tribpub.com, Twitter @WriterAlejandra, ]", "Date": "20150817", "Author": "[ Alejandra  Cancino]", "Link": "http://www.chicagotribune.com/business/ct-northwestern-football-union-decision-0818-biz-20150817-story.html", "Title": "[ Northwestern football union petition dismissed by labor board]"}