{"Content": "[ The early stages of the Republican Partys presidential primary campaign have seemed like an elaborate prank. A loony billionaire single-handedly demolishes the partys brand among Latino voters, an equally loony nonbillionaire talks about doing away with the Supreme Court and a governor sues the federal government just so food stamp recipients in his state can face the ignominy of drug tests. This couldnt possibly be unscripted. I keep waiting for Republican National Committee Chairman Reince Priebus to drop balloons on a Donald Trump press conference and shout, \"Hah! Were just messing with you guys, heres an actual big-tent conservative who doesnt sound like a Dickensian villain or a xenophobic Internet comment come to life.\", But it never happens. Trump becomes increasingly unhinged and spends the weekend claiming Sen. John McCain, a prisoner of war in Vietnam, isnt a hero. Wisconsin Gov. Scott Walker hints that he thinks people choose to be gay. And Rick Santorum tells a crowd in Iowa that we should worry not just about illegal immigration but about the legal kind as well. Attempting to put a positive spin on the attention Trump has been getting, Pennsylvania GOP Chairman Rob Gleason told The Associated Press: \"Now theres more people interested in what the Republican Party has to say. Its all good.\", No, Mr. Gleason, its not all good. Its very much the opposite of good. You would be wise to spend the next few months shouting, \"MOVE ALONG, FOLKS! NOTHING TO SEE HERE!\" because only two categories of people are presently responding well to what the Republican Party is saying: those so loosely tethered to reality that they think Trump would make a good president, and those who are Hillary Clinton. Republican presidential candidate Donald Trump criticized Sen. John McCains military record at a conservative forum Saturday, saying the partys 2008 nominee and former prisoner of war was a \"war hero because he was captured. I like people who werent captured.\", The comment drew some boos from... Republican presidential candidate Donald Trump criticized Sen. John McCains military record at a conservative forum Saturday, saying the partys 2008 nominee and former prisoner of war was a \"war hero because he was captured. I like people who werent captured.\", The comment drew some boos from... Primary campaigns can be messy in the early stages, of course, but many members of the ever-growing GOP field are behaving like contestants on a reality show in which the prize is \"not winning the presidency.\", Its a bit surprising. In the wake of the 2012 election, with the GOP reeling from a second loss to Barack Obama, a task force came up with a study that was supposed to provide conservatives with a clearer path to victory in 2016. Some called it an autopsy, though the 97-page documents official name was the \"Growth & Opportunity Project.\" In retrospect, party officials should have called it: \"A 97-Page Document That We Will Completely Ignore.\", Consider this excerpt from early in the report: \"... many minorities wrongly think that Republicans do not like them or want them in the country.\", That led to this conclusion: \"If Hispanic Americans perceive that a GOP nominee or candidate does not want them in the United States (i.e. self-deportation), they will not pay attention to our next sentence. It does not matter what we say about education, jobs or the economy; if Hispanics think we do not want them here, they will close their ears to our policies.\", On Monday, Wisconsin Gov. Scott Walker officially became Republican presidential candidate No. 15. First, he came out with a campaign videothat was more amber waves of grain and fruited plains than about the candidate, but he made his point that he is a conservative who will \"fight and win for... On Monday, Wisconsin Gov. Scott Walker officially became Republican presidential candidate No. 15. First, he came out with a campaign videothat was more amber waves of grain and fruited plains than about the candidate, but he made his point that he is a conservative who will \"fight and win for... You know your Latino voter outreach is going poorly when the Republican candidate currently leading in a number of polls refuses to back down from a claim that many Mexican immigrants are rapists and drug dealers. Good luck prying those ears back open. The \"Growth & Opportunity Project\" report also noted that young voters \"are increasingly rolling their eyes at what the Party represents.\", As to the youthful voter eye-rolling, consider this: Younger voters are strong supporters of same-sex marriage. GOP candidates have, by and large, been fierce opponents, with Louisiana Gov. Bobby Jindal reacting to the Supreme Courts legalization of same-sex marriage by suggesting we \"just get rid of the court.\", Per the GOP report: \"For the GOP to appeal to younger voters, we do not have to agree on every issue, but we do need to make sure young people do not see the Party as totally intolerant of alternative points of view. Already, there is a generational difference within the conservative movement about issues involving the treatment and the rights of gays  and for many younger voters, these issues are a gateway into whether the Party is a place they want to be.\", Voters across the board favor raising the minimum wage. Walker recently described the minimum wage as \"lame\" and removed the words \"living wage\" from Wisconsin state laws to make it harder for low-income workers to appeal for a minimum wage increase. (Hes also the guy whos suing the federal government because he wants to force food stamp recipients to pee in cups. Other states have tried this form of poor-person shaming and found that testing is costly and ineffective because the rate of drug use among people on food stamps is  surprise!  quite low.), A majority of Americans do not want Obamacare repealed. The Republican candidates continue to rage against Obamacare. A majority of Americans favor the Obama administrations nuclear deal with Iran. GOP candidates are tripping over themselves to say theyll do away with the deal on their first day in office. I half-expect the first GOP debate in August to feature a lengthy discussion on the good that can come from legalizing puppy hunting. Perhaps the most important part of the GOP autopsy was this: \"The Republican Party needs to stop talking to itself. We have become expert in how to provide ideological reinforcement to like-minded people, but devastatingly we have lost the ability to be persuasive with, or welcoming to, those who do not agree with us on every issue.\", That was written nearly 21/2 years ago. Whos going to listen to you if you dont even listen to yourselves?, rhuppke@tribpub.com]", "Date": "20150720", "Author": "[ Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-gop-candidates-huppke-20150720-story.html", "Title": "[  GOP primary looks like an elaborate prank]"}