{"Content": "[ When asked to pinpoint where Jeb Bushs presidential effort began running into trouble, many confidants utter a single word: Dallas. Mike Murphy, Bushs political alter ego, decided early on to hold regular senior staff meetings at an unusual location: a Hyatt hotel inside the terminal at Dallas/Fort Worth International Airport. The idea was that it was a central and relatively inexpensive gathering place for a team scattered from Los Angeles, where Murphy lives, to Miami, where the would-be candidate resides. It went fine at first but quickly became an awkward routine. Donors and other Republicans found the setup ungainly for a campaign-in-waiting that was supposed to be based in Florida. Older Bush hands also grew unhappy with rapid hiring by new advisers, and relationships frayed, according to Bush associates. And as the former Florida governor began to founder on the trail and in the polls, the discussions flared into arguments about how to divvy up money and resources between Bushs allied super PAC and his official campaign. \"These things are always tug of wars,\" Thomas Rath, a Bush family friend in New Hampshire, said of the initial sessions. \"Its almost like the first day of school, everyone trying to get to the right place and find the right seats.\", The airport huddles were just one sign among many of a political operation going off course  disjointed in message and approach, torn between factions and more haphazard than it appeared on the surface. Bushs first six months as an all-but-declared candidate have been defined by a series of miscalculations, leaving his standing considerably diminished ahead of his formal entry into the race on Monday. Capping the two-day German leg of a European... Capping the two-day German leg of a European... In interviews this week, dozens of Bush backers and informed Republicans  most of whom spoke on the condition of anonymity in order to comment candidly  described an overly optimistic, even haughty exploratory operation. Strategic errors were exacerbated by unexpected stumbles by the would-be candidate and internal strife within his team, culminating in a staff shake-up this week. The original premise of Bushs candidacy  that a bold, fast start would scare off potential rivals and help him overcome the burden of his last name  has proved to be misguided. His operations ability to rake in large checks also fueled inflated expectations. Supporters acknowledged this week that an allied super PAC was likely to fall short  perhaps substantially  of predictions that it would bring in $100 million in the first half of the year. On the stump, Bush has stuck to his pledge not to shift to the right to win the primary, but his middle-of-the-road positions on immigration and education have come off more as out of step with the base of his party than shrewdly pragmatic. His wonky question-and-answer exchanges with voters sometimes resemble college lectures rather than a friendly appeal for votes. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. The troubles have eroded the image Bush has sought to present as the one Republican uniquely ready for the presidential stage. He has slipped in polls from presumed front-runner to one of several candidates jumbled toward the top of an increasingly crowded field. \"Weve learned that the prospect of a big financial advantage is not going to keep people out of the race and that the notion of a new face is stronger than we might have thought,\" Vin Weber, an outside Bush adviser, said in an interview. \"That requires modest adjustments in strategy, not wholesale changes.\", After weeks of bad press, \"donors were getting a little edgy,\" Weber said. \"No one is ready to jump ship. Nobody has lost heart. But they have watched other candidates rise in the polls.\", Speaking Wednesday in Berlin during an overseas trip, Bush expressed confidence. \"Its June, for crying out loud, so weve got a long way to go,\" he said, adding later: \"Im going to compete everywhere. If Im a candidate, theres no fifth-place, you know, kind of mentality in my mind.\", Forced to make up lost ground, Bush, his aides and his super-PAC allies are now preparing plans to attack the records and experience of his GOP competition, especially Sens. Marco Rubio of Florida and Rand Paul of Kentucky and Wisconsin Gov. Scott Walker. A summer originally envisioned as a season of slow and warm introductions to voters is now poised to be a battle as Bush tries to recapture his place atop the field. \"The Bushes have always underestimated the depth of the bases dissatisfaction with their policies, and they take the criticism personally,\" Laura Ingraham, a conservative talk-radio host, said in an interview. \"Jeb has to try to understand the reasons why conservatives have problems with him instead of crowing about how principled he is.\", Aides bristle at what they consider the medias relentless focus on Bushs personal and professional past. They say that out on the campaign trail, in visits to more than a dozen states, he has been doing exactly what he should. \"Interacting with people on the road who deal with real issues . . . thats what brings true joy to Jeb,\" Sally Bradshaw, a longtime consultant, said in a recent e-mail. Bush started with an aggressive series of steps late last year and early this year_ a kind of \"shock and awe\" entry that caught fellow contenders by surprise. The moves were designed to send an unambiguous signal to fundraisers and party activists and to reinforce a natural advantage Bush had with establishment donors. At the same time, Bushs inner circle operated on the theory that there was little that could be gained by trying to speed up the political clock and that most voters in early states would not begin paying attention until later in the year. Bush revived a 650-member alumni network of aides who worked for him as governor and recruited 21 veterans of his father and brothers administrations to advise him on foreign policy. He hired state directors in the first four early states, aides for outreach to evangelicals and Hispanics, and a spokeswoman dedicated to fielding questions from the Spanish-language press. As Bush travels the country, he has fielded more than 900 questions from donors, reporters and voters, according to aides. He has maintained a busy schedule that stretches from the early-voting states of Iowa, New Hampshire, South Carolina and Nevada  where conservative Republicans remain skeptical  to places visited less frequently at this early stage by presidential candidates, including Denver, Seattle and Puerto Rico. Despite those efforts, recent surveys put Bush in a five-way tie for the lead. Recent polls touted by his advisers give him a wide lead in New Hampshire, but others taken nationally and in the early states put him behind Rubio and Walker. Sensing Bushs vulnerabilities, Ohio Gov. John Kasich this week hired two veteran GOP operatives as he prepares to launch a bid and make a play for the same donors Bush has already wooed. \"I didnt think I was going to be back up here again, because frankly I thought Jeb was just going to suck all the air out of the room, and it just hasnt happened,\" Kasich told New Hampshire business leaders last week. Bush dispatched one possible rival early when Mitt Romney decided not to run again. His fast entrance also bruised the chances of New Jersey Gov. Chris Christie, who is still pondering a bid. They did not regard Rubio as a likely opponent but were proved wrong when the young, telegenic Cuban-American jumped in the race. Early on, there were signs that Bushs ability to command huge amounts of cash for his allied Right to Rise super PAC was emerging as the dominant characteristic of his potential candidacy. His team laid out presidential-style goals for fundraisers, asking them to hit goals of $50,000, $100,000, $250,000 or $500,000 by April 17. The money was flowing into the super PAC so rapidly that his advisers issued an edict  no contributions of more than $1 million, for now. \"He was more of a super-PAC candidate than a retail candidate,\" said one Republican close to the Bush operation. \"The candidate hasnt been out stumping for a while. When was the last time hes asked anyone for a vote? Its been quite a few years.\", Those concerns, simmering under the surface, finally boiled over one week in mid-May with a series of interviews focused on the most obvious issue imaginable for a Bush: the Iraq war. Starting with an interview aired on Fox News on Monday, May 11, Bush struggled over four days to answer whether he would have authorized the war begun by his brother given what is known now about bad intelligence. He first said yes, then said \"maybe,\" and then refused to answer altogether. Finally that Thursday he attempted to settle the issue at a campaign-style event in Arizona. \"Heres the deal,\" he said. \"If were all supposed to answer hypothetical questions  knowing what we know now, what would you have done  I would have not engaged. I would not have gone into Iraq.\", The episode served to crystallize some of the key concerns about Bush  his reluctance to criticize or distance himself from the unpopular policies of George W. Bush, and his tendency toward prickliness if pushed. \"We should have had that answer nailed down,\" one donor said. \"There were people who were really shaken by that.\", By the time major party donors gathered in Dallas in late May for a meeting of the Republican Governors Associations executive roundtable, the overwhelming sentiment was that Jeb Bush was less formidable than many thought he was going to be, according to several participants. Some flatly stated that they did not believe he could win the nomination. People close to Bush started getting anxious, according to a top party fundraiser with close ties to his advisers  and things began to deteriorate inside the Bush team. David Kochel, an Iowa-based strategist and former Romney aide, had been brought aboard in January as a de facto campaign manager. As the months wore on, Bradshaw and Murphy became jittery about Kochels concentration on staffing issues rather than deflecting the shots being thrown Bushs way. Meanwhile, Bush was growing chummy with Danny Diaz, a 39-year-old Washington native and onetime plumber, who was spotted several times on the trail while Kochel ground away at headquarters near the Miami airport. By late May, Kochels grip on power had eroded. Bradshaw and Murphy moved with the candidates blessing to push Kochel into a lesser role and ensure they alone had final say about the allocation of resources. The candidate, urged on by his allies and donors, suggested that a more aggressive approach was necessary. On Monday, just as Bush prepared to leave for Europe, Diaz was named the campaign manager. Friends and donors are hopeful that Bush has corrected course and that his substantial resources will carry him further than others. \"Hes going to try to do it his way without acting with every change in the wind, without doing full face-plants on the pandering,\" said Tallahassee lobbyist John \"Mac\" Stipanovich, a Bush ally. - - - -, Washington Post staff writers Dan Balz, Scott Clement, Matea Gold, Tom Hamburger and Philip Rucker in Washington and Karen Tumulty in Berlin contributed to this report.]", "Date": "20150610", "Author": "[ Ed O'Keefe and Robert Costa]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-jeb-bush-2016-campaign-20150610-story.html", "Title": "[ How Jeb Bush's 2016 campaign veered off course already]"}