{"Content": "[ Kraft Heinz on Wednesday laid off 700 workers at Krafts corporate headquarters in north suburban Northfield, part of a cost-cutting plan that will slash the combined companys head count in the U.S. and Canada by 2,500 jobs. Employees affected by the cuts, which have been expected for months, will get \"generous\" severance benefits that last at least six months and outplacement services, said Michael Mullen, Kraft Heinzs senior vice president of corporate and government affairs. The cuts took effect immediately. \"As we work to build something special at the Kraft Heinz Company, the leadership team has examined every aspect of our business to ensure we are operating as efficiently and effectively as possible,\" Mullen wrote in an email. \"We have developed a new streamlined structure for our organization to simplify, strengthen and leverage the companys scale. This new structure eliminates duplication to enable faster decision-making, increased accountability and accelerated growth.\", Kraft employed about 2,000 people in Northfield before the layoffs. The 2,500 job cuts amount to slightly more than 5 percent of Kraft Heinzs global workforce of about 46,000. Mullen declined to break down the layoffs by location but said that cuts in Pittsburgh, Heinzs hometown, were not \"material.\", Northfield village President Fred Gougler said the layoffs were expected, adding that Heinzs cost-cutting measures served as a warning for Kraft employees after the merger. \"We were not surprised, but that doesnt make it any easier for us,\" Gougler said. With the news, the village adds its name to a long list of local communities feeling the brunt of corporate consolidations and restructurings. Other companies with offices in the Chicago area have laid off more than 7,700 workers since the beginning of the year, according to outplacement firm Challenger, Gray & Christmas. The list includes downstate companies Caterpillar and Deere, which are among the states largest employers. While many of the layoffs affected workers here, the 7,700 figure also includes layoffs elsewhere in the country for these companies. 700 jobs cut from Kraft in Northfield on August 12, 2015. Local business owners are concerned how the layoffs will impact their business. (WGN-TV), 700 jobs cut from Kraft in Northfield on August 12, 2015. Local business owners are concerned how the layoffs will impact their business. (WGN-TV), H.J. Heinz completed its purchase of Kraft Foods Group in July, forming Kraft Heinz, now the third-largest food and beverage company in the U.S. and the fifth-largest worldwide. A few weeks later, Kraft Heinz announced it would move one of its headquarters, which encompasses some 700,000 square feet in north suburban Northfield, to less than a quarter of that amount of space in downtown Chicago. Krafts lease at Aon Center, which starts Jan. 1, is for 170,000 square feet over five floors. On Monday, Kraft Heinz affirmed its commitment to cut costs by $1.5 billion by the end of 2017. As part of its merger, the company said it expected to reduce its existing workforce, according to documents filed with the Securities and Exchange Commission. Many of Krafts top executives left the company after the merger was finalized. Also Monday, the company reported sales declines at both its Kraft and Heinz units for the second quarter that ended in June, before the merger took effect. In announcing those results, Kraft Heinz CEO Bernardo Hees said, \"The company is focused on the difficult and challenging process of integrating our two businesses. We have a lot of hard work ahead of us as we continue to design our new organization, always putting our consumers first.\", Mondelez International will lay off half of its 1,200 employees in its bakery on Chicagos Southwest Side after deciding to make a major investment in a Mexico plant rather than its long-standing facility here. The company decided not to make a $130 million upgrade to the facility, the companys... Mondelez International will lay off half of its 1,200 employees in its bakery on Chicagos Southwest Side after deciding to make a major investment in a Mexico plant rather than its long-standing facility here. The company decided not to make a $130 million upgrade to the facility, the companys... In a letter to Hees on Monday, Sen. Dick Durbin (D-Ill.) urged the company to reconsider the 700 job cuts in Illinois and barring that, to offer training and job placement services for displaced workers. \"This corporate decision creates tremendous social and economic pain for these workers, their families, and the greater Northfield community,\" Durbin wrote. Changing tastes, as consumers move away from processed foods to healthier, fresher fare, are creating challenges for companies like Kraft Heinz. At the same time, many shoppers remain price conscious, putting additional pressure on food companies to trim costs while promoting the value of their brands. Heinz, best known for its ketchup, has said it plans to increase distribution of Kraft foods like its Macaroni & Cheese in international markets. Last month, Kraft Heinz told workers to limit travel, keep the cost of meals at $50 to $70 when traveling, limit printing to \"only when absolutely necessary,\" and to find ways to reduce the companys use of electricity and other utilities, according to a memo obtained by the Tribune. Heinz, which is based in Pittsburgh, cut more than 7,000 jobs  about 20 percent of the workforce  in the 18 months after it was acquired in 2013 by Berkshire Hathaway and private-equity firm 3G Capital. Other snack companies cutting costs include Mondelez, which was created in 2012 when Kraft split into two public companies. The maker of Mini Chips Ahoy and Oreo cookies said last month that it will cut half of its 1,200 jobs at a bakery on Chicagos Southwest Side over the next year, as it moves some of its production to a plant in Mexico. A day after the announcement, Mondelez said second-quarter profit fell nearly 35 percent to $406 million on revenue of $7.66 billion, which was down more than 9 percent over the same period a year ago. acancino@tribpub.com, Twitter @WriterAlejandra]", "Date": "20150812", "Author": "[ Alejandra  Cancino]", "Link": "http://www.chicagotribune.com/business/ct-kraft-heinz-layoffs-0812-biz-20150812-story.html", "Title": "[ Kraft Heinz cuts jobs as new era begins]"}