{"Content": "[ Michael Petyo has as much chance of becoming the next U.S. President as this column has of earning a Pulitzer Prize, but he remains undeterred. \"I have PMA,\" he told me. \"Positive mental attitude.\", The 66-year-old Navy veteran from Hobart proudly noted that he was the first presidential hopeful in the country to declare his candidacy for the 2016 election. Sure enough, the life-long Republican is listed on all the national political registries, alongside other GOP candidates such as Ted Cruz, Marco Rubio and Rand Paul. \"I didnt do any of that exploratory stuff,\" said Petyo (pronounced Pet-Yo). \"I just dove in and declared myself a candidate, back in early 2014.\", He got his presidential run rolling in 2013 by first creating a website and then, last year, by formally filing his name. \"Im tired of whats going on in this country, and I decided to do something instead of just complaining about it. People are just sitting around while allowing Washington, D.C. to run their life. Not me,\" said Petyo, who twice ran unsuccessfully for U.S. Congress in the late 90s. \"I lost then but I believe I will be in the White House in 2016,\" he said. As he spoke, and spoke, and spoke, I couldnt help but ponder his presidential run with pragmatic realism, not political idealism. He has no experience. No history in any public office. And no campaign war chest, let alone a super PAC funding machine. What are your plans today to dutifully recognize the 45th anniversary of Earth Day? Yeah, thats what I thought. I had no plans either until I watched a motorist dump out what seemed like a Dumpster full of trash last week on U.S. 20 in Portage. The young male driver did it so nonchalantly that... What are your plans today to dutifully recognize the 45th anniversary of Earth Day? Yeah, thats what I thought. I had no plans either until I watched a motorist dump out what seemed like a Dumpster full of trash last week on U.S. 20 in Portage. The young male driver did it so nonchalantly that... Still, Petyo isnt fazed, claiming his lack of political savvy has been a valid selling point with the voters he has met and swayed. \"What resonates with people is that Im real. No lies, no agenda, no political smokescreens,\" said Petyo, who has owned a remodeling business, The Image Makers, LLC, since 1988. \"Im an honest guy and Ill always give honest answers.\", Petyo is convinced he needs only the springboard of media attention to launch him into the national spotlight. Next month, he plans on traveling to Iowa to get his first glimpse of that spotlight during the May 16 Lincoln Dinner fundraiser with other GOP presidential contenders. \"I was invited by the Republican Party, and this is what I need to get to the next level,\" Petyo said. Is he delusional or optimistic? Hopeful or out of touch? Admirably patriotic or simply wasting his time?, \"Theres always the chance for a candidate to have a defining moment at an event like this in Iowa,\" Iowa GOP Chairman Jeff Kaufmann said in a written statement. \"This (Lincoln) dinner is an opportunity for our distinguished guests to set themselves apart and announce to Iowa and the country why they should be the next president of the United States.\", The moment after Michael Triems kayak capsized in Lake Michigans icy waters, he had to make a life-or-death decision. He asked himself, \"Should I swim back to shore?\", He was three-quarters of a mile from land. He wasnt wearing a wetsuit. The water temperature was 36 degrees. He was hyperventilating... The moment after Michael Triems kayak capsized in Lake Michigans icy waters, he had to make a life-or-death decision. He asked himself, \"Should I swim back to shore?\", He was three-quarters of a mile from land. He wasnt wearing a wetsuit. The water temperature was 36 degrees. He was hyperventilating... According to the GOP, other guests will include Jeb Bush, Bobby Jindal, Rick Perry, Rick Santorum and Scott Walker. And Petyo, who feels he has an edge over most other presidential candidates because hes a military veteran, serving from 1969 to 1973. Born and raised in East Chicago, Petyo has been married 43 years to his wife, Janet. The couple has two sons, Brian and Kirk, and two grandchildren, who played a role in his decision to run for president. \"Whos going to protect our grandchildren from the wrath of problems facing this country?\" he asked. \"Put me in there and Ill bring home the bacon.\", Petyo, who serves as cantor and president of St. Nicholas Orthodox Church in Hobart, talks with the passion of a Sunday morning preacher. He doesnt have reverential oratory skills, but he certainly has confidence. \"Words flow from my lips like honey from a hive,\" he said matter-of-factly. \"Ive been told that its like Im talking directly to people, not over them.\", On political websites outlining every presidential candidate who is either declared or exploring a 2016 campaign run, Petyos name is listed among all the big names. \"A declared Republican candidate, Petyo is a rigidly capitalistic man,\" states the site 2016.presidential-candidates.org. \"His experience as a businessman gave him an appreciation for the contributions made by free enterprise to the economy, which he carries with him in his current political leanings. He extols the virtues of business, big and small, for their power to drive the American economy and provide for the prosperity of the working class,\" the site states. Petyo says he supports Second Amendment gun rights, strong conservative principles and the defense of Israel. \"We are like an attorney in the world, to defend others who cant defend themselves, and Israel cant defend itself against bullies,\" he explained. He also expressed serious suspicion of the federal government, which alone should earn him quite a few Tea Party votes. \"I also have an answer to the national debt and I will reveal it in my campaign,\" said Petyo, whose website is http://www.petyoforpresident.com. Other than such future promises, the man has no political polish. He talks from his gut, not from a mental teleprompter. If he steps on toes from putting his foot in his mouth, so be it. Hes a working man whos a work in progress on the political scene. \"Whatever campaign funding crumbs I get, I plan to use the best I can,\" he said. Petyo readily admits that political pundits would put his chances of making any kind of splash in the presidential race at \"zero to none.\", \"But I have to tell you, I think I have real good odds to win this thing,\" he countered. \"I just need some national coverage for this campaign to takeoff.\", He obviously needs more than that, but there is a bigger picture, he insists. \"Even if I fail, Im winning. Why? Because Im doing what our Founding Fathers would have wanted,\" he said. \"Its not about winning or losing. Its about doing the right thing. This is the right thing to do and Im the right guy for this job.\", OK, maybe hes a politician after all. Ill update you later in the year. Connect with Jerry at jdavich@post-trib.com, 713-7237, or via Twitter, Facebook]", "Date": "20150423", "Author": "[ Jerry Davich]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/opinion/ct-ptb-davich-petyo-for-prez-st-0424-20150423-column.html", "Title": "[ Hobart grandfather throws hat into ring for president]"}