{"Content": "[ Unlike most of the people who are sadly reminiscing about Julian Bond, I fondly recall how my last conversation with the iconic civil rights veteran occurred at a zombie movie. A mutual friend had invited us and our wives to share a Dutch treat, triple-date movie night. The movie was \"World War Z,\" in which Brad Pitt races against time to save humanity from a zombie pandemic. We had heard that it would be \"thought-provoking.\" The main thought it provoked in me was: Stay away from zombies. I cant say for sure how much it impressed Bond or his wife of 24 years, Pamela Horowitz. But they seemed to enjoy themselves. I recall this episode fondly because, in the many tributes I have read about Bond, too little mention is made of his sense of humor. Humor helped get him through the many dark times and serious crises, Horowitz, a retired lawyer for the Southern Poverty Law Center, told The Washington Post. \"He used to joke,\" she said, \"that on his tombstone one side would say Race man and the other side would say, Easily amused.\", Of course, not everyone appreciated his wit. Conservatives were furious when he rebranded their movement as \"the Taliban wing of the Republican Party.\" Yet, as the 2016 presidential race heats up  and we once again see immigrants treated like political footballs by some Republican candidates  its not hard to see where Bond came up with that notion. His humor gets overlooked because there are so many very serious things about him that are worth remembering. Bond, who died Saturday at age 75 from complications of vascular disease, is probably most remembered for the days when he  with his baby-faced, made-for-TV looks, stirring baritone voice and occasionally wisecracking humor  signaled a rising youth generation in the civil rights movement. Julian Bond, a civil rights activist and longtime board chairman of the NAACP, died Saturday night, according to the Southern Poverty Law Center. (AP), Julian Bond, a civil rights activist and longtime board chairman of the NAACP, died Saturday night, according to the Southern Poverty Law Center. (AP), He was a co-founder and leader of the Student Nonviolent Coordinating Committee during the early 1960s civil rights revolution. He was a 20-year veteran of the Georgia General Assembly, where his seating was delayed through two years of court fights in the 1960s because of his opposition to the Vietnam War. The Supreme Court finally voted 9-0 that his First Amendment rights had been violated. At the 1968 Democratic National Convention, he became the first African-American to be nominated to be vice president of the United States. He quickly turned the nomination down, since he was still seven years short of the constitutionally minimum age of 35. He also served many years as president of the Southern Poverty Law Center, which he co-founded, and chairman of the NAACP, from which he retired a few years ago. Now, after years of being described as \"youthful,\" he is more often described as \"iconic.\" But even in his semi-retirement Bond had no shortage of causes to protest or audiences eager to hear him. One of my keenest memories of Julian Bond is his voice. It had a beautiful tone, smooth and musical and soft. In the 1970s, when Bond was in the Georgia legislature, my mother was a top aide. I would drop by his Atlanta office now and then while I was home on break from college. The office was... One of my keenest memories of Julian Bond is his voice. It had a beautiful tone, smooth and musical and soft. In the 1970s, when Bond was in the Georgia legislature, my mother was a top aide. I would drop by his Atlanta office now and then while I was home on break from college. The office was... When I spoke to his widow, Pam, on the day after he passed away, she said she thought he should best be remembered for \"his years of constantly and consistently fighting for equal rights.\", Bond saw his drive for equality as broader than race, she said. \"He would say that he was an early and often crusader for gay rights and marriage equality,\" leading the NAACP board to support the cause before President Barack Obama did. But \"race was always No. 1,\" she said. I would agree, since the one issue on which Bond, as NAACP chairman, and I disagreed most was on the direction that the 106-year-old organization should take in its second century. I was not the only critic who assailed the organization from time to time as old, stodgy and losing touch with changing times. As race declines in significance compared to class and income, thanks to the hard-won victories of the movement Bond helped to lead, perhaps now is the time for the civil rights movement to target school reform, job creation and other self-help issues, I argued. But Bond wasnt hearing it. \"Were a civil rights organization,\" he said. \"Not a social service organization.\", In that spirit, he supported the \"Black Lives Matter\" movement, even as other civil rights veterans have criticized its lack of top-down leadership. Imagine that: A new and impatient generation is outraging its elders. Bond must have been highly amused. Clarence Page, a member of the Chicago Tribune Editorial Board, blogs at www.chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150818", "Author": "[ Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-julian-bond-clarence-page-perspec-0819-jm-20150818-column.html", "Title": "[ Humor, too, carried Julian Bond through push for civil rights]"}