{"Content": "[ School administrators in Lake Forest and Lake Bluff are concerned that a state property tax freeze would have a negative impact on their districts. On Aug. 4, the Illinois Senate approved legislation that would freeze local property taxes for two years. The proposed freeze next goes to the House. In Lake Forest District 115, about 90 percent of all revenue comes from local property taxes, said Deputy Superintendent Allen Albus. Albus calculates that if the property tax freeze is approved, District 115 would lose roughly $1.6 million over two years (those figures assume the consumer price index or inflation rises by 2.5 percent per year). That amount is what it costs to employ 10 to 12 teachers, he said, adding, \"Im not saying we would cut teachers, Im just trying to quantify that.\", The impact would be almost as great at District 67, roughly $1.4 million, he calculated. The Lake Forest districts have some alternate sources of revenue, including leasing space on towers for cell phone antennas and leasing out part of the west campus building. \"Other than that, the only way we can raise alternative revenue is by raising fees or by referendum,\" Albus said. While the proposed property tax freeze would last two years, its impact on school revenue could last quite a bit longer. According to the Property Tax Extension Limitation Law, property taxes can only be increased based on what the district got the year before, whats popularly known as a \"tax cap.\", \"It changes the revenue stream forever,\" Albus said. Lake Bluff District 65 Director of Finance and Operations Jay Kahn said the district would lose roughly $300,000 the first year and $600,000 the second year , assuming the consumer price index rises by 2 percent a year. \"The third year we would lose $600,000, even though taxes arent frozen,\" Kahn said. \"It impacts us forever unless we do a referendum and taxpayers let me increase the levy.\", District 65 doesnt have any significant alternative sources of money, he continued. \"We would probably look at spending,\" Kahn said. \"We dont have a lot of alternatives other than class size and staff reductions.\", Ralph Martire, executive director of the Center for Tax and Budget Accountability, describes a property tax freeze as \"a very bad idea.\" The CTBA is a nonprofit, non-partisan entity that focuses on state budget issues. Martire said the state of Illinois only covers, on average, 28 percent of the cost of public education, while the national average is roughly 47 percent. \"Any freeze of property tax without substantial increase in funding from the state would seriously erode the capacity of most school districts in Illinois to fund services,\" Martire said. \"From an education standpoint, you could expect diminishment in the quality of education for low and middle-income kids.\", Gov. Bruce Rauner, who proposed the freeze, explained in a speech this February that his goal is to \"empower local voters to get control of their local government costs,\" thereby freeing up money for education if they want to raise property taxes themselves, according to the Chicago Tribune. On Wednesday, however, Rauner said he could not support the bill in which the freeze was packaged, since that bill does not include a provision that would allow towns and counties to limit unions collective bargaining power. He said giving towns greater control over whats allowed under collective bargaining is necessary to help cities like Chicago make teachers contribute more for their pensions. \"The best answer is to give local control of these issues,\" he said. \"The schools dont belong to insiders in the system, they belong to taxpayers and the citizens. Thats the whole point. And rather than doing a special one-off deal for Chicago, the right answer is to allow school districts in Illinois, all local governments in Illinois, to have these decisions made by them at their level.\", Senate President John Cullerton, meanwhile, maintains that Democrats wont back Rauners attempt to limit collective bargaining. \"Gov. Rauners local control agenda is a thinly veiled effort to diminish the right of hardworking people,\" Cullerton spokeswoman Rikeesha Phelon said. Whether the property-tax freeze bill could pass the House is unclear. Speaker Michael Madigan has stated that he would like to see the state contribute less to local school district pensions. \"We want to end the free lunch. This is the reverse of that,\" said Madigan spokesman Steve Brown. Mark Lawton is a reporter for Pioneer Press. Monique Garcia is a reporter for the Chicago Tribune.]", "Date": "20150807", "Author": "[ Mark Lawton, Monique Garcia]", "Link": "http://www.chicagotribune.com/suburbs/lake-forest/news/ct-lfr-property-tax-freeze-tl-0813-20150807-story.html", "Title": "[ Lake Forest, Lake Bluff schools brace for property tax freeze]"}