{"Content": "[ Republican Bruce Rauner spent his first Governors Day at the Illinois State Fair on Wednesday blaming the \"Chicago machine\" and Democrats who control the legislature for running a \"dictatorship\" that he contends has caused state governments ills, including a lengthy budget impasse that shows no signs of resolution. Hours later, Senate Democrats handed Rauner a major setback by voting to overturn the governors veto of a measure that would require arbitration instead of a lockout or strike if talks on a new contract with unionized state workers reaches an impasse. Rauner lobbied extensively against an override, calling the bill the \"worst\" he had ever seen. He promised not to lock out workers, who have been without a contract since July 1, and said the bill stripped his administration of negotiating power and would force higher taxes. The first-year governor even tried to get in the head of Senate President John Cullerton before the vote, suggesting that if the veteran Democratic leader overrode him, he was merely under \"the thumb\" of House Speaker Michael Madigan, D-Chicago. Thats a perennial sore spot for Cullerton, who long served in the House under Madigan before heading over to the Senate to begin his rise through the ranks. Cullerton got 38 votes  including one Republican  two more than he needed for the override. The vote demonstrated Senate Democratic distrust of Rauner and his frequent anti-union rhetoric as he pushes his agenda. After the vote, Rauner accused senators who opposed him of choosing \"special interests over the taxpayers.\", \"It is now up to House members to take the responsible pro-taxpayer position and uphold our veto,\" Rauner said in a statement. The measure now moves to the House, where Madigan has pledged he has the votes to overturn Rauners veto of the union-backed bill. Even with the veteran Chicago Democrats vaunted power, there are questions about whether Madigan can collect the 71 votes needed when the House comes back to Springfield next week. Party crashers tried to dampen the mood at the Illinois State Fair for the first Republican Governors Day in 13 years. Aug. 19, 2015. (CBS Chicago), Party crashers tried to dampen the mood at the Illinois State Fair for the first Republican Governors Day in 13 years. Aug. 19, 2015. (CBS Chicago), Union influence and collective bargaining rights are at the core of the budget impasse between the Republican governor and the Democratic super-majorities in the General Assembly. Rauner went so far as to accuse Democrats of using their \"Chicago machine\" influence to require local governments and school districts statewide to collectively bargain with union workers and teachers. Rauner has made weakening collective bargaining rights a prerequisite for reaching any budget agreement. \"I believe very firmly that local residents and local elected officials should decide the bidding, contracting, negotiating process in their local governments and in their local public schools,\" the governor said. \"Their schools belong to local residents. They dont belong to Springfield. They dont belong to the Chicago political machine. City government doesnt belong to Chicago. It doesnt belong to the machine. It belongs to local residents. Let local residents decide,\" he added. Republicans celebrate their first Governors Day in more than a dozen years at the Illinois State Fair on Wednesday, but an ongoing political and budget impasse may provoke a sharp response from Democrats. Wednesday is the deadline for the General Assembly to begin action to override Republican... Republicans celebrate their first Governors Day in more than a dozen years at the Illinois State Fair on Wednesday, but an ongoing political and budget impasse may provoke a sharp response from Democrats. Wednesday is the deadline for the General Assembly to begin action to override Republican... \"Speaker Madigan, you know what, hes got ice water in his veins. Hes standing his ground,\" Rauner told reporters before taking the stage at the Directors Lawn. In speaking to Downstate Republicans at the fair, an unofficial kickoff of the 2016 campaign, Rauner sought to use the traditional geographic GOP appeal of criticizing Chicago Democrats to rally a political party that is hoping to use the governors status and wealth to rejuvenate itself. \"Illinois has become a dictatorship from Chicago to the taxpayer, and you can see where thats gotten us,\" said Rauner, who later labeled Madigan, who also is the state Democratic chairman, as \"King Madigan.\", Against a backdrop of a huge U.S. flag and supporters holding up letters reading \"Our Home,\" Rauner told the party faithful, \"You mess with my home Speaker Madigan, you picked the wrong guy.\", Rauner said Madigan \"doesnt care about central Illinois. He doesnt care about agriculture. Hes about the Chicago machine. That just shows the kind of political manipulation thats going on here.\", With hundreds of protesters affiliated with the Service Employees International Union Healthcare Illinoisjeering for a reversal of Rauner-imposed cuts on child care services across the gravel road from the fair Directors Lawn, the governor said his detractors dont understand \"what America was built on.\", Rauner said the cuts in child care for low-income families, including freezing new admissions and raising income eligibility rules, were forced by the budget impasse, though its not due to money being held up but a decision by his administration to trim costs. \"Were trying to manage a budget in crisis.  Its a terrible situation. Were doing the best we can to manage with the resources we have. Weve got to get a budget,\" he said. \"Those decisions were making, were making management decisions up and down inside the government. Were looking everywhere we can to manage with limited resources the best we can.\", Rauner said he hoped Madigan also would draw similar protests for failing to negotiate the governors \"Turnaround Agenda\" that includes union-weakening provisions. \"I hope theyre doing the same to Speaker Madigan because you know what, Speaker Madigans refusal to get a budget, his refusal to vote on reforms is the reason there are cuts. Speaker Madigan knows that I care. I dont want to have to cut social services,\" he said. Illinois Republican Party Chairman Tim Schneider, a suburban Cook County commissioner, also noted the SEIU protesters. \"Theyre pretty loud across the street. But the people of Illinois spoke loud and clear when they voted last November for Bruce Rauner for governor,\" Schneider said. Rauner defended the decision to go on with the fair and what he said was its \"celebration\" of Illinois amid the lengthy budget impasse, saying money already paid before the stalemate meant it would have cost more not to hold the event. \"This brings in revenue to pay for itself,\" Rauner said, though the fair has not made money for several years. While Rauner chastised the Democrats previous 12-year, one-party control of government, he also said his goal was to help the GOP \"become the majority party in the next eight years.\", \"Im dedicated to working with you as your partner so we can build a proud, prosperous, successful Republican Party thats driving real results,\" he said. \"Every election cycle, were going to be competitive, and were gradually going to grow and build that and bring the principles of the Republican Party back throughout the state of Illinois,\" said Rauner, who has vowed to use his money and that of his wealthy allies to assist supportive GOP legislative candidates. The party unity event was notable for the absence of first-term U.S. Sen. Mark Kirk, one of the top Republicans targeted nationally for defeat by Senate Democrats wanting to retake the chamber and President Barack Obamas old seat. Kirks campaign had urged supporters to attend the fair only days ago. Campaign manager Kevin Artl said Kirk, a chief critic of Obamas Iran deal, was given an opportunity to be briefed in Chicago by a terrorism expert on the issue. The decision to skip the fair comes as Kirk also has faced internal GOP criticism over a series of gaffes. \"The fact that hes not here today doesnt indicate to me anything other than Im telling you that he has our unwavering support, and the fact that hes doing the peoples business instead of doing a state fair tells me hes taking care of business today,\" said Schneider, the state party chairman. The rally wasnt without its foibles. Lt. Gov. Evelyn Sanguinetti, combating attacks by Democrats that the GOP has a \"war on women,\" twice hailed the late Judy Baar Topinka, a Republican, as the states first female comptroller. It actually was Democrat Dawn Clark Netsch, who 20 years earlier became the first woman elected to a statewide constitutional office in Illinois. Leslie Munger, who Rauner appointed to the comptroller job following Topinkas death late last year, said she was \"proud to be here as the governors wingman, so to speak, on the budget issues.\" Munger is seeking to retain the post in a special statewide election next year. U.S. Rep. John Shimkus of Downstate Collinsville noted the Democratic presidential candidacy of self-described socialist Bernie Sanders, then declared that Obama, a former Illinois state senator, was a \"socialist.\", rap30@aol.com, mcgarcia@tribpub.com]", "Date": "20150819", "Author": "[ Rick Pearson, Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-bruce-rauner-governors-day-state-fair-met-0820-20150819-story.html", "Title": "[ As Rauner rips Democratic 'dictatorship,' Senate Dems override his veto]"}