{"Content": "[ \"Now this is not the end. It is not even the beginning of the end. But it is, perhaps, the end of the beginning.\", What Winston Churchill said in 1942 following a British military victory in North Africa might also be said about Fridays narrow 5-4 decision by the U.S. Supreme Court legalizing marriage between people of the same sex. That the majority threw a bone to religious people, their churches and institutions, saying they could continue to preach and teach that homosexual marriage is wrong, will almost certainly be challenged by gay activists and secularists whose goal is to drive religious people, and especially Christians, out of the public square. What might be a preview of things to come occurred last week when the Fairfax County (Va.) School Board voted 10-2 to approve a \"gender identity\" curriculum for children starting in seventh grade. News reports said the crowd that showed up for the vote overwhelmingly opposed the decision, but majorities no longer matter. Minorities rule, except on the Supreme Court. Given their political clout and antipathy to Christian doctrines, some gay activists are likely to go after the tax-exempt status of Christian colleges that prohibit cohabitation of unmarried students, or openly homosexual ones, as well as churches that refuse to marry them. As with legal challenges to the owners of bakeries that have been in the news for refusing to bake a cake for same-sex weddings, activists who demand total conformity to their agenda will seek to put out of business and silence anyone who believes differently. Christie Jones, Teresa Moreno and Michelle Gregory react to the Supreme Courts ruling to legalizegay marriage in all 50 states in the Boystown section of Chicagos Lakeview neighborhood, Friday, June 26, 2015. (Antonio Perez, Chicago Tribune), Christie Jones, Teresa Moreno and Michelle Gregory react to the Supreme Courts ruling to legalizegay marriage in all 50 states in the Boystown section of Chicagos Lakeview neighborhood, Friday, June 26, 2015. (Antonio Perez, Chicago Tribune), This is diversity? No, this is enforced orthodoxy of a different kind and thus in violation of the Constitution and the special protection the founders gave to people of faith. It was Thomas Jefferson, a deist who edited his own version of the Bible, who said, \"No provision in our Constitution ought to be dearer to man than that which protects the rights of conscience against the enterprises of the civil authority.\", In the Supreme Courts decision reversing history, tradition and, yes, the biblical authority it tacitly acknowledges in the friezes on its wall honoring Moses and other law-givers, five unelected judges have imposed on more than 300 million Americans what many still believe to be an \"abomination.\" That may be changing, but the political process, not the court, should decide. In his strongly worded minority opinion on same-sex marriage, Chief Justice John Roberts said, \"The court is not a legislature.\" Nonetheless, the day before, Roberts acted as a legislator in again upholding the Affordable Care Act and its provision for providing federal subsidies to people in states that did not set up insurance exchanges, in violation of the language of that law. Roberts took upon himself the right to interpret what Congress intended, rather than let the law speak for itself. Conventional wisdom suggests the Supreme Courts ruling  that federal subsidies are not illegal despite the sloppy language of the Affordable Care Act  is a huge blow to Republicans, who have long been trying to dismantle an odious law that conservatives believe will inevitably make health insurance... Conventional wisdom suggests the Supreme Courts ruling  that federal subsidies are not illegal despite the sloppy language of the Affordable Care Act  is a huge blow to Republicans, who have long been trying to dismantle an odious law that conservatives believe will inevitably make health insurance... Modern Republican presidents, beginning with Dwight Eisenhower, have had a checkered record when it comes to their Supreme Court appointments. Ike called his nomination of Earl Warren, who quickly tacked left, \"the biggest damned fool mistake I ever made.\" There have been several other justices nominated by Republican presidents who have turned out to be liberal wolves in conservative clothing. Their names read like a judicial hall of shame: Blackmun, Burger, Stevens, OConnor, Kennedy, Souter and now, at least based on his Obamacare position, Roberts. This never seems to work in reverse, with liberals becoming conservative once on the bench. I asked Republican presidential candidate Jeb Bush about this mixed GOP track record during his recent visit to Washington, where he spoke to a conservative gathering. Bush said that if elected president he would conduct extensive interviews with potential nominees to the court to make sure they have a conservative constitutional view of the law. He allowed that even then there were no \"guarantees\" a justice would remain conservative. If the zeitgeist and politics are more persuasive to some justices than the Constitution and the intent of the founders, then justices should be held accountable by the political system and their terms limited. Tribune Content Agency, Cal Thomas is a syndicated columnist. tcaeditors@tribpub.com]", "Date": "20150629", "Author": "[ Cal Thomas]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-same-sex-conservatives-supreme-court-christians-homosexuals-churchill-jeb-bus-20150629-story.html", "Title": "[ Same-sex marriage is only the beginning]"}