{"Content": "[ The three-story red brick building on a hardscrabble corner in Maywood defies the image of federally subsidized housing. There are no cinder block walls or vinyl floors. Rather, construction crews are preparing to install high-end Travertine tiles and granite countertops. Nearly $7 million in tax money has been committed to converting the building into 24 mostly two-bedroom units  making it the most expensive among the hundreds of properties rehabbed with the same government aid across Chicagos suburbs, a Tribune analysis found. A combination of federal grants to build housing for low- and moderate-income families and federal stimulus money to stabilize communities hit hard by the foreclosure crisis began pouring into the 1920s courtyard building two years ago. The money was passed through Cook County, and local officials tapped the Proviso-Leyden Council for Community Action, a nonprofit led by a politically connected pastor, to redevelop the property, which sits just south of the Eisenhower Expressway. But the building remains empty and 11 months behind schedule. And as costs have continued to rise, it has become an example of how a shrinking pool of tax dollars is doled out for social programs in Illinois with little accountability. Despite red flags around how the Proviso-Leyden Council for Community Action  headed by the Rev. Claude Porter  has managed the millions in tax dollars that it has been awarded each year to provide job training, violence prevention and programs for low-income children, public money keeps flowing. The Tribune found that the organization has routinely struggled to comply with state oversight requirements, used public money to hire Porters family and supporters, and has been steeped in debt. The nonprofit stands to collect $676,000 in a developer fee for the belated Maywood project. The cost to rehab each unit, which will then be rented to low-income residents, is expected to exceed the advertised sale price of any home available in Maywood today. More than $73 million of federal tax dollars were spread across Chicagos suburbs through the Neighborhood Stabilization Program, an anti-blight initiative aimed at rehabbing distressed homes or building new ones. The most expensive project financed, in part, through the foreclosure relief is a building in Maywood thats being converted to 24 units at a cost of nearly $7 million in tax money. More than $73 million of federal tax dollars were spread across Chicagos suburbs through the Neighborhood Stabilization Program, an anti-blight initiative aimed at rehabbing distressed homes or building new ones. The most expensive project financed, in part, through the foreclosure relief is a building in Maywood thats being converted to 24 units at a cost of nearly $7 million in tax money. Porter declined to be interviewed, citing health problems, but in response to emailed questions, he defended the nonprofits expenses and hiring, noting salaries at the organization \"are well within normal ranges for comparable positions in the area.\", He referred questions about the rehab to Juliette Davis, a consultant helping to managing the project who noted that \"various unforeseen repair items became apparent\" after the general contractor was awarded the work. The money, Porters nonprofit got involved in the Maywood rehab in 2010, when the village condemned the building and sent displaced tenants to the organization for help finding a place to live. The building had fallen into foreclosure, and conditions had grown so bad that there was no hot water and electricity was spotty. Village officials appealed to Cook County for money to bring the building back to life. At the time, federal aid was being spread across the nation to help communities grappling with the blight created by the foreclosure crisis. The federal money was passed to county and state officials who control the purse strings. Within five years, $142 million would be committed across Chicagos suburbs. Another $140 million in foreclosure relief was earmarked for Chicago. More than $73 million of federal tax dollars were spread across Chicagos suburbs through the Neighborhood Stabilization Program, an anti-blight initiative aimed at rehabbing distressed homes or building new ones. The most expensive project financed, in part, through the foreclosure relief is a building in Maywood thats being converted to 24 units at a cost of nearly $7 million in tax money. More than $73 million of federal tax dollars were spread across Chicagos suburbs through the Neighborhood Stabilization Program, an anti-blight initiative aimed at rehabbing distressed homes or building new ones. The most expensive project financed, in part, through the foreclosure relief is a building in Maywood thats being converted to 24 units at a cost of nearly $7 million in tax money. Two years later, and under a tight deadline to spend the first round of money or lose it, officials from Cook Countys Bureau of Economic Development decided to put a down payment on the Maywood building and chose Porters organization, which had done two other foreclosure-related rehabs, to overhaul the property. Money from two of the nations largest federal housing initiatives  the HOME Investment Partnerships and Neighborhood Stabilization programs, which are intended to rehab distressed homes, build new ones or assist a qualifying homebuyer with a down payment  was used to acquire the building and start construction. Counties often give out the federal money through forgivable loans, which are used to purchase and rehab properties. In exchange, developers are required to set aside apartments at below-market rates for a number of years, sometimes as long as two decades, and rent them to low-income families. In the Chicago area, a family of four living on roughly $37,000 or less per year would qualify for the bulk of the Maywood rental units. In this type of housing development, the larger the initial budget, the more a developer stands to gain based on a formula used by Cook County officials to determine their cut of the overall project cost. Bids were solicited for the construction work, and when the Proviso-Leyden Council for Community Action decided to hire the second-most expensive contractor out of five, county officials signed off. Construction was estimated at $4.3 million in the original bid, but costs have escalated to $5 million, an April contractor budget shows. The acquisition price, developer fee, taxes, insurance, permits and other costs on top of construction bring the final estimated total for the project to $7.3 million. More than $6.5 million of that is federal tax money. The state kicked in $100,000 for windows, and the nonprofit took out a $500,000 bank loan. County officials say that its too soon to say how the remaining expenses will be paid. Its been more than two years since the nonprofit acquired the building and, like other projects overseen by Cook County, its lagged behind others across the region in finishing the work promised under grant agreements signed with the U.S. Department of Housing and Urban Development. In May, the federal agency reported that 53 percent of the properties that the county projected overhauling were completed. By comparison, Will, DuPage and Lake counties completed more than 200 housing units combined and exceeded initial development goals, the agency reported. Only two units remained unfinished. Each of the units in the Maywood building are on pace to cost, on average, more than twice as much as the average of the other 500 apartments and single-family homes rehabbed with the same foreclosure relief funds across the region over the past five years. Mike Jasso, the bureau chief of Cook Countys Bureau of Economic Development, said he would not speculate over whether the rehab could have been done cheaper or more efficiently. \"I think (the project) is reasonable in that we met the objective in this particular community,\" Jasso said. Bishop Porter, To understand how the Proviso-Leyden Council for Community Action has managed to collect more than $65 million in local, state and federal money during the past decade, meet the man best known as Bishop Porter. On a recent Sunday morning, Porter sprang out of his chair at the altar of the Proviso Missionary Baptist Church in the heart of Maywood. The congregation was celebrating its 43rd anniversary, and he was pepping up the few dozen people, from babies to grandmothers, crowded into pews. \"Give it up,\" shouted Porter, 80, before breaking into the twist. Porter, who lives in Naperville, is a charismatic, fiery leader on the pulpit, but local opinion on the preacher is mixed. At his nonprofit, Porter is popular with clients, said Isaac McCoy, a Porter protege who helped run the community organization until he left two years ago. \"He knew people through generations,\" said McCoy, who noted that Porter \"was different from most executives  (often) walking around giving high-fives, kissing babies and hugging the elderly.\", Some describe Porter as an overextended do-gooder with the unenviable job of trying to maintain a safety net for an increasingly impoverished area. Others point out that hes done quite well for himself at the nonprofit he founded 50 years ago  even when government funding for day care, job training and other social programs he oversees has faced cutbacks. Porter earned $179,000 in 2014, according to his agencys latest tax return. For much of the decade before that, he and his two daughters were the nonprofits highest-paid employees, making close to six figures some years. Two of his grandchildren are also on the payroll. What people who know Porter agree on is that the community-activist-turned-political-rainmaker is a force recognized among politicians of all stripes. \"One of the things he always talked about was not jumping on one side because Republicans, Democrats, everyone, has value,\" McCoy said. Lawmakers and political hopefuls are no stranger to Porters church, and his annual golf outing and gala are a whos who of Chicago-area politics. The fundraisers  complete with rib-eye, crabmeat and jumbo shrimp  feature entertainment that has cost as much as $23,650. The organization reported earning nearly $84,000 through the events in 2013. Photos on the nonprofits website show that attendees have included Cook County Board President Toni Preckwinkle, Cook County States Attorney Anita Alvarez, Illinois Secretary of State Jesse White and Attorney General Lisa Madigan. Drew Martin, vice president of program operations, said the events are as much about cultivating relationships as they are raising money. Companies that have fielded work on the agencys publicly backed housing projects have helped sponsor the events. One longtime sponsor, the Inner-City Underwriters Insurance Co. is in line to earn $88,000 for providing insurance on the Maywood rehab, county records show. Another sponsor, Ciceros Development Corp. was budgeted to receive $4,500 to help with building permits on the Maywood property, records show. A third sponsor, Sanchez Daniels & Hoffman LLP, was to collect $3,500 for legal work on another Maywood housing project, developer budgets show. In an email, Porter noted that his organization and the insurance company have had a relationship that goes back 40 years and contracts are not a reward for donations. \"PLCCA asks all of our vendors for donations,\" he said. \"(S)ome give and others dont. ... We have plenty of vendors that say no every year, and we continue to work with them.\", Audits raise concerns, As county officials were piecing together financing for the Maywood rehab, auditors were combing through the Proviso-Leyden Council for Community Actions finances and finding reoccurring problems with the way the organization keeps its books, audits show. For four consecutive years, auditors have cited \"deficiencies\" and \"weaknesses\" in the organizations oversight on spending. One ongoing issue is that the same person, Chief Financial Officer Rita McConville, is both approving expenses and cutting checks, which auditors noted in their records could lead to financial statements being \"materially misstated due to error or fraud.\", \"You have to have checks and balances,\" said Dan Rahill, the immediate past president of the Illinois CPA Society. Porter said he or an operating manager has always had oversight on expenditures, and the nonprofit employs a separate accountant to monitor spending. McConville became the organizations top finance officer in 2009, replacing Porters daughter Beverly Smith, who held the job since at least 2001, federal tax documents show. In 2004, McConville was sanctioned by the Securities and Exchange Commission and fined for hiding debt that falsely inflated the financial health of north suburban Akorn, where she once worked as the chief financial officer. She never faced discipline by the state agency that regulates her license, records show, and she remains a certified public accountant. Audits and hundreds of pages of grant reports obtained by the Tribune show that, in recent years, taxpayer money was paid out through the Proviso-Leyden Council for Community Action without proper documentation  timecards and sign-in sheets were missing for job training and mentoring programs  and payments were made without supporting receipts. An auditor also noted in 2013 that occupancy expenses  such as rent, utilities and cleaning costs  did not match the organizations square footage, and \"management could not substantiate the allocation related to administrative costs.\", In five years, financial reports show, more than $1.2 million was spent on overhead costs. The organizations headquarters are in a once-shuttered bank at Madison Street and 5th Avenue in Maywood, while the day care center and another satellite office are a few blocks away. The nonprofit also owns four apartment buildings in addition to the property currently undergoing the rehab. A Tribune analysis of mortgage documents and audits found that the nonprofit has repeatedly refinanced debt on the buildings, which is roughly $1.1 million, to avoid balloon payments. Cook County Recorder of Deeds Karen Yarbrough is a former state lawmaker who turned from Porters friend to a political foe in the two decades since she served on the board of his nonprofit. \"Maywood is a troubled community and there are good organizations trying to do work,\" she said. Yarbrough lobbied successfully to curb public funding for the Proviso-Leyden Council for Community Action in 2010 over concerns of mismanagement. Critics questioned the move given that, at one time, Porter reportedly backed a candidate trying to take Yarbroughs husbands job as mayor of Maywood. Officials estimate that Porters organization will finish construction on the Maywood property in September. Contractors recently started hanging drywall, but units this month were barren of fixtures like cabinets and sinks. Floors were covered with dusty plywood. Cook County officials have included a $450,000 \"contingency\" fund into the budget to help cover initially unforeseen costs. \"At this point it is impossible to determine whether all or part of the contingency will be needed or used,\" a county spokeswoman wrote in an email. \"Various cost savings could still be found as the project moves toward conclusion.\", Collar county rehabs, Other Chicago-area counties have fared better than Cook in finishing housing rehabs, using different strategies for choosing developers and approving construction costs. Will County officials tried to defuse the politics of spending the foreclosure relief money when it was first being released in 2009 by streamlining the process for rehabbing the distressed properties. A standard price was set on windows, doors and other materials. And a single nonprofit developer was hired to coordinate the rehabs for a fee of less than 5 percent of the project costs. Tim Mack, a financial analyst who coordinated Will Countys Neighborhood Stabilization Program, said that he initially expected to turn around 23 units of housing but was able to stretch the money funneled to the county to finish off nearly five times as many houses. Ultimately, 105 single-family houses were redeveloped with $10.5 million worth of federal aid. Lake County developed 86 properties, mostly single-family homes, with $9.3 million. The most expensive rehabs were a series of six-flats in Zion that cost $421,000 each, or about $70,000 per unit. Those buildings were rehabbed and leased out less than a year from the time they were acquired, records show. In DuPage County, the three developers that built or rehabbed 29 homes through the Neighborhood Stabilization Program collected a combined $469,000 in fees. That amounted to nearly 8 percent of the total redevelopment costs. Thats $200,000 less than the Proviso-Leyden Council for Community Action is in line to receive for coordinating construction at the Maywood building where costs continue to climb. Based on the current budget, each rehabbed unit, when complete, will have cost an average of $305,000  higher than any property currently for sale in Maywood, a town of 24,000 where the median owner-occupied home is worth $150,000, according to the latest survey by the U.S. Census Bureau. Jasso, who heads the Cook County agency tasked with oversight, said his primary concern is that the rehabs are done in compliance with federal guidelines. The Maywood rehab has met those guidelines, he said. \"We had a commitment to the community of Maywood,\" he said. \"We believe this is a good project.\", acaputo@tribpub.com]", "Date": "20150821", "Author": "[ Angela Caputo]", "Link": "http://www.chicagotribune.com/news/watchdog/ct-most-expensive-rehab-project-met-20150821-story.html", "Title": "[ Costs, delays mounting on taxpayer-backed suburban rehab project]"}