{"Content": "[ For all the things that polio took away from a young Francis George  running, playing baseball and riding his bicycle  it did little to derail his dreams of becoming a priest. Even after he entered his freshman year of Chicago high school seminary on crutches, only to be sent away with predictions of failure, he pressed on with still greater determination. George went on to conquer the disease and far exceed his youthful aspirations. From his childhood on the Northwest Side, George embarked on a spiritual career that took him around the globe as a missionary and then brought him back home to Chicago, where he was appointed the spiritual leader of the archdioceses more than 2 million Catholics. Cardinal Francis Eugene George, who led Chicagos church for 17 years and last year became the citys first archbishop to retire, died Friday after years of treatment for cancer. He took his last breaths in the company of friends and family, in the residence hed long occupied as leader of the archdiocese. \"He looked very peaceful,\" said longtime friend Colleen Dolan. \"There was no pain on his face.\", There will be a public visitation Tuesday at Holy Name Cathedral. Georges funeral will be at noon Thursday, with burial in the family plot at All Saints Cemetery in Des Plaines. As archbishop of Chicago, George navigated Catholic school closings, sought social justice on matters such as race and immigration, and burnished a reputation for candid conservatism within the church. But the issue that left arguably the biggest mark on his tenure was his handling of the clergy sexual abuse scandal, which elevated his national profile even as it invited criticism closer to home. It was evening in Rome by the time the news of Cardinal Francis Georges death reached Pope Francison Friday. On Saturday, the pope sent a telegram to express his condolences. \"Saddened to learn of the death of Cardinal Francis E. George, Archbishop Emeritus of Chicago, I offer heartfelt condolences... It was evening in Rome by the time the news of Cardinal Francis Georges death reached Pope Francison Friday. On Saturday, the pope sent a telegram to express his condolences. \"Saddened to learn of the death of Cardinal Francis E. George, Archbishop Emeritus of Chicago, I offer heartfelt condolences... George, who was often described by his brother bishops as brilliant, became the intellectual leader of the American church and emerged as the point man between the U.S. and the Vatican on such matters as the sexual abuse crisis and liturgy of the Mass, playing a key role in revisions that brought the English translation closer to the original Latin. \"He stood apart for his intelligence, his ability to make the churchs proposal in a compelling way to contemporary society, his deep faith, personal holiness and courage,\" said Catholic scholar and papal biographer George Weigel. \"He was a man of manifest faith and marked ability who struck a chord of personal integrity with just about everyone. Those qualities dont always make for a smooth passage through the rocks and shoals of ecclesiastical life, but I can think of very few people who didnt respect Francis George.\", To priests and parishioners in Chicago, their archbishop sometimes seemed more professorial than pastoral. Still, he won over most people with his honesty, wry sense of humor and deep love of the church. In private, his friends said, George was a gracious and sensitive man who revealed a warmer side at small dinner parties, where he spoke of his love of science fiction and sometimes erupted in loud guffaws. Cardinal Francis George will be buried in the George family plot at All Saints Cemetery & Mausoleum in suburban Des Plaines, where his parents, Francis J. and Julia R. George, were laid to rest. His funeral arrangements include a public visitation beginning at 2:30 p.m. Tuesday in Holy Name Cathedral,... Cardinal Francis George will be buried in the George family plot at All Saints Cemetery & Mausoleum in suburban Des Plaines, where his parents, Francis J. and Julia R. George, were laid to rest. His funeral arrangements include a public visitation beginning at 2:30 p.m. Tuesday in Holy Name Cathedral,... His public persona and responsibilities, however, tended to overshadow his softer side. George shepherded the nations third-largest archdiocese through more than 70 school closings and embarked on a campaign to raise hundreds of millions of dollars to save those that remained. In 2002, at the height of the sexual abuse scandal, George emerged as a leading figure in negotiations with the Vatican over a zero-tolerance policy. His prominence came about partly because of his previous years in Rome, his theological prowess and his leadership of one of the nations largest dioceses. \"He spoke very courageously to the congregations and leaders in Rome, helping them to see the pain of victims,\" recalled Bishop Gerald Kicanas of Tucson, Ariz. who previously served as auxiliary bishop in Chicago. \"They didnt always have the occasion of meeting victims face to face,\" and George had. Shuttling back and forth from bishops meetings in Dallas to Vatican meetings in Rome, George led the way in expressing the position of the bishops to the Vatican: that any priest guilty of a single offense of sexual abuse of a minor should be removed from ministry. In addressing bishops at their Washington, D.C. meeting in November 2002, George asked them to accept a plan that would treat both accused priests and victims with compassion. \"We are sometimes asked to choose between the accuser and the accused,\" George said. \"We cannot choose one or the other; we have to choose both. We have to love both.\", But in 2006, George faced a scandal in his own archdiocese when then-priest Daniel McCormack was charged with sexually abusing five boys. He pleaded guilty the following year, and further investigation revealed that church officials, including George, had received past abuse allegations involving the priest and failed to remove him from the church or keep him away from children. Confronted with the evidence, and under fire from parishioners and abuse victims, George placed the blame on himself. \"Im saddened by my own failure  very much so,\" George told reporters. The archdiocese hired an independent auditor to troubleshoot the churchs failures in the McCormack case and posted the names of priests removed from ministry for substantiated allegations of abusing minors going back decades. The cardinal later released his own deposition taken by victims attorneys. In January 2014, as part of settlement agreements, the archdiocese released documents from the investigations of 30 of those priests. George released the files of 36 others last November, just weeks before his successor arrived. \"Painful though publicly reviewing the past can be, it is part of the accountability and transparency to which the Archdiocese is committed,\" George wrote to parishioners before the documents release. During his early years in Chicago, through his elevation as cardinal in 1998, he sometimes seemed perplexed by the prominence of his pulpit and the reverberations of his public remarks. His relationship with the news media was often prickly, and in one instance he berated reporters for taking notes in church, saying they reminded him of Communist spies who had followed him while he preached many years ago in Poland. That kind of candor characterized his leadership of Chicagos Catholics and presidency of the U.S. Conference of Catholic Bishops. Alternately erudite and engaging, blunt and exacting, his off-the-cuff comments usually became the most memorable moments of a news conference or interview. In the church George was known as a staunch and learned defender of Catholic teachings on abortion, the death penalty and gay marriage. As an administrator he took note of matters large and small, addressing them with a laserlike focus and disarming frankness that charmed some, alienated others and sometimes did a little of both at once. After the death of Pope John Paul II in 2005, George joined six other American cardinals in Rome for the pontiffs funeral and the conclave that would select Pope Benedict XVI. For George the loss hit hard because of the special kinship he shared with John Paul, one built on mutual respect, a shared passion for philosophy and devotion to spreading the Gospel. Likewise, he shared an intellectual connection with Benedict XVI. George passionately defended the election of Benedict in the face of critics who said his selection would divide Catholics. Just as John Paul II was elected in 1978 to confront the threat to the church from the Soviet East, George said, Benedict was chosen to confront the threat from the West, in the form of secularism and relativism. \"Cardinal George appreciated the depth of Benedicts teaching,\" said the Rev. Thomas Rosica, the English-language assistant to the Holy See Press Office who had known Cardinal George since the 1980s. \"He also understood the limitations of the governance of Pope Benedict. Cardinal George became the authoritative voice, interpretive voice of Pope Benedict to the North American church.\", Eight years later, Benedicts historic resignation stunned George as it did the rest of the worlds Catholics. In the days that followed, George said it underscored the idea that the papal office belongs to the church, not to the man who holds the title. The choice of Pope Francis, then known as Buenos Aires Archbishop Jorge Bergoglio, wasnt as big a surprise to George as was the Argentines newly adopted populist leadership style. \"I said what we needed was a pope who knows how to govern and who has a heart for the poor  and thats exactly what we have,\" George said in a Tribune interview nine months after Francis was elected. \"Whats a little unexpected is the popular approach, because that wasnt part of his governmental style in Buenos Aires.\", \"He sends out so many signals it gets a bit jumbled at times,\" George said months later. \"Im sure hes not confused, himself. Its confusing for a lot of people, including myself at times.\", George never got a chance to ask the pope about that face to face. On Nov. 18, 2014, George passed the crosier to Chicagos ninth archbishop, Blase Cupich. Son of Chicago, Francis Eugene George was born Jan. 16, 1937, in Chicagos St. Elizabeth Hospital to Francis and Julia George. His older sister, Margaret Mary Cain, was almost 6. Two years after his birth, the family moved from the South Side to a red-brick bungalow in Portage Park, just two blocks from St. Pascal Church, a working-class white ethnic parish. Georges father was an operating engineer for Chicago Public Schools. His mother worked at an advertising agency until she had her children. Both parents were active in the church, with the elder George serving as an usher and his wife as a member of the Altar and Rosary Society. Young Frannie went to St. Pascal School, where he knew early on that he wanted to serve the church. \"The first time I thought about being a priest was my first Holy Communion, when I really came to appreciate the nature of that sacrament as much as a 7-year-old could,\" he said in a church documentary in December 2013 commemorating his 50th anniversary as a priest. George was 13, not even out of grammar school, when polio struck. Though it kept him out of school for four months, he still graduated first in his class. The illness, however, nearly ended his hopes of becoming a priest. When he arrived at Quigley Preparatory Seminary in Chicago on crutches, eager to begin his freshman year, George was told he could not stay and likely never would be ordained. \"The polio may have struck for a reason,\" Cain, a sister six years his senior, told the Tribune in 1997 when Francis George was appointed Chicagos eighth Roman Catholic archbishop. \"Thats when the polio struck, when he was praying to God (about where to study). It came like an answer.\", Indeed, he was undeterred from his goal. His family enrolled him in the now-closed St. Henry Preparatory Seminary, a boarding school just outside of St. Louis, in Belleville, Ill. It was run by the Missionary Oblates of Mary Immaculate religious order, whose mission is to evangelize the poor and to which he would devote his life. After St. Henrys, George officially entered the order in 1957. He took his first vows of poverty, chastity and obedience in 1961 and was ordained a priest on Dec. 21, 1963, at St. Pascal. As a member of the Oblates, George was placed on the academic track, where he thrived as a theologian and teacher and was known as a Renaissance man for his love of film, theater and opera. In all he would accumulate four notable degrees: a masters in philosophy from the Catholic University of America in Washington, D.C.; a masters in theology from the University of Ottawa in Canada; a Ph.D. in American philosophy from Tulane University in New Orleans; and a sacred theology doctorate in ecclesiology from Pontifical Urban University in Rome. As he advanced in scholarship, George rose rapidly within the Oblates. In 1973 he moved to St. Paul, Minn. to serve as head of the orders Midwestern province, which covers nine states. After just 18 months, at age 37, he was named the worldwide religious orders vicar general, its second in command, and moved to Rome. As vicar general from 1974 to 1986, George traveled widely, visiting many of the 68 countries where the orders 5,000 members perform their missionary work. George said what moved and inspired him most were the missionaries who served the outcasts of society. George moved back to the U.S. in 1987 to become the coordinator of the Circle of Fellows at the Cambridge Center for the Study of Faith and Culture in Massachusetts. The Catholic think tank was established by Cardinal Bernard Law, then archbishop of Boston, to study the relationship between the Catholic faith and American culture. Law would later become one of the principal promoters of Georges candidacy for archbishop of Chicago. In Cambridge, George cemented relationships with prominent officials and thinkers in the American church, which led to his appointment as bishop of rural Yakima, Wash. a diocese of 64,000 whose population was more than half Latino and included many migrant workers. When he was installed there in September 1990, he used his disability as a touching metaphor for difficulties he would encounter as their leader and his limitations as a human being. \"I will fall from time to time,\" George told them. \"And I just ask you to pick me up and let us continue on.\", During the six years he served in Yakima, he made bringing together the dioceses white and Latino populations a personal mission. He persuaded the two communities to worship together in the same churches and opened up diocesan jobs to Latinos. That experience would help him in later years, when he became more outspoken on racism and immigration. In 1996, George was appointed archbishop of Portland, a diocese that covers all of western Oregon and included 304,000 Catholics. He was there only 10 months when the pope tapped him to replace the late Cardinal Joseph Bernardin as Chicagos archbishop. A return home, At his installation in May 1997, George introduced himself humbly to his new flock with a plea for friendship and intimacy. Fully aware that many still mourned the loss of Bernardin, who introduced himself as \"Joseph, your brother,\" George started by saying, \"I am Francis, your neighbor.\", But the transition from the liberal-minded and much-beloved Bernardin to George the disciplinarian proved somewhat difficult. In his first year, some priests frustrated with his strict adherence to church teaching and liturgy began referring to him as \"Francis the Corrector.\" He also stunned many observers during a homily at Old St. Patricks Church in January 1998 when he pronounced liberal Catholicism \"an exhausted project.\", \"Whenever theres a change in leadership, theres always a time of adjustment that has to take place because people are used to working with a particular person,\" said Kicanas, the former auxiliary bishop in Chicago. \"He is very direct, a very different personality than Cardinal Bernardin. And I think that took getting used to.\", In Chicago, George also confronted a Catholic school system struggling to survive. Though he fought off school closings in his early years, George was later forced to shutter 70 schools  mostly on the citys South and West sides. In 2007 he closed Quigley, the school that had turned him away as a teen. In June 2013 the cardinal unveiled a $350 million capital campaign to fund scholarships for needy students, develop education programming, improve school buildings and finance capital needs at local parishes. In fact, his role was as much CEO as pastor. To overcome the damage done by the Great Recession and the abuse scandal, he looked to Wall Street. The archdiocese sold $160 million in bonds in 2012 to ensure the churchs long-term financial viability and improve its cash flow. The archdiocese also implemented more transparent accounting practices near the end of Georges tenure and, according to the archdioceses chief financial officer and internal financial records, its long-overdrawn budget will be balanced by next year. Meanwhile, George chose evangelism as the topic of his first pastoral letter in 1997. In his second pastoral letter in April 2001 he tackled the scourge of racism, a topic that had touched him personally. \"Both my father and my mother had African-American acquaintances from work and other circumstances. They spoke well of them, but we never visited each others homes nor went to one anothers family celebrations or wakes,\" George wrote. \"Nor was it any more thinkable in Chicago than in Tennessee that we would live in the same neighborhood. The teaching in my home and in my parish was good; the experience just didnt match the teaching. That gap is called sin.\", He was equally sensitive and compassionate when speaking about immigration reform, an issue he advocated during a massive rally in Grant Park in 2006. \"Respect means that every person has human dignity and must be treated as a child of God,\" George told the thousands who gathered there. \"Respect means that families, in which each of us first learned what it means to be a human being, should not be divided, that husbands should not be separated from wives nor mothers from their children. Respect means that people who have been part of this countrys social and economic fabric for years should not now be treated as if they do not count, as if their contribution can be simply dismissed and they sent away.\", George was no less passionate in his defense of positions that were more politically conservative, and as his profile in the Catholic Church rose, the cardinal became more outspoken in articulating the churchs stand on them. Before the presidential election of 2004, amid debate over whether Catholic politicians who support abortion should receive Communion, George insisted that the decision should be left to the politicians pastor. \"A firm case can be made that refusing Communion, after pastoral counseling and discussion, is a necessary response to the present scandal,\" he wrote. \"Some bishops have made that case. If I havent made it in this archdiocese, its primarily because I believe it would turn the reception of Holy Communion into a circus here.\", The Eucharist is \"our highest, most perfect form of worship of God. It should be manipulated by no one, for any purpose,\" he wrote. Later, as president of the national bishops conference, he confronted the Obama administration on abortion rights and same-sex marriage. \"He did it out of obedience,\" said Rosica of the Holy See Press Office. \"It was his time, and it was his moment. A missionary is someone who is sent.\", In private settings, friends said, George showed a softer and gentler side than his public persona often suggested. Martin E. Marty, professor emeritus at the University of Chicago Divinity School and a close friend, recalled a dinner party at Martys home at which guests were asked to name a work of fiction that would better explain their personality. The selected work could be a novel, play or film. George surprised the guests by picking \"2001: A Space Odyssey.\", \"It seemed to be a fantasy way of escaping the ministered life,\" Marty said. A grave diagnosis, In July 2006, George was diagnosed with bladder cancer. Once again confronted with a life-changing health challenge, the cardinal turned to his faith and said he felt no fear of dying. \"You meet the Lord in prayer every day. The idea of meeting him is, while disquieting, not something I think I am afraid of,\" George said before undergoing surgery at Loyola University Medical Center. Cancer returned in August 2012 and again in March 2014. Both times he maintained a rigorous public schedule, only occasionally bowing out to deal with complications from chemotherapy. \"I dont know that I should talk about doing things despite having had polio as a boy and now being diagnosed with cancer as an adult,\" he said in the church documentary. \"You do things with those illnesses. Even illness can be a gift in some way. Polio focuses you, for one thing. There are things you can do and things you cant do. You have to learn not to resent the fact that you cant be an Olympic runner. Thats important to learn. So I had to learn it very early.\", In the end, in the face of the churchs financial hardships or sexual abuse scandal, or his own failing health, it was Georges undying faith and devotion to the church that left the deepest impression on those he knew. \"I think he would want to be remembered as a good and faithful priest,\" Weigel said. \"Thats all he ever wanted to be.\", Former Tribune reporter Margaret Ramirez contributed. mbrachear@tribpub.com]", "Date": "20150417", "Author": "[ Manya Brachear Pashman]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-cardinal-george-obituary-met-20150417-story.html", "Title": "[ Chicago's cardinal: Francis George rose to lead hometown's Catholics ]"}