{"Content": "[ After Trayvon Martin was killed, President Obama spoke emotionally about his death, declaring \"this could have been my son.\", After Michael Brown was killed, Obama promised to ensure that \"justice is done\" and declared: \"We lost a young man, Michael Brown, in heartbreaking and tragic circumstances. He was 18 years old. His family will never hold Michael in their arms again.\" He even sent administration officials to attend Browns funeral. After Freddie Gray was killed, Obama walked out to the Rose Garden and declared: \"We have some soul-searching to do. This has been going on for a long time. This is not new, and we shouldnt pretend that its new.\", But after Kathryn Steinle was killed July 1, allegedly by an undocumentedimmigrant with seven felony convictions, Obama said ...nothing. No promises of \"justice.\" No calls for \"soul-searching.\", His silence has been deafening. Why has Obama been so reticent to speak out? Perhaps it is because any soul-searching in this case would require him to confront the fact that his administration has been releasing tens of thousands of dangerous undocumentedimmigrants with criminal convictions into our communities  including many who have gone on to commit murder. It got little notice, but on May 28, Sarah Saldana, director of U.S. Immigration and Customs Enforcement, admitted in a letter to Sens. Jeff Flake, R-Ariz. and Chuck Grassley, R-Iowa, that between fiscal years 2010 and 2014, the Obama administration had released \"121 unique criminal aliens who had an active [deportation] case at the time of release and were subsequently charged with homicide-related offenses.\", If you dont recognize the name Juan Francisco Lopez Sanchez, dont worry: You will. Hes not a candidate for president, but before long hell have higher name recognition than Jeb Bush. A felon convicted on several drug charges, the Mexican national had been deported five times but managed to... If you dont recognize the name Juan Francisco Lopez Sanchez, dont worry: You will. Hes not a candidate for president, but before long hell have higher name recognition than Jeb Bush. A felon convicted on several drug charges, the Mexican national had been deported five times but managed to... Think about that: 121 times over the past four years, the administration has released an undocumentedimmigrant with prior criminal convictions who went on to be charged with murder. That is one every 12 days. In one case, an undocumentedimmigrant and felon named Apolinar Altamirano allegedly gunned down a 21-year-old Arizona convenience store clerk, Grant Ronnebeck, over a pack of cigarettes. Altamirano had been convicted of felony burglary and was in the middle of deportation proceedings. But ICE released him after he posted a $10,000 bond  which allowed him to allegedly go kill an innocent young man. Asked by Sens. Flake and Grassley whether she had notified state and local authorities when Altamirano was released, Saldana replied, \"ICE does not routinely notify local authorities when a detainee is released on bond from ICE custody.\", ICE also does not routinely notify local authorities when it releases undocumentedimmigrants who are sex offenders. Last month, a Boston Globe investigation found that between 2008 and 2012, ICE released 424 sex offenders into communities across the country  including \"convicted rapists, child molesters and kidnappers\"  and that \"immigration officials have released them without making sure they register with local authorities as sex offenders.\" The paper further found that \"At least 34 of the 424 released sex offenders . . . were back in jail as of last month, state records show, some for heinous crimes committed after ICE released them.\", The killing of a woman at a sightseeing pier has brought criticism down on this liberal city because the Mexican man under arrest was in the U.S. illegally, had been deported five times and was out on the streets after San Francisco officials disregarded a request from immigration authorities to... The killing of a woman at a sightseeing pier has brought criticism down on this liberal city because the Mexican man under arrest was in the U.S. illegally, had been deported five times and was out on the streets after San Francisco officials disregarded a request from immigration authorities to... In 2013, the Obama administration released 36,007 undocumentedimmigrants with criminal convictions  1,000 of whom were subsequently convicted of other crimes after their release. Last year they released 30,558 such immigrants. According to the House Judiciary Committee, only 8 percent of those were due to the Supreme Courts decision in Zadvydas v. Davis, which requires that undocumented immigrants be released after 180 days if their home countries wont take them back. The other 92 percent were released because of Obamas policies. Obama doesnt want to talk about that. He also doesnt want to talk about San Franciscos \"sanctuary city\" policy. Steinles alleged killer, Juan Francisco Lopez-Sanchez, said he came to San Francisco because he knew the city would not turn him over to federal immigration authorities. He was right. ICE officials asked San Francisco police to notify them when Lopez-Sanchez was released so that they could take him into custody, but San Francisco refused. Why didnt Obama come out and condemn the San Francisco polices refusal to cooperate with his own administrations request? He calls out local police departments all the time for everything from alleged racial bias to acting \"stupidly.\" Why not in this case? Perhaps its because Obama opposes cracking down on \"sanctuary city\" policies such as the one that got Kathryn Steinle killed. After Trayvon Martin, Michael Brown and Freddie Gray were killed, Obama had liberal public policy points he wanted to make  about gun control, \"stand your ground\" laws, racial profiling and police bias. In the Steinle case, there are no issues Obama wants to highlight  because his administration supports the policies that led to her death. No wonder Obama is silent. Washington Post, Marc A. Thiessen, a fellow at the American Enterprise Institute, writes a weekly column for The Washington Post on foreign and domestic policy and contributes to the PostPartisan blog. He served as a chief speechwriter to President George W. Bush and Secretary of Defense Donald Rumsfeld.]", "Date": "20150714", "Author": "[ Marc A. Thiessen]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-kathryn-steinle-killed-immigrant-san-francisco-20150714-story.html", "Title": "[ Obama's silence on Kathryn Steinle killing is deafening]"}