{"Content": "[ \"You seem very irritated,\" said Texas State Trooper Brian Encinia to Naperville native Sandra Bland during the fateful and now famous traffic stop. Gee, ya think?, Irritation is the default attitude of apprehended motorists. Theyre delayed. Theyre probably going to have to pay a fine. And in many cases, especially when theyre black like Bland, they feel unfairly singled out from among many petty ordinance violators. They wonder why the police arent out doing battle with real criminals rather than shaking down honest citizens who havent hurt anyone. Im not saying they always feel this way. Sometimes busted drivers feel chastened, remorseful, mad at themselves. And Im not saying they should always feel this way. Without traffic laws, thered be chaos on the roads, and any human system of enforcing them is going to be somewhat arbitrary. As drivers hand over their license and registration, they seldom pause to remember how many times they didnt get caught or consider how thankful they are, overall, that police officers are out there risking their lives to try to keep the peace. Late one night, during high school in Austin, Texas, I was driving home when several police cars zoomed by. Curious about what was going on, I followed them down a residential street, where they pulled up to a house. I drove by and saw some officers walking up the sidewalk but couldnt tell what... Late one night, during high school in Austin, Texas, I was driving home when several police cars zoomed by. Curious about what was going on, I followed them down a residential street, where they pulled up to a house. I drove by and saw some officers walking up the sidewalk but couldnt tell what... What Im saying is that cops should never take the sulking personally. They should expect a certain weary, grudging compliance, not gratitude. When Encinia observed \"You seem very irritated,\" he might as well have been jabbing Bland with his nightstick. Why did he stop her? The question figures into the larger context of this story, which is that Bland, 28, ended up dead in a jail cell three days later, hanged by a plastic garbage bag tied into an improvised noose. So lets review. Trooper Encinias dashcam video from the late afternoon of July 10 showed him headed north on University Drive near Prairie View A&M University about 45 miles northwest of Houston. Ahead and to the left, Blands car approached University Drive on a right-angle street, rolled through a stop sign and turned right to head south. As there was almost no traffic on the road, Encinia quickly pulled a U-turn and followed Bland south on University Drive. He accelerated and closed quickly on Bland. Bland crossed a major intersection where University Drive becomes two lanes and pulled to the right when Encinia came up behind her, as if to yield to the emergency vehicle. How does a 28-year-old woman get pulled over for not using her turn signal and end up dead in a jail cell three days later?, The Texas state trooper who arrested Sandra Bland says she assaulted him during the roadside stop. The coroner says she committed suicide in the Waller County jail, hanging... How does a 28-year-old woman get pulled over for not using her turn signal and end up dead in a jail cell three days later?, The Texas state trooper who arrested Sandra Bland says she assaulted him during the roadside stop. The coroner says she committed suicide in the Waller County jail, hanging... \"The reason for your stop is because you failed to signal the lane change,\" Encinia said when he first addressed her. He did not mention that shed rolled through a stop sign. It was several minutes later, after hed completed his paperwork and returned to her car, that he offered the provocative observation, \"You seem very irritated.\", \"I am. I really am,\" she replied, since hed asked. \"I feel like its crap what Im getting a ticket for. I was getting out of your way. You were speeding up, tailing me. So I move over and you stop me. So yeah, I am a little irritated, but that doesnt stop you from giving me a ticket.\", Was he picking on her because she was African-American? A woman? New in town and driving on out-of-state plates?, The situation was getting tense. And it was the perfect time for Encinia to tell Bland he was only giving her a warning  something he hadnt yet mentioned. Instead he fired back with the snippy condescension familiar to anyone experienced in the bickering arts: \"Are you done?\", \"You asked me what was wrong and I told you,\" Bland said. \"So now Im done, yeah.\", Encinia, his authority and judgment implicitly questioned, jabbed again: \"Do you mind putting out your cigarette, please?\", She did mind. \"Im in my car,\" she said. \"Why do I have to put out my cigarette?\", Youve certainly heard about or seen what happened next. Encinia quickly took the confrontation to 11. He ordered Bland out of the car, she refused, he withdrew his stun gun, hauled her out and marched her out of range of the camera where he forcibly subdued her as she yelled and swore. Bland was arrested and charged with assault on a public servant, a felony. Physical evidence supports the conclusion that she took her own life July 13. And while suicide was not a rational response to her predicament, its not hard to imagine how such an unnecessary, ominous encounter with the law, along with the prospect of a felony conviction, prison time and the loss of the new job shed just secured could leave her despondent. The lesson here is that you must always defer meekly to the police. Even when theyre acting like bullies, goading you or issuing you preposterous orders like to put out your cigarette as you sit in your own car, dont challenge their authority. As I reminded my kids in the wake of this story, things will never go better for you if you argue with police officers. Comply. And if you feel your rights are being violated, take it up later with a judge. The scandal is the same as the lesson: that you must always defer meekly to the police. That even in an age of dashcams and omnipresent smartphone video cameras, and even in a nation that prides itself on freedom and a Constitution that explicitly limits the power of government, a petty tyrant with a badge still feels comfortable choosing to escalate a minor traffic offense into a major confrontation. Irritating? Thats one word for it. On the download, Presidential campaigns have provided some of the most vivid, important tales in American history, and every two weeks, John Dickerson, host of \"Face the Nation\" on CBS and chief political correspondent for Slate, tells one on his \"Whistlestop\" podcast. Even when you think you know the stories  this weeks episode is about U.S. Sen. Ted Kennedys primary challenge to incumbent President Jimmy Carter in 1980  Dickerson finds fresh details and anecdotes to flesh them out. Re:Tweets, Im strongly in agreement with readers that this quip from @SamDelanche was the best tweet in last weeks survey: \"I thought my vasectomy would keep my wife from getting pregnant but apparently it just changes the color of the baby.\", To receive an email alert each week when the new tweet poll goes live, write to ericzorn@gmail.com, Twitter @ericzorn]", "Date": "20150724", "Author": "[ Eric Zorn]", "Link": "http://www.chicagotribune.com/news/opinion/zorn/ct-bland-encinia-texas-suicide-zorn-perspec-0726-20150724-column.html", "Title": "[ Why, yes, Sandra Bland was 'irritated']"}