{"Content": "[ The people of Illinois sent me to Springfield to end the era of unbalanced budgets and runaway debt. The road back to fiscal sanity starts today with my veto of a budget that is nearly $4 billion out of balance and includes no reform. We cannot accept the status quo of throwing more taxpayer money into a broke and broken system. Rather than repeating the mistakes of the past  just kicking the can and raising taxes without real reform  now is our chance to transform Illinois to make it more competitive and compassionate. The Rauner administration is proposing reforms that are reasonable and balanced, where many of the elements have been adopted by other states as well as the federal government. If Republicans and Democrats commit to working together, we can reach a bipartisan, common-sense agreement to reverse Illinois economic decline and set the stage for a bright economic future. In fact, we now have the opportunity not only to turn around Illinois but to put Chicago and its school system on a sustainable path. Our plan builds on the compromise our administration offered before the regular legislative session concluded in May:, Job-creating economic reforms: To compete and grow, employers of all sizes have made it clear that Illinois needs true workers compensation reform to ensure that covered injuries actually occurred in the workplace and that medical payments be comparable to costs incurred under private health insurance. Job creators have also asked that we enact meaningful lawsuit reform to restrict venue shopping, tie jury awards more directly to the responsible party and base payments on actual medical costs. Governor Rauner vetoes new budget via Chicago Tribune op-ed piece, claims he will not approve a plan without reform agenda. June 25, 2015. (WGN TV), Governor Rauner vetoes new budget via Chicago Tribune op-ed piece, claims he will not approve a plan without reform agenda. June 25, 2015. (WGN TV), Property tax freeze: Our administrations original legislation called for a permanent property tax freeze and the ability for local governments and school districts to control their costs on bidding and contracting. Now, in the spirit of compromise, we are willing to shorten the freeze portion of our proposal to two years. At the request of Senate President John Cullerton, we are prepared to reform Illinois school funding formula as part of our tax-freeze package. A commission charged with rewriting the formula would report back by the end of 2016, with the current funding formula expiring six months later. As part of the compromise, we would allow the state to pay normal costs for Chicago teacher pensions, as it does for all other Illinois school districts, in exchange for sunsetting Chicagos special block grants. Term limits and redistricting reform: We are willing to compromise on timing by asking legislative leaders to publicly commit to giving term limits and redistricting reform a vote on the floors of both chambers sometime in the next 10 months, in time to get them on the 2016 ballot. Gov. Bruce Rauner announced Thursday he has vetoed the state budget that lawmakers passed in May, except for education appropriations, which he has approved. His rejection of a spending plan that was hopelessly unbalanced came with a significant offer to Democratic leaders. In essence, the governor... Gov. Bruce Rauner announced Thursday he has vetoed the state budget that lawmakers passed in May, except for education appropriations, which he has approved. His rejection of a spending plan that was hopelessly unbalanced came with a significant offer to Democratic leaders. In essence, the governor... Comprehensive pension reform: Government pensions are among the largest cost drivers for state and local governments. We are willing to give local governments the short-term relief they have requested in exchange for a true, long-term solution. We can deliver comprehensive pension reform by taking elements of President Cullertons consideration model, along with revised portions of our administrations plan, to encourage many government employees to move into Tier 2 or a new Tier 3 program. In the compromise, we are willing to support Cook Countys pension reform plan and allow Chicago and downstate communities to implement longer, slower pension payment schedules. Pension reform is not a prerequisite to signing the budget, but it should be completed this year. Im committed to it, and I ask for the states legislative leaders to be equally committed. These proposals reflect significant compromises by our administration. They help save Chicago from years of financial mismanagement while making sure local communities without Chicagos clout get relief. These structural reforms also allow us to begin tax reform that marries our desire to be compassionate with our need to be competitive. We will work day and night with members of the General Assembly to reform state government, modernize our tax code and enact a balanced budget as part of a truly comprehensive solution. Together, we can get this done. The people of Illinois deserve it. Bruce Rauner is the governor of Illinois.]", "Date": "20150625", "Author": "[ Bruce Rauner]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-rauner-budget-veto-perspec-20150625-story.html", "Title": "[ Rauner op-ed: I'm vetoing the budget, offering Chicago pension relief]"}