{"Content": "[ Republican presidential candidates dismissed the dominance of Donald Trump in early primary polling, scrambling to position themselves days before their first debate. While candidates and their teams have spent hours privately strategizing how best to tackle the billionaire businessman in Thursdays debate, they publicly discounted the idea ofTrumps rise even as a new poll showed the billionaire businessman continuing a summer surge. \"Anybody can do well for a month in this business, especially if you have talent and you have personality, and Donald does,\" New Jersey Gov. Chris Christie said on CNNs \"State of the Union.\", Trump, meanwhile, tried to lower expectations for his first debate appearance, which will test his ability to present himself as a serious contender for the White House. \"Id like to discuss the issues. Im not looking to take anybody out or be nasty to anybody,\" he said in an interview on NBCs \"Meet The Press.\" You have to counterpunch. But Im not looking to start anything.\", \"These politicians  I always say, theyre all talk, no action. They debate all the time,\" he said in an interview on ABCs \"This Week.\" I dont debate.\" He also spoke by phone on CBS \"Face the Nation.\", A new NBC News/Wall Street Journal poll released on Sunday showed Trump as the first choice of 19 percent of GOP primary voters, followed by Wisconsin Gov. Scott Walker at 15 percent and Florida Gov. Jeb Bush at 14 percent. Fox News, host of the Aug. 6 debate, intends to allow onstage only the 10 candidates who fare best in polling averages from the five most recent national public opinion surveys as of Tuesday evening. Candidates who do not qualify for the debate will be invited to participate in a forum to be aired on the afternoon of the debate. Donald Trump, widely believed to be the wealthiest American ever to run for president, is nowhere among the ranks of the countrys most generous citizens, according to an Associated Press review of his financial records and other government filings. Trump has said he donated $102 million worth... Donald Trump, widely believed to be the wealthiest American ever to run for president, is nowhere among the ranks of the countrys most generous citizens, according to an Associated Press review of his financial records and other government filings. Trump has said he donated $102 million worth... Former Pennsylvania Sen. Rick Santorum said the Republican party shouldnt overlook support in early voting states like Iowa and New Hampshire in favor of national numbers. Santorum, who won a number of primary contests in 2012, now ranks at around 1 percent in most polls. \"National polls mean nothing,\" he said, in an interview on ABCs \"This Week.\" Come February when it matters, not August, but come February, you know well be there.\", Republican National Chairman Reince Priebus defended the process developed by his party, saying holding nearly two dozen debates during the 2012 primary hurt their chances in the general election. \"The reality is  and it might be a little harsh, but you cant necessarily treat someone thats polling at 18 or 20 percent the same as someone thats polling at a half a percent or 1 percent,\" he said on ABC. Anticipating Trumps debate strategy has become a constant conversation for campaign aides who worry the other candidates messages will be lost in a flood of rhetoric and provocative attacks. Former Texas Gov. Rick Perry signaled hell focus on questioningTrumps Republican credentials, if he makes it onto the debate stage.Trump previously backed a single-payer health care system and abortion rights, in addition to praising President Barack Obama and Hillary Rodham Clinton in public remarks. \"When you look back at the positions that he has held, it is not in concert with conservatism,\" Perry said in an interview on Fox News Sunday. \"Im going to stand up for conservatism.\", Associated Press]", "Date": "20150802", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-gop-2016-debate-20150802-story.html", "Title": "[ GOP hopefuls prep for first 2016 debate, Donald Trump ]"}