{"Content": "[ America isnt yearning for Al Gore, the $200 million man, to run for president and save us from those 1 percenters and their obnoxious carbon footprints. The same holds true for Crazy Uncle Joe Biden. The vice president has as much bad video in his past as Donald Trump, only his are worse, since Bidens come in strange accents. But theyve been floated out there, listing like balloons in our presidential parade, because the Democrats are in a panic. And you know why:, Hillary Clinton is in the early stages of political sepsis. Madam Inevitable cut herself with some bad emails. And rather than wash the wound thoroughly with soap that stings, maybe apply a tincture of iodine, she went into deep denial and jammed those fingers in her pockets. She kept pretending it was nothing, really, and now theyre puffy and throbbing and downright uncomfortable, especially for any Democrat who thinks a few months down the road. But Gore as a candidate? Please. If by some weird happenstance he actually gets in the race instead of merely teasing us, it wont take two minutes before hes puffing up his chest, talking in that scary Foghorn Leghorn voice, flapping his arms like a cartoon rooster. Neither of the two emails sent to Hillary Rodham Clinton now labeled by intelligence agencies as \"top secret,\" contained information that would jump out to experts as particularly sensitive, according to several government officials. One included a discussion of a U.S. drone strike, part of a covert... Neither of the two emails sent to Hillary Rodham Clinton now labeled by intelligence agencies as \"top secret,\" contained information that would jump out to experts as particularly sensitive, according to several government officials. One included a discussion of a U.S. drone strike, part of a covert... At the big debate hell start rolling those eyes, just as he did before, sighing loudly and incessantly like a teenager bent on burning your ears because you said he couldnt go to the concert. And Democrats will turn to each other and say:, Why did we do this again?, The same holds true for Biden. In the end, the grownups will ask that Joe remains locked in the White House basement until this thing blows over. Hillary was the inevitable one. And a year ago she would have laughed that mirthless Hillary laugh and taken a pin to any Gore and Biden trial balloons. And shed smile as they made those sad hissing sounds that balloons make when they fly off and die. Of course the Republicans are enjoying this, even as most of them endure Trump, a man so in love with his own voice that he believes his brain farts are policy. The other day Trump said he wants to take ISIS oil wealth. Thats the kind of thing Saddam Hussein wanted to do. It would give Vladimir Putin and every other boss the pretext to do the same. You see something, you grab something and say President Donald did it too. Kuwaiti oil, or land, who knows, just take what you want and watch the world go away. Hillary Clintons problems dont seem to be going away. Aside from poll numbers showing her slipping in Iowa against potential competitors, she has not been able to figure out how to respond either to her e-mail scandal or the consequences of her foreign policy. And her email scandal just got a... Hillary Clintons problems dont seem to be going away. Aside from poll numbers showing her slipping in Iowa against potential competitors, she has not been able to figure out how to respond either to her e-mail scandal or the consequences of her foreign policy. And her email scandal just got a... Republicans shouldnt enjoy themselves too much, because Sen. Elizabeth Warren is out there. Shes silent. When Warren stops being silent, they should worry. For now, Hillarys political health is a legitimate issue, centering on those tens of thousands of emails she kept on a private server at her home as she went about her countrys business as secretary of state. After denial and stalling, she finally turned her server over to the FBI. Her critics insist this is a criminal issue. But whether it is or isnt, the damage is political because of one simple, non-partisan question: Was her private server compromised by foreign intelligence agencies?, Using private servers helped shield her work product from the public and congressional committees trying to find out more about Benghazi. But her paranoia, and her arrogance, could also very well have put her country at risk. Every day we learn about secure systems being hacked. Most of us cant write or understand code, but that doesnt stop us from reflexively grabbing our wallets when news breaks about hackers hitting a department store or a gas station chain. We understand that. We know such thieves are out there. They could be overseas, or sitting a table or two from your iced latte waiting to hack into your checking account. Or, they could be agents of foreign intelligence intent on the servers in the home of Madam Secretary. And a candidate who puts their own politics over security  especially if that candidate is widely thought by voters to be untrustworthy  has a problem. Over the weekend in Iowa, she tried to blame the Republicans and everyone but herself. She also tried to turn her email scandal into a joke while talking about her new Snapchat account. I love it. I love it, she said. Those messages disappear all by themselves. Trying to turn national security into a punchline is a stupid thing to do, especially when the FBI has your server. The political problem for the Democrats is that she might lose the election. But what if she were to win?, We will have elected an imperial personality who felt entitled to use private email for government business  email that, reportedly contained classified information including discussions on secret drone programs and other matters. The knife turned a bit the other day as her successor, Secretary of State John Kerry, was interviewed by CBS News about his government email. Kerry was asked, Do you think China and/or the Russians are reading your email?, KERRY: The answer is it is very likely. It is not outside the realm of possibility and we know that they have attacked a number of American interests over the course of the last days. CBS: Its very likely that your emails are being read?, KERRY: It is a possibility, theres no way for me  and I certainly write things with that awareness. Enjoy the rest of the summer, Mrs. Clinton. But its too late to wash your hands of this.]", "Date": "20150815", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-clinton-email-met-0816-20150814-column.html", "Title": "[ Hillary Clinton has Democrats in a panic]"}