{"Content": "[ To prevent Irans nuclear threat, the U.S. Senate unanimously passed bipartisan economic sanctions. These sanctions devalued Irans currency by 73 percent, froze Iranian accounts in foreign banks, crippled the Iranian oil and banking sectors and tanked Irans economy. The agreement recently reached by the Obama administration with Iran paves the rogue regimes path to a nuclear weapon and sets up a nuclear arms race in the Middle East. While the administration correctly leveraged sanctions to force Iran to negotiations, it wasted this leverage by rushing into a flawed agreement that condemns our children to living with an Iranian nuclear power and weakens the security of America, Israel and our other allies. The Iran deal has four major flaws. First, the agreement enriches Iran, a regime that Director of National Intelligence James Clapper calls \"the foremost state sponsor of terrorism.\", The deal requires the U.S. and the international community to undo sanctions that isolated Irans economy. It also gives Iran back more than $100 billion in frozen assets, creating a new slush fund for terrorism. This financial windfall is alarming because Iran has killed more Americans than the Islamic State has. In Lebanon, Iran-backed Hezbollah terrorists slaughtered 241 U.S. service members, including 11 from Illinois, in the barracks bombing of October 1983. In Iraq and Afghanistan, Iran-backed militants killed hundreds more service members. The United Nations Security Council took just a few minutes on Monday to approve, without dissent, the Iran nuclear deal. No one raised an objection, at least not at the U.N. Elsewhere, though, there were plenty of objections to the Obama administrations decision to submit this agreement for U.N.... The United Nations Security Council took just a few minutes on Monday to approve, without dissent, the Iran nuclear deal. No one raised an objection, at least not at the U.N. Elsewhere, though, there were plenty of objections to the Obama administrations decision to submit this agreement for U.N.... As Gen. Joseph Dunford, nominee to be the next chairman of the Joint Chiefs, admitted, \"I know the total number of soldiers, sailors, airmen and Marines that were killed by Iranian activities, and the number has been recently quoted as about 500.\", The deal also empowers Irans war machine by lifting a United Nations arms embargo banning Iran from buying conventional weapons and ballistic missiles. Astonishingly, the administration made this last-minute concession even though Gen. Martin Dempsey, the outgoing chairman of the Joint Chiefs, warned, \"Under no circumstances should we relieve pressure on Iran relative to ballistic missile capabilities and arms trafficking.\", Second, the agreement paves the path for Iran  whose leaders have repeatedly threatened to destroy Israel  to get nuclear weapons. While Congress designed U.S. sanctions to terminate only when Iran ends its nuclear program, the deal kills sanctions while allowing Iran to keep vast nuclear capabilities that will grow over time. Whatever modest limits are placed on Irans potential for nuclear weapons disappear in little more than a decade  and much sooner, if Iran cheats. Sen. Mark Kirk claims he became,\"carried away,\" in saying President Barack Obama wants Iran to get nuclear weapons. July 16, 2015. (John Byrne, Chicago Tribune), Sen. Mark Kirk claims he became,\"carried away,\" in saying President Barack Obama wants Iran to get nuclear weapons. July 16, 2015. (John Byrne, Chicago Tribune), Thats why President Barack Obama admitted earlier this year that, under the agreement, a \"relevant fear would be that in year 13, 14, 15, (the Iranians) have advanced centrifuges that enriched uranium fairly rapidly, and at the point the breakout times (for building nuclear weapons) would have shrunk to almost zero.\", Third, the deal lacks real and unfettered inspections to catch all possible Iranian nuclear cheating. Congress repeatedly demanded that the agreement require Iran, a serial cheater, to confess all nuclear weapons activities and subject Iran to unannounced nuclear inspections any time and at any place, including military facilities. The deal does neither. Iran must answer questions that inspectors have about its nuclear weapons activities, but the deal does not mandate a full Iranian confession. Iran can delay and obstruct inspections at suspect facilities for 24 days  more than enough time to erase evidence of nuclear cheating. Fourth, the deal lacks real accountability for Iranian nuclear violations. When Iran next cheats, the allegation goes to a \"joint commission\" on which Iran will review the accusation against itself. If the commission doesnt \"resolve\" Irans violation within 30 days, the case goes to the U.N. Security Council. There, world powers would have yet another 30 days to \"resolve\" the violation or punish Iran by reinstating U.N. sanctions. But theres a catch: The deal says \"if sanctions are reinstated in whole or in part, Iran will treat that as grounds to cease performing its commitments.\" So Iran could blackmail countries into turning a blind eye to nuclear violations in order to preserve the agreement. The 60-day clock has started for Congress to pass or block the agreement. Yet the administration has already pushed through a U.N. Security Council resolution to approve the deal. The point of going to the U.N. first is to corner individual representatives and senators into supporting the agreement. As Secretary of State John Kerry admitted: \"If Congress were to veto the deal, Congress  the United States of America  would be in noncompliance with this agreement and contrary to all of the other countries in the world.\", If Congress doesnt stop this bad deal, the American people will be left with a nuclear Iran and a nuclear arms race in the Middle East. Congress can and should insist on a better deal. U.S. Sen. Mark Kirk, a Republican, represents Illinois.]", "Date": "20150720", "Author": "[ Mark Kirk]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-mark-kirk-iran-sanctions-nuclear-obama-perspec-0721-20150720-story.html", "Title": "[ Sen. Mark Kirk op-ed: Congress must insist on a better Iran deal]"}