{"Content": "[ Donald Trump, the billionaire real-estate mogul, on Tuesday will release a summary of assets that total about $9 billion as part of his likely entry into the race for the Republican presidential nomination, according to people familiar with his plans. The two-page document  which will be published after he holds a political rally at Trump Tower in New York  will provide a valuation of his hotels and other properties. It will also show hundreds of millions in cash on hand and an outline of his debt, the people said. The details he will reveal Tuesday will provide one of the first looks at the worth of the real estate and television empire that the colorful impresario has amassed  one whose value has been avidly debated. Trumps declared assets are more than double the estimate of his net worth by Forbes, which currently pegs his net holdings at $4.1 billion. And it would make him the wealthiest Republican contender. Trumps longtime financial advisers and Donald F. McGahn, a partner at Jones Day, have finalized the report about his finances in recent weeks as Trump has moved closer to jumping into the 2016 contest. Three people briefed on those discussions Monday requested anonymity in order to talk about the process. Trumps speech announcing his decision is likely to center on his career and fortune. He is expected to cast himself as an entrepreneur and outsider eager to tangle with the party establishment and U.S. economic rivals abroad, such as China. The financial statement drafted by his office is aimed at demonstrating his success as a businessman, as well as proving to skeptical GOP leaders that he is serious about running. One goal of Trumps camp is to make the cut for the Republican primary debates this summer and fall, which will require him to rank within the top 10 in national polls, among other factors. By divulging details about his finances, Trump believes he will be going above and beyond what will be necessary to win a place on stage, according to people familiar with his thinking. Fox News, which is producing and airing the first debate on Aug. 6 in Cleveland, requires all candidates to have filed \"all necessary paperwork with the Federal Election Commission.\", The network has not specifically called for contenders to file their financial information before the debate is held. But under a 1978 federal ethics law, presidential candidates must file a personal financial disclosure with the FEC within 30 days after announcing their candidacies. (They can request two 45-day extensions.) The filing must detail their financial interests and income, as well as those of their spouses and dependent children. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. Trump plans to file the disclosure within the allotted time, according to people familiar with this plan. He will not be releasing his income tax returns Tuesday, the people said, but he has not ruled out doing so at some point in the coming months. Earlier this month, Trump told Fox Business Network that he is ready for reporters to scrutinize his holdings. \"Ive had great success. My statements are phenomenal,\" he said. \"I get my financial statements very early, actually. I put tremendous amounts of people to work, Ive negotiated against the best in the world, including countries, and Ive come out on top.\", Trump also recently made headlines when he told the Des Moines Register that he would be the \"most successful person ever to run for president.\", \"Ross Perot isnt successful like me. Romney was  I have a Gucci store thats worth more money than Romney,\" Trump said, referencing the fashion mecca on his property on Fifth Avenue in Manhattan. Trump, now 69, briefly and flamboyantly considered a bid in 2011 before deciding against a run. In New Hampshire, Iowa and South Carolina  all early voting states _Trump has hired staffers. Still, Trumps path to the nomination will be rocky and uphill. Many Republicans, especially in the upper ranks of the GOP, see him as a celebrity bomb-thrower and provocateur who has flirted with \"birtherism\" and made other remarks casting doubt on President Obamas credentials and love of country. Trump runs at the lower end of the pack of a very large potential set of Republican candidates, ranging from 3 to 5 percent support in national public polls. He is polling at 4 percent among Republicans and Republican-leaning independent voters in a late May Washington Post-ABC News poll. That puts him behind seasoned Republican politicians like Jeb Bush, Scott Walker, Rand Paul and Marco Rubio (with 10 or 11 percent support each) but also in the same breath as Govs. Chris Christie and John Kasich (6 and 3 percent support). Trump has insisted that he has sincere intentions. \"Everybody feels Im doing this just to have fun or because its good for the brand,\" he said in an interview in February with The Washington Post. \"Well, its not fun. Im not doing this for enjoyment. Im doing this because the country is in serious trouble.\", In revealing details about his finances, Trump is going further than he has in previous years when he has contemplated White House bids. His estimated net worth has fluctuated dramatically over the years. In August 2013, Trump said he was worth \"probably over $10 billion.\", But even the most aggressive auditors have found it challenging to assess Trumps balance sheet, in part because his assets and liabilities are intricately complex, entwined with public subsidies and opaque private partnerships. Trump has bristled at those who have raised questions about those high estimates of financial standing. He filed a libel suit against a New York Times reporter who wrote in 2005 that the real estate mogul was likely worth between $150 million and $250 million. The case was dismissed. ]", "Date": "20150615", "Author": "[ Robert Costa and Matea Gold]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-donald-trump-2016-20150615-story.html", "Title": "[ Trump said to declare $9 billion in assets as he reveals 2016 plans]"}