{"Content": "[ In December, President Barack Obama said that he wished to see Iran ultimately become a \"very successful regional power.\" His wish  a nightmare for the Western-oriented Arab states  is becoming a reality. Consider:,  Gulf of Aden: Iran sends a flotilla of warships and weapons-carrying freighters to reinforce the rebels in Yemen  a noncontiguous, non-Persian, nonthreatening (to Iran) Arabian state  asserting its new status as regional bully and arbiter. The Obama administration sends an aircraft carrier group, apparently to prevent this gross breach of the U.N. weapons embargo on Yemen. Instead, the administration announces that it has no intention of doing anything. Meanwhile, it exerts pressure on Saudi Arabia to halt its air war over Yemen and agree to negotiate a political settlement involving Iran.  Russia: After a five-year suspension, Russia announces the sale of advanced surface-to-air missiles to Iran, which will render its nuclear facilities nearly invulnerable to attack. Obamas reaction? Criticism, threats, sanctions? No. A pat on the back for Vladimir Putin: \"Im, frankly, surprised that the embargo held this long.\",  Iran: Last week, Obama pre-emptively caved on the long-standing U.S. condition that there be no immediate sanctions relief in any Iranian nuclear deal. He casually dismissed this red line, declaring that what is really important is whether sanctions can be reimposed if Iran cheats. And it doesnt stop there. The Wall Street Journal reports that Obama is offering Tehran a $30 billion to $50 billion signing bonus (drawn from frozen Iranian assets)  around 10 percent of Iranian GDP.  Syria: After insisting for years that President Bashar al-Assad of Syria \"step aside,\" the U.S. has adopted a hands-off policy toward a regime described by our own secretary of state as an Iranian puppet.  Iraq: Irans Quds Force Commander Qassem Suleimani, director of Shiite militias that killed hundreds of Americans during the Iraq War and were ultimately defeated by the 2007-08 U.S. surge, operates freely throughout Iraq flaunting his countrys dominance. In March, he was directing the same Iraqi militias, this time against the Islamic State  with the help of U.S. air cover. President Barack Obama faces a high-stakes, politically explosive negotiation this week over his Iran nuclear deal. Not with Iran. With Congress. On Tuesday, the Senate Foreign Relations Committee takes up a measure that would allow Congress to weigh in on a final nuclear deal with Iran. The bill,... President Barack Obama faces a high-stakes, politically explosive negotiation this week over his Iran nuclear deal. Not with Iran. With Congress. On Tuesday, the Senate Foreign Relations Committee takes up a measure that would allow Congress to weigh in on a final nuclear deal with Iran. The bill,... This is the new Middle East. Its strategic reality is clear to everyone: Iran rising, assisted, astonishingly, by the United States. Obamas initial Middle East strategy was simply withdrawal. He would enter history as the ultimate peace president, ushering in a new era in which \"the tide of war is receding.\" The subsequent vacuum having been filled, unfortunately and predictably, by various enemies, adversaries and irredeemables, Obama lighted upon a new idea: We dont just withdraw, we hand the baton. To Iran. Obama may not even be aware that he is recapitulating the Nixon doctrine, but with a fatal twist. Nixons main focus was to get the Vietnamese to take over that war from us. But the doctrine evolved and was generalized to deputize various smaller powers to police their regions on our behalf. In the Persian Gulf, our principal proxy was Iran. The only problem with Obamas version of the Nixon doctrine is that Iran today is not the Westernized, secular, pro-American regional power it was under the shah. It is radical, clerical, rabidly anti-imperialist, deeply anti-Western. The regimes ultimate  and openly declared  strategic purpose is to drive the American infidel from the region and either subordinate or annihilate Americas Middle Eastern allies. The case against the U.S. nuclear deal with Iran is easy to make. It doesnt ensure that Iran will never get the bomb; it doesnt require Iran to renounce terrorism; it doesnt end Irans hostility toward Israel. Each of these things is highly desirable, and the agreement provides none of them. The case against the U.S. nuclear deal with Iran is easy to make. It doesnt ensure that Iran will never get the bomb; it doesnt require Iran to renounce terrorism; it doesnt end Irans hostility toward Israel. Each of these things is highly desirable, and the agreement provides none of them. Which has those allies in an understandable panic. Can an American president really believe that appeasing Iran  territorially, economically, militarily and by conferring nuclear legitimacy  will moderate its behavior and ideology, adherence to which despite all odds is now yielding undreamed-of success?, Iran went into the nuclear negotiations heavily sanctioned, isolated internationally, hemorrhaging financially  and this was even before the collapse of oil prices. After 17 months of serial American concessions, the Iranian economy is growing again, its forces and proxies are on the march through the Arab Middle East and it is on the verge of having its nuclear defiance rewarded and legitimized. The Saudis are resisting being broken to Iranian dominance. They have resumed their war in Yemen. They are resisting being forced into Yemen negotiations with Iran, a country that is, in the words of the Saudi ambassador to the U.S. \"part of the problem, not part of the solution.\", Obama appears undeterred. Hes determined to make his Iran-first inverted Nixon Doctrine a reality. Our friends in the region, who for decades have relied on us to protect them from Iran, look on astonished. Washington Post Writers Group, Charles Krauthammer is a Washington Post columnist. letters@charleskrauthammer.com]", "Date": "20150423", "Author": "[ Charles Krauthammer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-iran-obama-nuclear-perspec-0424-20150423-story.html", "Title": "[ Obama's fatal twist on the Nixon doctrine: Empower Iran]"}