{"Content": "[ One of the more arresting moments in the presidential campaign came last week, when Hillary Clinton had a spirited exchange with activists from Black Lives Matter. \"Look, I dont believe you change hearts,\" Clinton said, when pressed about her support for their goals. \"I believe you change laws, you change allocation of resources, you change the way systems operate.\", In that instant, Clinton did not sound like a \"Clinton Democrat\" -- at least not the kind her husband implied he was in the early 1990s when he emphasized the theme of \"responsibility,\" and sternly told a black audience, \"I cannot do for you what you will not do for yourself.\" Her words seemed more evocative of those used in 1984 by one of his adversaries, Jesse Jackson, who reminded voters how structural changes had come only through activism that had \"ended American apartheid laws,\" \"secured voting rights\" and \"obtained open housing.\", Jackson, who is now 73, has quietly become part of the political landscape again. Early last week, Clintons chief rival at the moment, Sen. Bernie Sanders, who has been drawing the largest audiences in the Democratic presidential field, made a pilgrimage to Jacksons office. Sanders has been reminding reporters that he stumped for Jackson during both his presidential campaigns in 1984 and 1988 -- the second time helping him win the Vermont primary. This interest in Jackson might seem anomalous but in fact is long overdue. More than anyone else, he is the visionary of the current Democratic Party in its transition out of the 20th century and into the 21st. The conventional wisdom says otherwise. Its account of the partys rebound from the defeats of the 1980s treats Jackson skeptically and gives the savior role to Bill Clinton. Its true that Clintons appeals to working-class and middle-class voters -- those \"who work hard and play by the rules\" -- were effective in their time. The electorate was still overwhelmingly white (nearly 90 percent, compared with about 70 percent today), and Democrats were desperate to lure back those people who had defected from the party amid the upheavals of the 1960s and 1970s and voted for Republicans, beginning with Ronald Reagan in 1980. Today the 1990s strategy sounds archaic, while Jacksons earlier appeal seems more closely in sync with where the party is now. Take, for instance, his speech at the 1984 Democratic National Convention, when he said of his Rainbow Coalition: \"The Rainbow includes lesbians and gays. No American citizen ought be denied equal protection from the law.\", The \"from\" is apt in the context of the issues that preoccupy todays progressives -- police killings of young blacks; punitive laws that bar immigrants, even those who came to the U.S. as children, from attaining full citizenship; state and local ordinances that allow employers and landlords to discriminate against gay and transgender citizens; voter- registration restrictions in many states that seem aimed at minority populations. Protection \"from\" such laws resonates in particular with millennials, who now form the nations largest population cohort (more than 80 million), 43 percent of whom are nonwhite and 7 percent of whom say they are gay, bisexual or transgender. These are the constituents the eventual Democratic nominee will need to attract in 2016. Yet Jacksons two campaigns are rarely invoked today. Why? One reason is that he lost. The second is that he has often been blamed for pushing the Democratic Party to the left. In this telling, rescue came from the centrists at the Democratic Leadership Council. But to Democrats in 2015, some of the brilliant strokes in the 1992 campaign of the DLCs star, Bill Clinton, seem distinctly un-liberal -- like his return to Arkansas to preside over the execution of a death-row inmate and the speech he gave to the Rainbow Coalition in which he sharply rebuked another participant, the rap performer Sister Souljah. As president, Clinton signed the Defense of Marriage Act in 1996 (and has since apologized for doing so). Today those actions seem those of a Republican, not a Democrat. The Jackson outlook prevails. The change can be measured in the current attitudes of Stanley Greenberg, the Clinton adviser and pollster who made his name in 1985 when he surveyed disillusioned white voters in Macomb County, on Detroits outskirts, and argued that appealing to them was the Democrats way back to a majority. The \"defector\" Democrats he interviewed now believed the party was \"preoccupied with the needs of minorities\" -- including gays and feminists -- and \"no longer responded with genuine feeling to the vulnerabilities of the average middle-class person.\", But in 2008, Greenberg renounced that old strategy. \"Im finished with the Reagan Democrats of Macomb County,\" he wrote in the New York Times after Barack Obamas first victory. Greenberg urged analysts to study another Detroit suburb, Oakland County, \"home to the affluent, business-oriented suburbanites of Birmingham and Bloomfield Hills, some of the richest townships in America.\" While \"just a quarter of Macomb County residents have college degrees,\" he wrote, \"more than 40 percent do in Oakland.\" Whats more, \"almost a quarter of Oaklands residents are members of various racial minorities.\", This electorate helped make Obama the first Democrat elected president with more than 50 percent of the popular vote since 1976, when Jimmy Carter squeaked by with 50.08 percent. In 2012, when Obama received more than 50 percent of the vote for a second time, he joined a select group that includes only three other presidents (Franklin Roosevelt, Dwight Eisenhower and Reagan) in the last 100 years. In a sense, Jacksons role in laying the groundwork for a future majority might be likened to that of another so-called radical who was soundly defeated in his presidential campaign: Barry Goldwater. Like Goldwater, Jackson rejected what was then called \"me- too\" politics -- that is, mimicking the other party -- and instead ran as a proudly ideological candidate who made direct populist appeals to the partys base. And Jackson swept in new voters, as Goldwater did for Republicans. Just as Goldwaters brand of free-market economics and cultural conservatism led to the election of Reagan, so Jacksons vision of culturally diverse liberalism opened the way for Obama. Obama indirectly acknowledged Jacksons legacy in his victory speech in November 2008. Jesse Jackson was in the audience at Grant Park in Chicago that night as Obama promised to lead the \"young and old, rich and poor, Democrat and Republican,\" and the \"black, white, Hispanic, Asian, Native American, gay, straight, disabled and not disabled\" -- echoing Jacksons words in 1984, when he itemized a diverse coalition that included \"the white, the Hispanic, the black, the Arab, the Jew, the woman, the Native American,\" along with Asian Americans and \"the young, the old, the lesbian, the gay and the disabled.\", Can a white nominee, especially an aging candidate such as Hillary Clinton or Bernie Sanders (or Joe Biden if he should decide to run), become the legitimate heir to Jacksons politics of the empowered outsider, cutting across generational and other boundaries? It will be many months before we know the answer. But taking a fresh look at the legacy of Jesse Jackson, true architect of the modern Democratic Party, is one place to begin. , ****, , Sam Tanenhaus, the author of \"The Death of Conservatism\" and \"Whittaker Chambers,\" is working on a biography of William F. Buckley Jr. For more columns from Bloomberg View, visit http://www.bloomberg.com/view]", "Date": "20150828", "Author": "[ Sam Tanenhaus, Bloomberg View]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-dems-jackson-comment28-20150828-story.html", "Title": "[ Jesse Jackson created modern Democrats]"}