{"Content": "[ Mayor Rahm Emanuel on Wednesday detailed the fallout he attributes to Chicago Public Schools making good on a $634 million pension payment: 1,050 workers will lose their jobs, 350 vacant positions will be eliminated and several education programs will be slashed as a result of $200 million in budget cuts. Emanuel also proposed a $175 million property tax increase to help pay for teacher pensions  but only if the state and Chicagos teachers chip in as part of what the mayor described as a \"grand bargain\" to put an end to the districts perennial money woes. Much of that plan would require approval from state legislators who remain gridlocked over their own budget problems. The district used borrowed money to make its massive pension payment Tuesday after failing to win an extension in Springfield. Emanuel said that even with layoffs and cuts, schools will open on time and that classroom sizes will not grow. Emanuel blamed the districts tenuous financial position on years of lawmakers in Springfield allowing City Hall to put off pension payments. \"In my view, these cuts are intolerable, theyre unacceptable and theyre totally unconscionable,\" Emanuel said. \"Theyre a result of a political system thats sprung a leak and now its a geyser. Theres a series of political compromises and patchwork over the years that can no longer continue.\", Interim schools CEO Jesse Ruiz said layoffs will mostly hit central office and school support staff and that \"very few\" teachers will lose their jobs. No specific numbers were given. Emanuel calls out Springfield, wants reform in order to save CPS. July 1, 2015. (WGN TV), Emanuel calls out Springfield, wants reform in order to save CPS. July 1, 2015. (WGN TV), But Chicago Teachers Union Vice President Jesse Sharkey said Wednesday that \"what cuts have been specified would do real damage to our schools.\", The union also is upset over Emanuels proposal to end the practice of having the city pick up all but 2 percent of the 9 percent pension contribution required of teachers, an idea that, according to the union, had been broached earlier in contract negotiations. \"This is troubling to us, because it appears to be backsliding  backtracking on commitments that were made at the bargaining table,\" Sharkey said. \"Because right now, frankly, the citys bargaining position is that the pension pickup would remain for the coming year.\", CPS has yet to finalize a budget for the fiscal year that began Wednesday. Last years operating budget totaled about $5.8 billion, and the district in 2014 employed about 40,000 workers. Among the cuts Ruiz said the district will make:, More than $17 million from network offices, affecting new teacher development programs and money for new so-called turnaround schools. More than $11 million from professional development for turnaround schools. Almost $16 million in startup funding for newly approved charter, contract and alternative learning schools. Central funding for elementary school sports teams totaling $3.2 million. Twenty-five percent of the facility repair and maintenance budget, totaling $11.1 million. The district also says it can save $9.2 million by shifting the start of high school to 45 minutes later in the day, which officials say would reduce transportation costs. The schools then would end their day 45 minutes later, officials said. CPS officials on Wednesday also began issuing warnings of even more painful layoffs and spending reductions in the future if the district doesnt get relief from either Springfield or the teachers pension fund before next year. Appearing at a meeting Wednesday morning of the Chicago Teachers Pension Fund, CPS chief administrator Tim Cawley asked the fund board to consider \"deferring\" $500 million of next years roughly $700 million pension payment for another year. In exchange, Cawley said, CPS would move to a system of making pension payments on a monthly basis for 10 years beginning Jan. 1, a system the pension fund prefers. Without getting the pension break a year from now, the district faces a half-billion-dollar deficit, Cawley said. \"That $500 million would mean layoffs of over 3,000 teachers, class sizes of 35 or more, furlough days, problems throughout the district, really devastating cuts to our schools,\" Cawley said. Emanuel, who has warned that without help from the state, district cuts will start to affect the classroom, insisted Wednesday that is not yet the case. \"While we still have not affected the classroom, they are now beginning to affect what I refer to as operations at the schools themselves, and that is a different ill,\" Emanuel said. \"And maybe you can call me an optimist, but I actually believe even Springfield can hear this level of pain and understand and come to terms, even in all the politics that goes on down there, this is intolerable, it should be unacceptable to them.\", The mayor offered two potential solutions to address what he has long argued is an inequity in how Chicagos teacher pensions are funded. Chicago taxpayers fund the rest of the states teacher pensions through their state income taxes while paying local property taxes toward Chicago teacher retirement. Emanuel proposed merging Chicagos teachers pension system with the statewide retirement fund. He argued that a merged fund would be stronger overall because Chicago has funded a larger percentage of its pensions than the suburban and downstate fund has. As an alternative, Emanuel offered his \"grand bargain\" for changing how Chicagos teacher pensions are funded while overhauling the states education funding formula. The mayor proposed that the state pick up the so-called normal pension costs  the annual amount CPS owes to the pension fund, not including years worth of missed payments that were signed off on by state lawmakers. In addition, Emanuel would restore a property tax levy dedicated to teacher pensions, a tax increase the mayor estimated would generate an additional $175 million. Such a dedicated levy existed in Chicago before 1995, he said. \"Chicago teachers, Chicago taxpayers and Chicago kids are being treated as second-class citizens by the state of Illinois,\" Emanuel said. \"The whole system, in my view, is inside out and upside down and its leading to a set of decisions that are totally intolerable. Our kids and teachers deserve better from political leaders.\", jjperez@tribpub.com, bruthhart@tribpub.com, hgillers@tribpub.com]", "Date": "20150701", "Author": "[ Juan Perez Jr., Bill Ruthhart, Heather Gillers]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-chicago-schools-pension-payment-met-0702-20150701-story.html", "Title": "[  CPS set for $200 million in cuts; mayor floats property tax plan ]"}