{"Content": "[ They call it the \"mini-Pentagon\" - a white marble building in the heart of Afghanistans capital built with U.S. funds to serve as the headquarters of a modern military more than a decade in the making. But the newly constructed building is a world apart from the front-lines of Afghanistans unfinished war, where soldiers huddled at exposed checkpoints increasingly rely on police and local militias, and where logistical bottlenecks almost led to the loss of a key northern city to insurgents who swept across the northern plain in April. U.S. officials told The Associated Press during an exclusive tour of the building that the new $160 million Defense Ministry will help the military streamline its operations and more effectively counter the Taliban now that the U.S. and NATO combat mission has officially ended. The five-story building with a 110-foot dome will accommodate 2,500 employees, with barracks for officers and enlisted men, an ancillary garrison as well as a wastewater treatment facility and a power plant. Three dining halls can seat a total of 1,000 people, and an auditorium more than 900. The sprawling compound also includes gyms, clinics and military courtrooms. The design for the 414,500 sq. foot structure was chosen from entries in a nationwide competition open to architecture students. The resulting building, a combination of the top two designs, has taken four years to complete. Some 70 tons of furniture, along with fixtures and computer equipment, have added another $33.3 million to the U.S. taxpayer-funded bill, and information technology alone will add another $12 million. \"We now have the ability to be able to see the progress and the potential of everything that the security forces in Afghanistan can do,\" said U.S. Maj. Gen. Todd Semonite, the American commander overseeing the transition, calling it \"a new beginning for the Ministry of Defense.\", When President Barack Obama draped the nations highest award for combat valor around the neck of an Afghan war hero at the White House in October 2013, a highly decorated Green Beret officer who sat nearby faced an ugly reality: The Army was investigating him over allegations of murder and conspiracy. When President Barack Obama draped the nations highest award for combat valor around the neck of an Afghan war hero at the White House in October 2013, a highly decorated Green Beret officer who sat nearby faced an ugly reality: The Army was investigating him over allegations of murder and conspiracy. Theres at least one key element missing  a defense minister. President Ashraf Ghani has yet to fill the post in the nine months since assuming office because of infighting with Chief Executive Abdullah Abdullah, the man he defeated in a hotly disputed election. Its hoped that his fourth nominee, Masoom Stanekzai, will be confirmed later this month, in time for the ribbon-cutting ceremony. Meanwhile, away from the heavily guarded capital and its blast-scarred facade of order, Afghan troops are dying in record numbers and struggling to fend off the Taliban without the aid of U.S.-led ground forces and air support. The number of Afghan forces killed and wounded in action increased by 63 percent from the start of the year until early May, compared to the same period last year, according to NATO figures. More than 2,300 Afghan soldiers, police and other pro-government forces were killed during that period, which is roughly the same number of combat deaths the U.S. military has suffered since the 2001 invasion that toppled the Taliban. Another 4,500 members of the Afghan security forces were wounded. Afghanistans first lady has broken numerous conventions in a society that traditionally sequesters women behind closed doors  speaking out on issues such as violence against women, the rule of law and the power of religion. But perhaps Rula Ghanis biggest taboo breaker is simply being the countrys... Afghanistans first lady has broken numerous conventions in a society that traditionally sequesters women behind closed doors  speaking out on issues such as violence against women, the rule of law and the power of religion. But perhaps Rula Ghanis biggest taboo breaker is simply being the countrys... The stepped-up fighting across Afghanistan has the government increasingly turning to local militias for help, undermining a decade-long effort to build a professional army that has cost billions of dollars. And in the northern province of Kunduz, the Taliban nearly seized the provincial capital in a surprise April assault, as defenders ran low on food, fuel and ammunition. Around 13,000 American and NATO forces remain following last years drawdown, with the narrow mandate of training, advising and assisting Afghan forces, and carrying out counterterrorism operations. But Washington still annually provides $4 billion of Afghanistans $11.5 billion defense budget. President Obama has abandoned plans to cut troop numbers from 9,800 to 5,500 by the end of 2015 and is expected to decide on troop levels for 2016 later this year. The lingering presence of thousands of foreign forces, nearly 15 years into Americas longest war, indicates Afghanistans military is not as sturdy as its gleaming new headquarters. \"It cant just be about the building,\" Semonite said. \"It cant be about concrete and steel  what is most important for this country is capability and capacity.\", Associated Press]", "Date": "20150612", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-afghanistan-mini-pentagon-20150612-story.html", "Title": "[ Afghanistan gets 'mini-Pentagon' as troops struggle]"}