{"Content": "[ An empty chair in the third row, adorned with a lavender cloth, purple ribbon and fresh flowers, marked the spot where Hadiya Pendleton would have sat at her high school graduation Tuesday night. The chair was one of the ways former classmates acknowledged the slain 15-year-old honors student at the commencement ceremony that was as much about closure for the past as looking toward the future. Addressing the Dr. Martin Luther King Jr. College Prep Class of 2015, first lady Michelle Obama told some 3,000 people who filled an auditorium at Chicago State University that Hadiyas memory has been an inspiration to her, President Barack Obama and to people across the country. The selective enrollment school, where all of the 177 graduates have been accepted to college, won a competition to get the first lady as the commencement speaker. But Obama acknowledged that she welcomed the opportunity to honor Hadiyas memory and celebrate the achievements of her graduating class. After Hadiya was shot to death while seeking shelter from the rain on her way home from school in 2013, Obama attended her funeral and met with 30 of the teenagers close friends and classmates, offering them words of encouragement. On Tuesday, she praised them for their resilience. \"I know many of you have already dealt with some serious losses in your lives,\" Obama said. \"Maybe youve lost someone you love, someone you desperately wish could be here with you tonight. And I know that many of you are thinking about Hadiya right now and feeling the hole that she left in your hearts. The graduation exercises for Dr. Martin Luther King Jr.College Preparatory High School, where Hadiya Pendleton would have been a senior this year, were heldat Chicago State University. First lady Michelle Obama delivered the commencement address to classmates of the slain 15-year-old. \"But graduates, tonight, I want you to understand that every scar that you have is a reminder not just that you got hurt  but that you survived.\", Hadiyas killing brought national attention to Chicagos violence that claimed more than 500 lives that year. The violence has not waned. The number of people shot in the city this year passed 1,000 late last week, according to a Chicago Tribune tally. An unintended victim who just over a week before had performed with her schools drill team at President Barack Obamas inauguration festivities in Washington, Hadiya became a symbol in the politically charged debate over gun laws. In 2013, the first lady invited Hadiyas parents, Cleopatra Cowley-Pendleton and Nathaniel Pendleton, to be her special guests at the presidents State of the Union address in which he implored Congress to vote on his gun control proposals. A few days later, President Obama came to Chicago to meet with teens living in violence-torn neighborhoods and to promote his national gun agenda. MRS. OBAMA: Wow! (Applause.) Yes!, STUDENT: We love you so much, Michelle!, MRS. OBAMA: Oh, I love you guys! (Applause.) Look, I am beyond excited to be here with the winners of our first-ever FAFSA Video Challenge, the King College Prep Class of 2015! (Applause.), So let me just explain,... MRS. OBAMA: Wow! (Applause.) Yes!, STUDENT: We love you so much, Michelle!, MRS. OBAMA: Oh, I love you guys! (Applause.) Look, I am beyond excited to be here with the winners of our first-ever FAFSA Video Challenge, the King College Prep Class of 2015! (Applause.), So let me just explain,... The first lady told the audience that she welcomed the opportunity to tell people across the country the real story of the South Side, where good families and young people face challenges but make good choices every day. \"I know the struggles many of you face, how you walk the long way home to avoid the gangs; how you fight to concentrate on your schoolwork when theres too much noise at home; how you keep it together when your familys having a hard time making ends meet,\" she said. \"But more importantly, I know the strength of this community.\", In the two years since Hadiyas killing, King College Prep has engaged in a delicate balancing act, allowing students to pay homage to Hadiya while trying to keep them from becoming stuck in their grief. Tuesday night, students were determined to include Hadiya, who would have turned 18 last week. But the ceremony was festive, filled with laughter, cheers and standing ovations. She was featured in a video produced by her classmates and shown at the ceremony. In a special acknowledgment, Hadiyas parents were presented with her yellow graduation cap and gown, as well as a personalized class ring set with an amethyst stone. Two of Hadiyas closest friends  Kyra Caldwell, 17, and Amber Mitchell, 18  were among the graduates. For them, the first ladys visit was bittersweet, they said. \"Its wonderful that the first lady is speaking at our graduation, but its a reminder that its because of our best friend that shes coming,\" Caldwell said in an interview last week. Mitchell said the graduation is one of many events during the year where Hadiyas absence was felt. \"Every event has been bittersweet: the prom, the first day of the senior year, graduation. Its fun. Its cool. But theyre always a reminder that theres this one person missing,\" she said. Principal David Narain said the last two years have been an exercise in compromise. \"The seniors were very close to her and had very strong ties,\" said Narain, who came to King in 2013. \"The students felt like the school was not recognizing Hadiyas death in a way they felt was appropriate. We had to find a way to acknowledge the grief and allow the students to move on as Hadiya would have wanted them to.\", A year ago, students wanted to memorialize Hadiyas tan locker by painting it purple, her favorite color. Counselors suggested that instead of making it a constant reminder of her death, that they place a purple lock on it. After her death, students started an anti-violence campaign called Project Orange Tree. This year, they also selected her as honorary prom queen. As part of the first ladys \"Reach Higher\" initiative, which encourages students to pursue a postsecondary education, Obama invited schools across the country to compete for her to speak at their high school graduation by participating in a video competition that promoted participation in the Free Application for Federal Student Aid program. King College Prep was chosen from among nearly 200 schools from across the country. The students produced a video takeoff on the ABC television show \"Scandal,\" in which Washington fixer Olivia Pope takes the first lady as a client and works to get 100 percent of the King students to apply for student aid. In a surprise presentation arranged by the first ladys office, the cast of \"Scandal\" appeared in a video to congratulate the Class of 2015. According to Principal Narain, this years graduating class received $10 million in scholarships offers. Eighty-one percent of the graduates plan to go on to four-year colleges, with the rest enrolling in community college, joining the military or considering other options. Obama told the students that its OK to feel sadness and grief that comes with losses. She said it is up to them now to change the narrative about their communities. \"If Hadiyas friends and family could survive their heartbreak and pain; if they could find organizations to honor her unfulfilled dreams; if they could inspire folks across this country to wear orange to protest gun violence, then I know you all can live your life with the same determination and joy that defined Hadiyas life,\" she said. This fall, Hadiyas friends will start on a new path. Caldwell will head off to Tuskegee University in Alabama, where she wants to pursue a degree in occupational therapy. Mitchell will enroll at Clark Atlanta University to study psychology and theater. dglanton@tribpub.com, Twitter @dahleeng]", "Date": "20150610", "Author": "[ Dahleen Glanton]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-michelle-obama-king-college-prep-graduation-20150609-story.html", "Title": "[ Michelle Obama honors Chicago grads, slain classmate Hadiya Pendleton ]"}