{"Content": "[ While Congress remains stalled on a long-term plan for funding highways, state lawmakers and governors arent waiting around. Nearly one-third of the states have approved measures this year that could collectively raise billions of dollars through higher fuel taxes, vehicle fees and bonds to repair old bridges and roads and relieve traffic congestion, according to an analysis by The Associated Press. The surge of activity means at least half of the states  from coast to coast, in both Republican and Democratic areas  now have passed transportation funding measures since 2013. And the movement may not be done yet. Tennessees governor is in the midst of a 15-city tour highlighting the states transportation needs. North Carolina lawmakers are debating a road-bonding proposal. And legislators are returning to work this week in California and Michigan with transportation funding on the agenda. \"I dont know of a state thats not having the conversation\" about raising revenue for transportation, said Iowa Transportation Director Paul Trombino III, who is vice president of the American Association of State Highway and Transportation Officials and whose home state recently raised fuel taxes by 10 cents a gallon. The widespread focus on transportation funding comes as state officials are becoming frustrated by federal inaction in helping to repair roads and bridges described as crumbling, aging and unsafe. About 20 percent of the nations 900,000 miles of interstates and major roads need resurfacing or reconstruction, according to one analysis of federal data. A quarter of the 600,000 bridges are considered structurally deficient or functionally obsolete. That doesnt necessarily mean they are about to fall; it means they are showing worrisome problems or are no longer adequate for todays traffic. \"Theres a lot of voices that say lets push this off,\" said Tennessee Gov. Bill Haslam, whos call for more transportation funding has been opposed by some fellow Republicans. \"But the need is not going to go away. Were going to have to do something to address this.\", In many states, the new money is going primarily toward repairing old infrastructure, though some projects  such as a new four-lane U.S. 20 across Iowa  are designed to ease congestion so that commerce can flow more freely. Congress has yet to agree on long-term funding to supplement the states efforts. Instead, it recently passed its 34th short-term extension of the nations transportation program since 2009, ensuring only that states will continue to receive federal highway funding through Oct. 29. Federal dollars, on average, cover about half of a states capital expenditures for roads and bridges, according to the American Road & Transportation Builders Association. But the money available from the Federal Highway Trust Fund declined 3.5 percent during the five-year period ending in 2013, the latest year for which numbers are available, because of improved fuel economy and other factors. The fund receives money from federal taxes on gasoline and diesel. Regardless of what Congress ultimately does, some state officials say more taxpayer money will be required to update their aging infrastructure for the modern economy. The newly passed measures put only a dent in a backlog of projects. In Connecticut, for example, legislators recently approved $2.8 billion of additional transportation bonding over the next five years. But thats just the start of what Democratic Gov. Dannel Malloy hopes will be a 30-year, $100 billion overhaul of the states transportation system. Idaho Gov. C.L. \"Butch\" Otter, a Republican, signed a law this spring raising the fuel tax by 7 cents a gallon and increasing vehicle registration fees. Thats projected to raise $95 million a year, barely a third of the $262 million annual shortfall in the transportation system. Legislators in Kentucky and North Carolina passed measures to avert large cuts caused by falling fuel prices. But those bills didnt generate any additional money. Though politicians often talk about coming up with creative ways of funding roads, many states have resorted to the traditional means of taxing and borrowing. Thats caused consternation for some Republicans who have campaigned against such things. But it helps that 2015 isnt an election year. Nebraskas single-house legislature, which is dominated by Republicans, overrode Republican Gov. Pete Ricketts veto to enact a 6-cent-a-gallon fuel tax increase. \"I had to do a great deal of soul-searching\" on a fuel tax increase, said sponsor Sen. Jim Smith, a conservative Republican. But he added: \"The magnitude of the (transportation) backlog was so large that we would not be able to tackle that with gains and efficiencies alone.\", Transportation economist George Hoffer of the University of Richmond in Virginia said many politicians find it more palatable to raise the fuel tax than other taxes because \"its considered equitable  the more you use, the more you pay.\", Also, because fuel prices regularly fluctuate, its sometimes harder for motorists to notice the added tax. \"If its infrastructure-related, thats a legitimate reason to raise it,\" said motorist Lauren Sharkey of Spokane, Washington, where the state gasoline tax increased by 7 cents on Aug. 1 as part of a new 16-year, $16 billion transportation plan. In states that havent raised road taxes, some local governments are forging ahead on their own. A new 4-cent-a-gallon gas tax took effect in July in Normal, Illinois. A 5-cent hike is to kick in Jan. 1 in Osceola County, Florida, just south of Orlando. Some transportation tax plans have been rejected by voters. Missouri and Michigan, where measures were defeated, are now pondering alternatives. Frustrated that others have acted while his home state has not, Missouri transportation commission chairman Stephen Miller has been distributing newsletters warning that his agency has \"a huge problem\" and \"no ready solution.\" Within a decade, he says, 75 percent of Missouris secondary roads could be in poor condition. \"At both the federal level and the state level, everyone says transportation is incredibly important, we have a need, we are underfunded, and then nobody can agree on how to do that,\" Miller said. Associated Press]", "Date": "20150817", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-state-road-repairs-20150817-story.html", "Title": "[ States raising taxes, fees and debt to pay for road repairs ]"}