{"Content": "[ The suspect in the deaths of three Muslim college students in North Carolina had at least a dozen firearms and a large ammunition stash in his home, according to search warrants released on Friday as world leaders decried the shootings. Warrants filed in Durham County Superior Court included an inventory of the weapons seized by police from the Chapel Hill condominium of Craig Stephen Hicks, the 46-year-old charged with three counts of first-degree murder. The warrants list three handguns recovered from the Hicks home he shared with his wife, in addition to a pistol the suspect had with him when he turned himself in to sheriffs deputies. The warrants also list two shotguns and seven rifles, including a military-style AR-15 carbine. Police also recovered numerous loaded magazines and cases of ammunition. Eight spent shell-casings were found in the neighboring apartment of Deah Shaddy Barakat, 23, and his wife, Yusor Mohammad Abu-Salha, 21. Also killed was the wifes sister, Razan Mohammad Abu-Salha, 19. Relatives say all were shot in the head. Authorities havent disclosed exactly how the victims died. \"No one in the United States of America should ever be targeted because of who they are, what they look like, or how they worship,\" President Barack Obama said in Washington. In New York, spokesman Stephane Dujarric said United Nations Secretary-General Ban Ki-moon was \"deeply moved\" by scenes of thousands at Thursdays funeral. Police in Chapel Hill said they have yet to uncover any evidence Hicks acted out of religious animus, though they are investigating the possibility. As a potential motive, they cited a long-standing dispute about parking spaces at the condo community where he lived in the same building as the victims. The FBI is now conducting a \"parallel preliminary inquiry\" to determine whether any federal laws, including hate crime laws, were violated. Family members of the slain students are pressing for hate crime charges against the alleged shooter, but legal experts say such cases are relative rare and can be difficult to prove. \"This has hate crime written all over it,\" said Dr. Mohammad Yousif Abu-Salha, speaking Thursday at the funeral for his daughters and son-in-law. \"It was not about a parking spot.\", To win a hate-crime conviction, however, prosecutors would have to prove Hicks deliberately targeted those killed because of religion, race or national origin. North Carolina does not have a specific \"hate crime\" statute, though it has laws covering such acts of \"ethnic intimidation\" as hanging a noose, burning a cross or setting fire to a church. UN chief, Jordan decry N.C. deaths, The secretary-general of the United Nations and Jordans ambassador to the U.S. are joining others around the world in decrying the slayings of three young Muslims in North Carolina. As Muslim-Americans, we constantly reassure ourselves. Get an education. Excel in your fields. Be that Muslim you wish the media could see; be the \"moderate\" they are looking for. And things will change. People will open up their minds and hearts. They will see beyond ISIS and 9/11; they will realize... As Muslim-Americans, we constantly reassure ourselves. Get an education. Excel in your fields. Be that Muslim you wish the media could see; be the \"moderate\" they are looking for. And things will change. People will open up their minds and hearts. They will see beyond ISIS and 9/11; they will realize... U.N. spokesman Stephane Dujarric said Friday that Ban Ki-moon was \"deeply moved by the scenes of thousands of Americans coming together\" at a funeral service Thursday. The spokesman said Ban believes the victims in Chapel Hill represented \"the best values of global citizenship.\", Jordans Embassy in Washington says that countrys ambassador visited the families Friday. Yusor Abu-Salha was born in Jordan, as were her parents. Associated Press]", "Date": "20150213", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-chapel-hill-shooting-20150213-story.html", "Title": "[ N.C. suspect in shooting of Muslim students had at least 12 guns, ammo cache: warrants]"}