{"Content": "[ For years, the U.S. and its allies have accused Iran of violating U.N.-imposed nuclear sanctions. A special panel of experts set up by the U.N. has investigated a steady torrent of those complaints. Now the panel has a complaint of its own: Where are all the complaints?, The panel said in a recently released report that it had noted a \"drastic reduction in reporting and information-sharing\" by governments in the past year. Thats the same time frame in which the U.S. and its allies have been cajoling Iran to make a nuclear deal. Were all the apparent sanctions violations cleverly concealed by Iran? No. The panel noted that no Western country had reported that Maj. Gen. Ghasem Soleimani, commander of the Quds Force, an elite unit in Irans Republican Guard Corps, had violated a U.N.-mandated travel ban by going to Iraq, Syria and Lebanon. This wasnt top secret: The panel report included colorful news photos of Soleimani violating the ban. So why has the torrent turned to a trickle? The panel suggests two possibilities:, The Iranians are abiding by the rules, so theres \"a general reduction of procurement activities.\", Iran and Western powers have made \"a political decision by some member states to refrain from reporting to avoid a possible negative impact on ongoing negotiations.\", In other words, the panel wonders if the U.S. and its allies are so eager for a deal that their stance on reporting Iran cheating is: See no evil, speak no evil ... A State Department official on Wednesday said the U.S. is not withholding information about Iranian violations. Lets hope not. Tiptoeing around the ayatollah and his henchmen wont guarantee a better deal. How often do you see this kind of overwhelming bipartisan sentiment in Congress? The U.S. House voted 400 to 25 on Thursday to require congressional review of any deal with Iran on nuclear weapons. A week earlier, the Senate voted 98 to 1. A reluctant President Barack Obama will sign the legislation. How often do you see this kind of overwhelming bipartisan sentiment in Congress? The U.S. House voted 400 to 25 on Thursday to require congressional review of any deal with Iran on nuclear weapons. A week earlier, the Senate voted 98 to 1. A reluctant President Barack Obama will sign the legislation. Still, this report is troubling. \"When a U.N.-created panel suggests that countries deliberately may be withholding data on Iranian sanctions violations in order not to interfere with ongoing nuclear negotiations, this only intensifies congressional concern about the commitment of the Obama administration and our European allies to the enforcement of any Iran nuclear deal,\" Mark Dubowitz of the Foundation for Defense of Democracies told us. That underscores why any nuclear deal has to require that Iran come clean about its past and present nuclear activities. And why it has to submit to \"anywhere, anytime\" inspections of nuclear facilities and military bases where inspectors suspect nuclear work is ongoing. Ayatollah Ali Khamenei has said he wont allow such inspections of Irans military sites or grant access to Iranian scientists. Well see who blinks. Iran has long stonewalled international inspectors seeking answers about its past nuclear weapons research, just as it has circumvented other U.N. sanctions to build its nuclear prowess. Thats why \"anywhere, anytime\" inspections are key to a durable nuclear deal. \"The best agreement, if you cannot verify it, its useless,\" French Foreign Minister Laurent Fabius recently told The Wall Street Journal. Secretary of State John Kerry headed home Monday to Boston from Geneva, Switzerland, for surgery on his broken leg, as U.S. officials insisted that his injury would not hinder his participation in nuclear negotiations with Iran. With an end-of-June deadline for an Iranian deal fast approaching,... Secretary of State John Kerry headed home Monday to Boston from Geneva, Switzerland, for surgery on his broken leg, as U.S. officials insisted that his injury would not hinder his participation in nuclear negotiations with Iran. With an end-of-June deadline for an Iranian deal fast approaching,... The U.S. and its allies reportedly are studying a proposal to have inspection requests channeled through a commission that would vote on whether to grant access. Iran and its allies, Russia and China, wouldnt have the votes to block an inspection. That sounds cumbersome and prone to long blustery delays while officials argue about inspection ground rules. Iran has a deep and rich history of cheating and refusing to answer inspectors questions. The U.S. and its allies cant be so eager for a deal  any deal  that they turn a blind eye to current sanctions violations and then let Iran gloss over its past weapons research and erect barricades against future inspections by the International Atomic Energy Agency. Lets see what Iran has been hiding.]", "Date": "20150611", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-iran-nuclear-weapon-obama-un-edit-0612-20150611-story.html", "Title": "[ See no evil, speak no evil on Iran?]"}