{"Content": "[ Chicagos Archbishop Blase Cupich on Monday addressed the Catholic Health Associations annual assembly in Washington, D.C. a day before President Barack Obama appears before the same group to discuss health care reform  a source of contention for some of the nations Catholic bishops. That both Cupich and Obama are addressing the Catholic health care group this week highlights the distinctly conciliatory approach to the nations health care law urged by Cupich. While the Catholic Health Association strongly supported the law, many bishops did not because they opposed its coverage of contraception and believed it provided federal money for abortion. But when those bishops declined to help people sign up for coverage under the Affordable Care Act, Cupich, then a bishop in Spokane, Washington, asked Catholic Charities in the eastern part of that state to support sign-up efforts. On Monday, Cupich commended the members of the Catholic Health Association, which includes 600 hospitals and 1,400 long-term care and other health facilities in the U.S. for following the example of Pope Francis by making mercy a priority over other virtues. He also commended their persistence and commitment to open dialogue, which also reflects the style of Pope Francis. \"It would be a mistake to say, as some critics do, that the pope is not concerned with truth, as though mercy and truth are opposed to each other,\" Cupich said. \"What the pope is saying is that there has to be a dialogue between the two. The Catholic Health Association has much experience in keeping this dialogue alive and has never walked away from the table.\", While Cupich never specifically mentioned the Affordable Care Act or the health care debate, he called upon the leaders of health care institutions to continue their dialogue \"as the church moves forward.\", \"Rather than dismissing or ridiculing the other, we should always give the best possible interpretation to our dialogue partners,\" he said. Not doing so risks turning sacred theology into \"a political and ideological battlefield.\", The Catholic Health Associations CEO, Sister Carol Keehan, invited Cupich to deliver the Bishop Sullivan Memorial lecture at the associations centennial meeting. Spokesman Jeff Tieman said Cupich did know ahead of time that Obama would be speaking later in the conference. \"Thematically, the CHA conference will explore opportunities for Catholic hospitals to help shape the next 100 years of health care in our country,\" Tieman said. \"Breakout sessions cover a range of topics from the Washington political landscape to creative approaches to improving the health of everyone, with a special emphasis on people who are most vulnerable.\", Obama will conclude the three-day meeting, talking about the Affordable Care Act. \"We are delighted and honored that President Obama will speak to Catholic health care leaders gathered for our 100th anniversary as an association,\" Keehan said in a statement. \"As longtime supporters of a health care system that works for everyone and pays special attention to those who are poor and vulnerable, we are grateful for the presidents leadership on the ACA.\", mbrachear@tribpub.com, Twitter @TribSeeker]", "Date": "20150608", "Author": "[ Manya Brachear Pashman]", "Link": "http://www.chicagotribune.com/news/ct-cupich-catholic-health-association-met-20150608-story.html", "Title": "[ Cupich commends Catholic health care providers ahead of Obama address]"}