{"Content": "[ Scott Walkers expected campaign for the White House got a boost Thursday as his former campaign managers formed a political group able to raise and spend unlimited amounts of money. Two former campaign managers for the Republican governor of Wisconsin said Thursday they have formed a super PAC to support Walker. Its called Unintimidated PAC, a reference to the book Walker wrote in 2013 called \"Unintimidated: A Governors Story and a Nations Challenge.\", Walker, 47, delivered a well-received speech to a rally of Iowa conservatives in January, and has since made first trips to the early nominating states of New Hampshire and South Carolina, hired staff around the country and courted well-heeled donors. But Walker, who just began his second term as governor, is sticking to his timeline and does not plan to announce a decision on whether to run for president until after he signs the state budget into law, likely in June. Three other Republicans  U.S. Sens. Marco Rubio, Rand Paul and Ted Cruz  have all officially announced their candidacies for president. The super PAC will be headed by Keith Gilkes, a longtime Walker adviser who ran Walkers 2010 campaign and previously served as his chief of staff. He was working for Walker when he successfully stripped the collective bargaining rights of public sector workers in Wisconsin, which generated massive protests and catapulted Walker onto the national stage. That fight led Walker to face a 2012 recall election, which he won. Gilkes also ran that campaign. Scott Walker has transformed Wisconsin politics, winning three elections in four years and signing laws that weaken unions, crippling a key ally of the Democratic Party. But the likely Republican presidential contender has had less success changing Wisconsins economy and budget. The state lags... Scott Walker has transformed Wisconsin politics, winning three elections in four years and signing laws that weaken unions, crippling a key ally of the Democratic Party. But the likely Republican presidential contender has had less success changing Wisconsins economy and budget. The state lags... Stephan Thompson, who ran Walkers 2014 re-election campaign and was a former Wisconsin Republican Party executive director, will serve as Gilkes assistant at the super PAC. James McCray, a GOP fundraiser who previously worked John McCains presidential campaign, will be its national finance director. Super PACs are political committees that operate independently of the candidates and cannot coordinate strategy with the campaigns of those seeking office. But they often can play an outsized role in shaping how voters view the candidates, because they can buy so much more advertising than the campaigns can afford. Walker in January formed a tax-exempt 527 committee called Our American Revival, which can also raise unlimited amounts. But unlike the new super PAC, the money can only be spent on issues, not specifically advocating for Walker as a candidate for president. Associated Press]", "Date": "20150416", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/local/breaking/chi-scott-walker-super-pac-20150416-story.html", "Title": "[ Super PAC formed to help Wisconsin's Scott Walker in 2016 campaign]"}