{"Content": "[ William Holland, who over nearly a quarter-century developed a reputation for fairness and nonpartisanship as the states auditor general, announced Wednesday that he would resign at the end of the year. \"I view the office of auditor general as one of the last bastions of fairness and transparency and accountability in this state, and I like being the auditor general of that agency,\" Holland said at a Capitol news conference. \"I really like what I do, but Im 63, have worked over 41 years in Illinois state government. I have three kids, six grandchildren. Id like to see more of them. It seemed like a good time,\" he said. Holland was elected to an unprecedented three 10-year terms as auditor general by the legislature. The job is the only constitutional statewide executive position not elected by voters. He came to the post after serving as chief of staff to then-Democratic Senate President Philip Rock of Oak Park. Holland acknowledged that that background initially created \"appropriate skepticism\" among some state officials over whether he would use the office in a partisan manner  a concern that quickly evaporated. \"I think you measure the successes based upon the fairness of the process. I would like to believe that the work that has been accomplished by my office by very professional people has been very fair, very accurate and very timely,\" he said. The FBI is investigating whether an executive at the firm that manages Chicagos privatized parking meters was paid $90,000 in bribes to steer a contract to install and maintain the controversial meters across the city. The alleged kickback scheme was laid out in an FBI search warrant affidavit... The FBI is investigating whether an executive at the firm that manages Chicagos privatized parking meters was paid $90,000 in bribes to steer a contract to install and maintain the controversial meters across the city. The alleged kickback scheme was laid out in an FBI search warrant affidavit... Known for a low-key style that shunned personal publicity, Holland acknowledged that his retirement announcement marked only the second news conference he had called at the Capitol during his tenure as the states chief auditor. The first was prompted by a 2005 audit highly critical of the states purchasing agency under disgraced and imprisoned former Gov. Rod Blagojevich. That audit questioned Blagojevich touting $600 million in taxpayer savings that were never proved and uncovered $546,650 in taxpayer-funded expenses, ranging from wining and dining state officials to parking at a Chicago Bulls game. Blagojevich called the findings illogical, but the audit findings later proved true, Holland said Wednesday. Holland said the pushback he received from the Blagojevich administration was the \"worst\" he ever encountered over an audit. \"Frankly, that pushback did nothing but demonstrate how strong our audits were and are, and the work that goes into them, and as a consequence, it has made our product even more respected than it already was,\" he said. Mayor Rahm Emanuel on Wednesday introduced a plan to allow drivers to reserve parking spaces for an extra $10 a day at OHare International and Midway airports and for the city to eventually offer amenities like carwashing, detailing and maintenance services for people who leave their cars at the... Mayor Rahm Emanuel on Wednesday introduced a plan to allow drivers to reserve parking spaces for an extra $10 a day at OHare International and Midway airports and for the city to eventually offer amenities like carwashing, detailing and maintenance services for people who leave their cars at the... Hollands retirement announcement prompted bipartisan congratulations from Republican Gov. Bruce Rauner and the Democratic and Republican leadership of the General Assembly, despite a contentious partisan battle over the next state budget. Rauner called Holland \"a true statesman\" who served the state \"with the utmost integrity, honor and respect.\", Democratic House Speaker Michael Madigan said Holland \"handled every challenge with skill and professionalism.\" Noting critical Holland audits during Blagojevichs tenure, Madigan said Holland \"maintained the highest standards during several very dark periods in this states history.\", And Senate Republican leader Christine Radogno of Lemont said that \"despite coming from a partisan background,\" Holland proved \"his loyalties lie with the people of Illinois.\", \"Hes a class act and true gentleman. The taxpayers of Illinois have been well served,\" she said. The Legislative Audit Commission, a bipartisan group of senators and House members, will put together guidelines and search for Hollands replacement. To become auditor general, a three-fifths majority of the House and Senate must approve the nomination. rap30@aol.com, Twitter @rap30]", "Date": "20150617", "Author": "[ Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-illinois-auditor-general-retires-met-0618-20150617-story.html", "Title": "[ Illinois auditor general to retire at year's end]"}