{"Content": "[ Four years ago, thousands of Syrian men, women and children took to the streets peacefully to demand their right to basic human freedoms. They were met with violence from a regime that has since systematically intensified its brutality. The killing has escalated to such a level that even the United Nations has stopped counting the deaths. With a murderous regime operating with impunity and Islamic States violent extremism feeding on and promoting the horror, the Syrian crisis is at its worst point ever and our moderates  the alternative to Syrian President Bashar Assad and Islamic State  are being squeezed. Nevertheless, Syria is far from hopeless. We must first recognize that terror and tyranny are intimately interlinked. Islamic State capitalizes on Assads tyranny, and he takes advantage of Islamic State by purchasing its stolen oil and allowing it to fight moderate Syrian rebels. Meanwhile, the Islamic State does the regimes dirty work with the regimes complicity. Assads killing and torture  which are on full display at a chilling exhibit this week at United Nations headquarters in New York  and Syrias use of chemical weapons and barrel bombs are fodder for Islamic States prolific recruitment strategy. That such war crimes and crimes against humanity have gone on for years without consequences only emboldens Assads criminal behavior. There are those who claim that siding with Assad is the best option. They argue that he is the lesser of two evils and that only a strongman can maintain control of Syria in order to defeat Islamic State. This is foolish. How can anyone think that the best option is a regime that has left half of the country displaced, 70 percent of the people without electricity, and more than 200,000 people killed? There have been far more deaths at the hands of the Assad regime than from Islamic State. Some say Syrias moderates are a lost cause or that there is no moderate majority in Syria. They are wrong. Free Syrian Army brigades are fighting strong in Syria. But Syrian moderates cannot win a two-front war without increased support from international partners. Our enemies are armed to the teeth. Assad and his supporters have no qualms accepting the funding, supplies and manpower that Iran, Hezbollah and Russia so willingly provide. In contrast, moderate Syrian forces are under-resourced and underprotected. Polling shows that 57 percent of the U.S. public supports using ground troops to fight Islamic State. Americans realize that only bold moves will stop Islamic State in its tracks. And they are correct. Unless there is a comprehensive and intensive effort to defeat Islamic State and its root cause  the Assad regime  we will be faced with another long and costly ground war in the Middle East. Three decisive steps should be implemented to eliminate this deadly nexus that is a direct threat to the U.S. the Middle East and the world. First, Syrian moderates must be trained and militarily equipped at a scale that is equal to the magnitude of the threat posed by Islamic State and the Assad regime. Second, we need greater and more consistent international pressure against the Assad regime, such as instituting crippling sanctions against the regime and its chief backers  Russia, Iran and Hezbollah. Third, Syrian moderates must be protected from Assads aerial bombardment  a no-fly zone is long overdue. To end the crisis in Syria, the international community must work together with moderate Syrian rebels. Hadi al Bahra is the former president of the moderate Syrian Opposition Coalition and was the coalitions chief negotiator at the peace talks in Geneva last year.]", "Date": "20150318", "Author": "[ Hadi al Bahra]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-syria-bashar--assad-united-nations-crisis-islamic-state-perspec-0319-jm-20150318-story.html", "Title": "[ Putting a stop to Assad and his atrocities]"}