{"Content": "[ As Wisconsin Gov. Scott Walker shapes his presidential campaign to appeal to the GOPs deeply conservative base, perhaps nothing is more fundamental than playing up his reputation as a union slayer. \"Since Ive been governor, we took on the unions and won,\" Walker proclaimed in kicking off his campaign earlier this month. \"If our reforms can work in a blue state like Wisconsin, they can work anywhere in America.\", In little over four years as governor, Walker has aggressively succeeded in diminishing public worker unions that were long a powerful economic and political force in Wisconsin, the first state to grant them collective bargaining rights more than a half-century ago. Walkers anti-union record formed the launching pad for his push for the White House and has provided inspiration to other Republican governors, none more so than Illinois Bruce Rauner, who boasted to GOP audiences during his campaign that \"Ive been studying with Scott Walker.\", Walker is bringing his campaign to downstate and Chicago on Monday. Indeed, the current budget stalemate in Springfield is rooted in part in Rauners insistence that any deal include a Wisconsin-like end to collective bargaining rights for public workers as well as a diminishment of clout and influence among private-sector unions. For labor in Wisconsin, the fallout from Walkers tenure is hard to miss. Largely stripped of their power to negotiate wages and benefits, unions representing teachers and many other public employees at the state and local level have experienced a significant falloff in their ranks. Wisconsin Gov. Scott Walker has advice for Illinois Gov. Bruce Rauner on July 27, 2015. (WGN-TV), Wisconsin Gov. Scott Walker has advice for Illinois Gov. Bruce Rauner on July 27, 2015. (WGN-TV), One top official of the American Federation of State, County and Municipal Employees estimated that membership totals in Milwaukee County have dropped 50 percent since Walker became governor in 2011. Nearly half of all public workers in Wisconsin were union members in 2010, but by last year that share had dropped to less than one-third, according to an analysis of federal jobs data by Unionstats, a website run by economists at Georgia State University and Trinity University in San Antonio. Records filed with the Internal Revenue Service show the three AFSCME councils operating in Wisconsin  umbrella groups for union locals  saw their combined revenues drop from $13.8 million the year Walker was first elected to $6.2 million by 2013. The downsizing prompted those three councils recently to merge into one. The changes also have sapped the ability of unions to exert influence in Madison. The Wisconsin Education Association Council, the states largest teachers union, spent $2.5 million lobbying lawmakers in the last biennial legislative session before Walkers first election, state records show. But by the 2013-14 session, the records show spending on lobbying by WEAC had plummeted 93 percent to $175,540. In his first two weeks as a declared presidential candidate, Gov. Scott Walker has touted himself as someone who can unite the country behind conservative reforms that he passed in a blue state. Its an appealing resume in a crowded Republican field from which no one has emerged as a front-runner.... In his first two weeks as a declared presidential candidate, Gov. Scott Walker has touted himself as someone who can unite the country behind conservative reforms that he passed in a blue state. Its an appealing resume in a crowded Republican field from which no one has emerged as a front-runner.... Labor expert Robert Bruno said another spinoff of Walkers war on unions has been to hobble them as a political force. AFSCME, WEAC and other unions were at the center of raucous demonstrations against Walker and Republican lawmakers when they first moved against labor in 2011. The following year, the unions also led an unsuccessful effort to recall Walker that only helped broaden his national stature in the GOP. \"If unions in the public sector are still strong and large, they become an important bulwark and the Democratic Party benefits,\" said Bruno, a professor of labor and employment relations at the University of Illinois at Chicago. Walker took the fight to public worker unions in his first term, but in his second  as he readied his presidential run  he has broadened the battle to include private-sector unions, something he previously indicated he would not do. As turmoil erupted in 2011 over his initial anti-union moves, Walker gave a statewide \"fireside chat\" on public television in Wisconsin in which he hailed private-sector unions as \"our partners in economic development.\", Unlike most in organized labor, Terry McGowan, the business manager of a construction workers union headquartered in Pewaukee, a Milwaukee suburb, endorsed Walkers re-election last year. McGowan said he did so after receiving personal assurances from Walker that he would not go after unions in the private sector. But in his new term, Walker has signed anti-union \"right-to-work\" legislation, scaled back pay protections for many building projects and trimmed state-funded roadwork that provides jobs for McGowans members. McGowan now says Walker double-crossed him. \"To me he lied,\" said McGowan, who heads the 9,100 member Operating Engineers Local 139. \"He looked me in the eyes and told me that it was all safe.\", Walker spokeswoman Laurel Patrick did not directly respond to McGowans allegation, instead issuing a statement that Walkers \"understanding from Mr. McGowan is that his endorsements were due to the dramatic economic turnaround in Wisconsin.\", In his memoir \"Unintimidated,\" Walker portrayed his assault on union power as an effort to reduce costs for taxpayers by making government more efficient, something he said would also help pave the way for an explosion of new jobs and economic growth. Even so, Wisconsin lags neighboring Rust Belt states in job creation and economic growth, and Walker and Republican lawmakers this year struggled to close a large state budget deficit. Walkers book, published last year, makes it clear he believes unions in the public sector at least harm the interests of taxpayers. \"Collective bargaining is the enemy of good government,\" he wrote. The disdain is mutual, union leaders say. Boyd McCamish, the executive director of that remaining Wisconsin AFSCME council, considers Walker \"Hannibal Lecter meets Forrest Gump\" and a \"wholly owned subsidiary of the 1 percent.\", Kathy Cramer, a political science professor at the Madison campus of the University of Wisconsin, said Walkers attacks tap in to a \"politics of resentment\" that ripples through many communities outside the population centers of Milwaukee and Madison. Cramer, whose research centers on attitudes in rural Wisconsin, said public workers are often viewed as privileged by many in their own communities. She summarized such sentiments this way: \"Public school teachers, I know they think they work hard, but they have health care and they have pensions and they are making so much more than anyone else in town.\", As governor, Walkers initial assault on union power, often referred to by its legislative designation  Act 10  was sold as an exercise in cost savings. He erased a state budget deficit in 2011 by cutting aid to schools and local governments, but then helped them plug the resulting budget holes by requiring that more of the cost of employee benefits be offloaded onto workers, who saw a cut in take-home pay. \"These reforms gave local governments and school districts the tools to manage their budgets while saving taxpayers over $3 billion,\" said Patrick, who is the press secretary for Walkers government office and not his campaign. It went further, however. Among other things, Act 10 placed significant limits on the scope of future collective bargaining, barred public bodies from deducting union dues from paychecks and required unions to have members vote once a year on whether the organization should stay in existence. Walker did not make the anti-union initiatives part of his race for governor but sprung them almost immediately after taking office. That said, his antagonism to unions was no secret. As Milwaukee County executive, Walker and organized labor tangled frequently over work rules, pay and other issues. The friction appeared to reach a critical point by 2010 as Walker geared up his campaign for governor, according to emails revealed in a criminal case that led to misconduct convictions of several Walker aides and associates in Milwaukee County. In one email exchange, Walker and then-chief of staff Tom Nardelli received an inquiry from a top county official seeking advice about how to close a budget hole at the county. Nardelli responded by making a nod to Walkers campaign for governor, saying cost-saving furloughs of unionized employees belonging to AFSCME District Council 48 would be preferable to program cuts. \"We are in a campaign,\" he wrote. \"... If all we propose are cuts it will hurt us at the ballot box, in my view. We are never going to get DC48, so I would furlough the hell out of them.\", The furloughs were imposed, though a state commission later found them to be improper and ordered the county to reimburse millions of dollars in back pay to union workers. bsecter@tribpub.com]", "Date": "20150728", "Author": "[ Bob Secter]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-scott-walker-wisconsin-unions-met-20150727-story.html", "Title": "[  Walker's anti-union crusade pivotal to White House run, damaging to labor]"}