{"Content": "[ Amazon delivered a special package to the Illinois economy on Monday  1,000 full-time jobs at what will be its first warehouse in the state. But it got something in return as well  a tax break of up to 10 years from the state in exchange for its promise to invest $40 million in a retrofitted 500,000-square-foot Joliet \"fulfillment center.\", The online retail giant had long avoided having a physical presence in Illinois so that it could sidestep sales taxes, relying instead on massive warehouses in Indiana and, more recently, Wisconsin, to service the Chicago area. But it softened its approach in October when it revealed plans to open an Illinois warehouse, and then again in February, when it began collecting sales tax from Illinois consumers following a law change. Announcing the Joliet location Monday, Mike Roth, Amazons vice president of North America operations, said in a news release that he was \"grateful for the support of local and state leadership in helping to bring Amazon to Illinois.\", While Amazon has been criticized for its treatment of warehouse workers in recent years  with complaints of workers being forced to do physically demanding work and mind-numbingly repetitive work at a relentless pace under overbearing supervision  it has always disputed that. It says the Joliet positions will be \"great jobs\" that come with benefits that include 401(k) contributions, health insurance and help with college tuition. The Joliet warehouse will be used to fill orders of smaller items like books and electronics. Amazon is advertising for $13-an-hour and $14.95-an-hour jobs at the facility. The firm said it was attracted by Joliets proximity to the Chicago market and the availability of labor in an area that has become a major distribution hub for many national retailers. Amazon promises 1,000 full-time jobs at Joliet location. August 10, 2015. (WGN-TV), Amazon promises 1,000 full-time jobs at Joliet location. August 10, 2015. (WGN-TV), Amazon will be able to credit employee withholding taxes against its corporate income tax bill for up to a decade. But the company is missing out on other tax incentives, thanks to the states budget impasse, Department of Commerce and Economic Opportunity spokeswoman Lyndsey Walter said. Joliet did not offer any local incentives, but the city did offer to expedite its permitting process to allow an existing warehouse at I-53 and Laraway Road to be quickly retrofitted, according to John Greuling, president and CEO of the Will County Center for Economic Development. Beyond that offer of speedy help  which should allow Amazon to open the warehouse in time for the holiday season rush, Greuling said  the Seattle-based firm was attracted by Joliets intermodal transportation links, he said. Amazon has earned a reputation as a tough employer to work for after a series of news reports about conditions inside its warehouses. It paid $52 million to install air conditioning at its fulfillment centers in 2012 after Amazon workers in Pennsylvania and Kentucky complained that they were forced to keep up a punishing work rate in stifling summer heat, and, in some cases, fired when they fell ill. Other Amazon workers have said that they felt like human robots as they followed a path around an Amazon warehouse dictated by a hand-held satellite navigation device that tracked their progress minute by minute. Amazon.com will start collecting sales tax from Illinois shoppers Feb. 1, the e-commerce giant said Friday, in compliance with a new state law that aims to treat online and brick-and-mortar retailers equally. The law, which went into effect Jan. 1, requires out-of-state retailers to collect Illinois... Amazon.com will start collecting sales tax from Illinois shoppers Feb. 1, the e-commerce giant said Friday, in compliance with a new state law that aims to treat online and brick-and-mortar retailers equally. The law, which went into effect Jan. 1, requires out-of-state retailers to collect Illinois... But in Will County, Greuling said wages of $13-$15 an hour, plus benefits, put it in the top quarter of warehouse jobs, and that there will likely be better-paid jobs at the warehouse for workers with technical skills. \"A year and a half ago, Illinois was poison to Amazon because of the requirement that it pay an e-commerce tax and a sales tax, but that has obviously changed,\" he said. \"This is great news.\", Joliet Mayor Bob ODekirk also welcomed Amazons decision. \"The company is not only the leader in the e-commerce sector, but it also will create quality jobs for a diverse community throughout Joliet and Will County,\" he said in a news release. Amazon has in the last three years invested heavily in warehouses nationwide as it faces increasing competition from Walmart.com, eBay, Google and other online retailers. It now has fulfillment centers in 26 states, including new facilities in New Jersey, Florida and Kenosha, Wis. The firm has not said whether the Joliet facility will improve its ability to make regular same-day deliveries in the Chicago area. While customers who opt for Amazons premium \"Prime Now\" service in Chicago can get delivery within two hours, Chicago is the only one of 15 markets where Amazon offers regular same-day delivery to non-Prime customers in which orders must be placed by 7:45 a.m. In the other 14 cities where it offers regular same-day delivery, customers have until noon to place an order, according to its website. kjanssen@tribpub.com, Twitter @kimjnews]", "Date": "20150810", "Author": "[  Kim Janssen]", "Link": "http://www.chicagotribune.com/business/ct-amazon-joliet-0811-biz-20150810-story.html", "Title": "[ Amazon's Joliet warehouse: 1,000 jobs, up to 10 years of state tax breaks ]"}