{"Content": "[ The threats to boycott Indiana have faded since the uproar this spring over the states religious objections law, which takes effect Wednesday. Yet, the law criticized as possible legal discrimination against gays and lesbians still troubles tourism efforts and looms over the states politics. At least a half-dozen local governments have taken up proposals to add sexual orientation and gender identity to their anti-discrimination ordinances since Republican Gov. Mike Pence signed the original bill in late March signing of the bill. Meanwhile, the state has sought the services of a public relations firm to repair its reputation. Its actual impact in Indiana is uncertain, as the Republican-dominated Legislature quickly approved revisions prohibiting businesses from using the law as a legal defense for refusing on religious grounds to provide services, goods, facilities or accommodations. A handful of groups dropped their threats to pull conventions from Indianapolis after the revisions to the Religious Freedom Restoration Act, or RFRA, were adopted, although the controversy still hovers, said Chris Gahl, vice president of the Indianapolis tourism group Visit Indy. \"The four-letter word (RFRA) is still being brought up by convention planners,\" Gahl said. \"Certainly, theyre aware the bill is in place, and it is still on their mind. It is something theyre still asking about.\", Visit Indy is waiting until September when it has six months of figures on hotel occupancy and future event commitments before trying to calculate any cost to the central Indiana tourism industry, which supports an estimated 75,000 jobs, Gahl said. But the true impact may not be known for years because trade shows and conventions are planned well in advance. Indiana tourism agencies are rolling out campaigns emphasizing that everyone is welcome, but it might not be enough to quickly restore the states battered image after a backlash over its religious objections law. An uproar sparked by fears that the law would allow discrimination against gays and... Indiana tourism agencies are rolling out campaigns emphasizing that everyone is welcome, but it might not be enough to quickly restore the states battered image after a backlash over its religious objections law. An uproar sparked by fears that the law would allow discrimination against gays and... \"Whats happening on the ground in Indianapolis today is impacting five to seven, maybe even 10 years down the road,\" he said. Indianapolis already has a decade-old local ordinance prohibiting discrimination based on sexual orientation or gender identity. But outside of the capital city, some communities, including Hammond, Terre Haute and Columbus, have adopted or taken up ordinances prohibiting discrimination based on sexual orientation since the religious objections debate erupted. The gay-rights group Freedom Indiana is working to promote such local ordinances this summer before itll turns attention to pushing for the addition of sexual orientation to the states nondiscrimination laws during next years General Assembly session, said Katie Blair, the organizations campaign manager. \"I dont think were going to have this resolved until we pass a full nondiscrimination law statewide for LGBT Hoosiers,\" she said. \"Weve got to put our money where our mouth is and show the country that were a welcoming place for all.\", Gay rights groups and their allies were outraged when Indiana enacted a \"religious freedom\" law that let businesses refuse to take part in same-sex weddings and other events the proprietors find objectionable. Opponents of the new law had an unassailable goal: protecting a small group of people... Gay rights groups and their allies were outraged when Indiana enacted a \"religious freedom\" law that let businesses refuse to take part in same-sex weddings and other events the proprietors find objectionable. Opponents of the new law had an unassailable goal: protecting a small group of people... But there likely wont be many court cases in Indiana over the law, even though its measure received more attention than similar statutes in 19 other states, Indiana University law professor Daniel Conkle said. \"In many states in which these laws have been adopted, they have been relatively obscure,\" said Conkle, who testified in favor of the bill in legislative committees. The Pence administration has already paid a New York public relations firm $750,000 of whats expected to be a $2 million contract to rebuild the states image. Democrats have promised to make expanded nondiscrimination protections a top issue during the 2016 legislative session and the gubernatorial campaigns. Pence has repeatedly said the issue isnt part of his legislative agenda. During his re-election announcement this month, Pence said he shared responsibility for the uproar over the law and that he wouldnt tolerate discrimination against anyone. But he vigorously defended the law, saying that \"in the changing tides of popular culture there must be room for faith.\", -Associated Press, ]", "Date": "20150630", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-indiana-religious-objections-law-20150630-story.html", "Title": "[ Indiana religious objections law to take effect months after uproar]"}