{"Content": "[ In the next few weeks the Cook County Board will be asked to vote to increase the county sales tax. I will vote no. The sales tax is regressive and a penalty to the poor. It punishes businesses on the edge of Cook County and pushes consumers to buy goods on the Internet. Dont get me wrong, the county has a serious budget and pension cost gap, predicted to be $479 million. The proposed 1 percentage point increase in the sales tax would raise some $474 million annually. But $130 million of the deficit goes away with pension reform. An additional $50 million in savings has already been identified by the budget staff. Yet another $50 million is in reach if we are finally willing to consolidate our redundant taxing bodies and duplicative services. So how would we meet our financial needs? Step by step, we can do this. One of those steps is the worst-kept secret in government. For decades, Cook County reformers have asked: Why does the county have so many separate taxing bodies? Why do we have a Cook County sheriffs police force and a Forest Preserves police department? Mosquito abatement districts? Two election agencies? Combining costly, redundant offices could save $50 million. Thats $50 million we dont need to collect in sales tax from county taxpayers. As chair of the County Boards Pension Committee, let me be yet another elected official to implore Gov. Bruce Rauner to support the Cook County pension reform proposal. It is a model for how the state budget crisis can be solved because it is backed with union support and actuarial math. Our workforce and unions did not sit back and wait for taxpayers to solve our pension problem. We came together and everyone gave something to gain solvency. Passing pension reform now would reduce the amount the county would have to increase the sales tax by $130 million a year. Thats $130 million that can stay in taxpayers pockets. Preckwinkle proposes a 10.25% sales tax for Cook County, which would return an extra $473 million in revenue to the county. Preckwinkle proposes a 10.25% sales tax for Cook County, which would return an extra $473 million in revenue to the county. So I will oppose the sales tax increase. Not because I am opposed to new revenue, or because I think government is the problem. I believe government is vital to take on some of the hardest jobs we have. Just ask the correctional officers at Cook County Jail or the nurses at Stroger Hospital. But residents throughout the county are bracing as their state and local governments swim in red ink. Before we ask our taxpayers for more, lets make sure weve done everything we can to make county government work for all of us. Cook County Commissioner Bridget Gainer represents the 10th District on the North Side of Chicago.]", "Date": "20150701", "Author": "[ Bridget Gainer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-cook-county-tax-preckwinkle-gainer-perspec-0702-jm-20150701-story.html", "Title": "[ Cook County Commissioner Bridget Gainer: I won't vote for a sales tax hike]"}