{"Content": "[ Amid all the Islamic States atrocities  its massacres of civilians, its beheading of hostages, its pillaging of antiquities  the systematic violence the jihadists have carried out against countless enslaved women and girls never fails to shock. For months now, weve heard appalling testimony from women who escaped the Islamic States clutches, many of whom endured rape and other hideous acts of violence. Zainab Bangura, the U.N.s special representative on sexual violence in conflict, recently conducted a tour of refugee camps in the shadow of the conflicts in Syria and Iraq, war-ravaged countries where the Islamic State commands swaths of territory. She heard a host of horror stories from victims and their families and recounted them in an interview earlier this week with the Middle East Eye, an independent regional news site. \"They are institutionalizing sexual violence,\" Bangura said of the Islamic State. \"The brutalization of women and girls is central to their ideology.\", Bangura detailed the processes by which \"pretty virgins\" captured by the jihadists were bought and sold at auctions. Heres a chilling excerpt:, \"After attacking a village, [the Islamic State] splits women from men and executes boys and men aged 14 and over. The women and mothers are separated; girls are stripped naked, tested for virginity and examined for breast size and prettiness. The youngest, and those considered the prettiest virgins fetch higher prices and are sent to Raqqa, the IS stronghold. \"There is a hierarchy: sheikhs get first choice, then emirs, then fighters. They often take three or four girls each and keep them for a month or so, until they grow tired of a girl, when she goes back to market. At slave auctions, buyers haggle fiercely, driving down prices by disparaging girls as flat-chested or unattractive. President Obama said he doesnt think the U.S. is faltering in its fight against Islamic State militants in Iraq and Syria, dismissing recent losses as a setback in what he knew would be a long fight and seeking to put the onus on Iraqi Prime Minister Haider Abadi to better train his own military... President Obama said he doesnt think the U.S. is faltering in its fight against Islamic State militants in Iraq and Syria, dismissing recent losses as a setback in what he knew would be a long fight and seeking to put the onus on Iraqi Prime Minister Haider Abadi to better train his own military... \"We heard about one girl who was traded 22 times, and another, who had escaped, told us that the sheikh who had captured her wrote his name on the back of her hand to show that she was his property. \", Estimates vary, but there are believed to be somewhere between 3,000 and 5,000 women enslaved by the Islamic State. Many are Yazidis, a persecuted minority sect that the extremist Islamic State considers to be apostate \"devil-worshippers,\" in part because of the Yazidis ancient connection to the regions pre-Islamic past. The jihadists treatment of Yazidi women, in particular, has been marked out by its contempt and savagery. Heres Bangura again:, \"They commit rape, sexual slavery, forced prostitution and other acts of extreme brutality. We heard one case of a 20-year-old girl who was burned alive because she refused to perform an extreme sex act. We learned of many other sadistic sexual acts. We struggled to understand the mentality of people who commit such crimes.\", Islamic State militants have entered the museum in the captured Syrian city of Palmyra, but there was no immediate word about the fate of precious artifacts or of the fabled ruins outside town, Syrias antiquities chief said Thursday. The possibility that the extremists could damage or destroy... Islamic State militants have entered the museum in the captured Syrian city of Palmyra, but there was no immediate word about the fate of precious artifacts or of the fabled ruins outside town, Syrias antiquities chief said Thursday. The possibility that the extremists could damage or destroy... Hundreds of Yazidi women and girls have escaped their captors, either by running away, or being ransomed and rescued by their families. Bangura has urged international assistance in providing proper medical and \"psychosocial\" support to the escaped women, who have experienced terrible trauma. In a separate interview with the Toronto Star, Bangura warned that neither U.N. agencies nor regional authorities are currently able to provide that sort of care. She said the resilience and ability of these women to build back their lives would help \"strip victory away\" from the militants. \"This is precisely what [the Islamic State] does not want,\" says Bangura. \"It can be a kind of vengeance, helping these women recover and giving them a path to thrive.\"]", "Date": "20150523", "Author": "[ Ishaan Tharoor]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-violence-against-women-islamic-state-20150523-story.html", "Title": "[ Violence against women central to Islamic State's ideology: UN official]"}