{"Content": "[ Zebra Technologies, a Lincolnshire company that provides a player location tracking system for use during National Football League games, has been accused of stealing the technology in a federal lawsuit filed this week by a competing Massachusetts firm. Lynx System Developers, which rolled out its own NFL player tracking system for a trial run during the 2012-13 season, said Zebra misappropriated trade secrets, interfered with existing business relationships and wrongfully filed patent applications claiming ownership of the technology. The lawsuit, filed in U.S. District Court in Massachusetts, seeks to stop Zebra from moving forward on a deal struck with the NFL, which was set to roll out to all 31 stadiums this season. It also seeks \"fair compensation\" for lost profits and damages. Last season, Zebra launched the tracking system at 17 NFL stadiums, including Soldier Field in Chicago. Incorporating a radio-frequency identification chip designed by Zebra, the system provides a wealth of information on player movements during the game. The real-time data was used to enhance graphics for television broadcasts. Once it rolls out across the league, coaches will have real-time access to the data as well. Previously, Zebra supplied its RFID chips to Lynx for use with an earlier system that was tested on Miami Dolphins players at their home stadium. During that 2012-13 season, Lynx entered into a collaboration agreement with Chicago-based Sportvision, best known for the virtual yellow first down line used in NFL broadcasts, to incorporate the data for other media uses. After the test, the NFL wanted to ramp up the system, marketed as IsoLynx, across the entire league, according to the lawsuit. The lawsuit claims that once Zebra became aware of the \"enormous value and growth potential\" of the newly developed technology, the company first tried unsuccessfully to buy the system with a \"low-ball acquisition offer\" and then squeezed Lynx out of the game. Beginning with the NFLs regular season, players will be equipped with tracking technology in their shoulder pads measuring how fast, far and what routes they run  in real time. Beginning with the NFLs regular season, players will be equipped with tracking technology in their shoulder pads measuring how fast, far and what routes they run  in real time. \"Zebra hatched and executed a scheme to take the IsoLynx System and the inventions and technologies used in the system for itself, and cut Plaintiffs out of the business opportunity with the NFL and other customers and business partners,\" the lawsuit said. \"Zebra also poisoned Plaintiffs relationship with Sportvision, causing the collaboration agreement between IsoLynx and Sportvision to be terminated.\", A Zebra spokeswoman issued a statement Friday saying the lawsuit was without merit. \"Zebra has an uncompromising position of honoring its contractual and confidentiality obligations, and respecting the intellectual property of others,\" the company said. \"Lawsuits in technology are an unfortunate part of doing business, and we believe the lawsuit filed against Zebra is without merit; and we intend to vigorously defend against it. It is Zebras policy not to comment further on pending litigation.\", Sportvision, which worked with the Zebra-provided data on behalf of its media clients, including CBS, NFL Network and ESPN, to create television graphics, was not named in the lawsuit. A person familiar with the situation says Tom Bradys appeal of his suspension in the deflated footballs scandal will be heard on June 23. The person spoke to The Associated Press on condition of anonymity Friday because the date hasnt been officially announced. The New England Patriots quarterback... A person familiar with the situation says Tom Bradys appeal of his suspension in the deflated footballs scandal will be heard on June 23. The person spoke to The Associated Press on condition of anonymity Friday because the date hasnt been officially announced. The New England Patriots quarterback... \"Were neither a plaintiff or a defendant, and at this point we have no comment,\" said Mike Jakob, Sportvisions president and COO. News of the lawsuit was first reported by Crains Chicago Business. rchannick@tribpub.com, Twitter @RobertChannick]", "Date": "20150613", "Author": "[ Robert Channick]", "Link": "http://www.chicagotribune.com/business/ct-zebra-nfl-lawsuit-0613-biz-20150612-story.html", "Title": "[ Lincolnshire firm accused of stealing NFL player tracking technology ]"}