{"Content": "[ Why did they do it? What did the Islamic State think it could possibly gain by burning alive a captured Jordanian pilot?, I wouldnt underestimate the absence of logic, the sheer depraved thrill of a triumphant cult reveling in its barbarism. But I wouldnt overestimate it either. You dont overrun much of Syria and Iraq without having deployed keen tactical and strategic reasoning. So whats the objective? To destabilize Jordan by drawing it deeply into the conflict. At first glance, this seems to make no sense. The savage execution has mobilized Jordan against the Islamic State and given it solidarity and unity of purpose. Yes, for now. But what about six months hence? Solidarity and purpose fade quickly. Think about how post-9/11 American fervor dissipated over the years of inconclusive conflict, yielding the war fatigue of today. Or how the beheading of U.S. journalists galvanized the country against the Islamic State, yet less than five months later, the frustrating nature of that fight is creating divisions at home. Jordan is a more vulnerable target because, unlike the U.S. it can be destabilized. For nearly a century, Jordan has been a miracle of stability; an artificial geographic creation led by a British-imposed monarchy, it has enjoyed relative domestic peace and successful political transitions with just four rulers over four generations. Fox News took the controversial step Tuesday of posting online the 22-minute video from the Islamic State terrorist group that shows Jordanian pilot Lt. Muath al-Kaseasbeh being burned to death. To alert Internet users to whats in the video, the presentation features these words: Warning, extremely... Fox News took the controversial step Tuesday of posting online the 22-minute video from the Islamic State terrorist group that shows Jordanian pilot Lt. Muath al-Kaseasbeh being burned to death. To alert Internet users to whats in the video, the presentation features these words: Warning, extremely... Compared with Lebanon, Syria and Iraq, similarly created, Jordan is a wonder. But a fragile one. Its front-line troops and special forces are largely Bedouin. The Bedouin are the backbone of the Hashemite monarchy, but they are a minority. Most of the population is nonindigenous Palestinians, to which have now been added 1.3 million Syrian refugees. Most consequential, however, is the Muslim Brotherhood with its strong Jordanian contingent  as well as more radical jihadist elements, some sympathetic to the Islamic State. An estimated 1,500 Jordanians have already joined the Islamic State in Iraq and Syria. Others remain home, ready to rise when the time is right. The time is not right today. Jordanian anger is white hot. But the danger is that as the Jordanians attack  today by air, tomorrow perhaps on the ground  they risk a drawn-out engagement that could drain and debilitate the regime, one of the major bulwarks against radicalism in the entire region. On Dec. 24, a Jordanian F-16 flying as part of the U.S.-led coalition against the Islamic State crashed in northeastern Syria. Militants captured the pilot. In late January, Islamic State fighters  the thugs responsible for parading and beheading other hostages  threatened the pilots life. He... On Dec. 24, a Jordanian F-16 flying as part of the U.S.-led coalition against the Islamic State crashed in northeastern Syria. Militants captured the pilot. In late January, Islamic State fighters  the thugs responsible for parading and beheading other hostages  threatened the pilots life. He... We should be careful what we wish for. Americans worship at the shrine of multilateralism. President Barack Obamas Islamic State strategy is to create a vast coalition with an Arab/Kurdish vanguard and America leading from behind with air power. The coalition is allegedly 60 strong. (And doing what?) Despite administration boasts, the involvement of the Arab front line  Jordan, Saudi Arabia, Bahrain and the United Arab Emirates  has been minimal and symbolic. In fact, weve just now learned that the UAE stopped flying late last year. The Obama policy has not fared terribly well. Since the policy was launched, the Islamic State has doubled its Syrian domain. Its hard to see a Jordanian-Saudi force succeeding where Iraqs Shiite militias, the Iraqi military, the Kurds and U.S. air power have thus far failed. Whats missing, of course, are serious boots on the ground, such as Syrias once-ascendant non-jihadist rebels, which Obama contemptuously dismissed and allowed to wither. And the Kurds, who are willing and able to fight, yet remain scandalously undersupplied by this administration. Missing most of all is Turkey. It alone has the size and power to take on the Islamic State. But doing so would strengthen, indeed rescue, Turkeys primary nemesis, the Iranian-backed Bashar Assad regime in Damascus. Turkeys price for entry was an American commitment to help bring down Assad. Obama refused. So Turkey sits it out. Why doesnt Obama agree? Didnt he say that Assad must go? The reason is that Obama dares not upset Assads patrons, the Iranian mullahs, with whom Obama dreams of concluding a grand rapprochement. For Obama, this is his ticket to Mount Rushmore. So in pursuit of his Nixon-to-China Iran fantasy, Obama eschews Turkey, our most formidable potential ally against both the Islamic State and Assad. Whats Obama left with? Fragile front-line Arab states, like Jordan. But even they are mortified by Obamas blind pursuit of detente with Tehran, which would make the mullahs hegemonic over the Arab Middle East. Hence the Arabs, the Saudis especially, hold back from any major military commitment to us. Jordan, its hand now forced by its pilots murder, may now bravely sally forth on its own. But at great risk and with little chance of ultimate success. Washington Post Writers Group, letters@charleskrauthammer.com]", "Date": "20150205", "Author": "[ Charles Krauthammer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-jordan-islamic-state-obama-iran-perspec-0206-jm-20150205-story.html", "Title": "[ Krauthammer: Jordan's outrage could be its ruin]"}