{"Content": "[ The setting was Wrigley Field, but the plot was strictly Hollywood: 41,000-plus people watching in rapt attention as the pitcher enters the ninth inning with a no-hitter. He retires the first two batters, then faces the rookie phenom, who works a full count. Obviously fatigued, the pitcher struggles to make that last pitch to secure his place in baseball history. The rookie blasts what looks to be a home run but at the last moment, the Lake Michigan wind guides the ball back in the park while the flabbergasted center fielder falls down at the wall. Suddenly, at the last second he recovers, makes a miraculous catch while lying on his stomach and saves the no-hitter. If you are at the game, should you watch that catch or record it with your cellphone? Which is more important, experiencing the moment or photographing it?, This is the modern existential predicament, familiar to anyone who brings his or her cellphone to a wedding, an outdoor concert or a childs sporting contest. It was the decision my son faced when he took me to the recent game that turned out to be Cole Hamels no-hitter for the Philadelphia Phillies against the Chicago Cubs. For the uninitiated, no-hitters are a baseball rarity. The odds of seeing a no-hitter if you go to baseball games are about 1 in 806, according to ESPN. You could attend every home game of your favorite team for 10 years and not be guaranteed of seeing one. The last Wrigley no-hitter before this was in 1972. (Because I was a teenager working at the ballpark in 1972 and a paying fan at Saturdays game, I am probably one of a select few to witness the last two no-hitters at Wrigley.), Back in 1972 there were no cellphones. Today their existence creates an imperative to record any kind of history with a snapshot, a selfie or a quick video. So when the eighth inning rolled around with the Cubs still hitless, my son dutifully pulled out his cellphone and snapped a couple of pictures. There was no imperative yet; there were two innings for the pitcher to surrender a hit. But when Kris Bryant, the rookie phenom, strolled to the plate as the last man with a chance to get a hit, my son was torn  enjoy the moment or record it?, After throwing the first no-hitter against the Cubs in 50 years Saturday at Wrigley Field, Phillies left-hander Cole Hamels finished his postgame interview and strolled across the field to the visiting clubhouse. A few stragglers from the standing-room-only crowd of 41,683 were left in the ballpark,... After throwing the first no-hitter against the Cubs in 50 years Saturday at Wrigley Field, Phillies left-hander Cole Hamels finished his postgame interview and strolled across the field to the visiting clubhouse. A few stragglers from the standing-room-only crowd of 41,683 were left in the ballpark,... I dont pretend to have the answer to this angst-provoking question. My brief, unscientific survey of people I asked suggests a generational bias. Older people, less familiar with the cellphone revolution, tend to go with the moment. Younger people, who, after all, invented the selfie, are more apt to say go with the camera. At a wedding, my friends daughter told him, \"If you dont get pictures, it didnt happen.\" But there was certainly some overlap between the generations in the people I asked. Parents, of course, are inveterate video recorders. Without a doubt, there is an ineluctable joy to witnessing an event live that enhances your memories. But memories fade over time and eventually vanish. Thus, the value of photographic record is undeniable. Last week, when the Tribune released never-before-published photographs of the 1915 SS Eastland tragedy, the newspaper revived nearly forgotten memories of Chicagos worst one-day loss of life. Someday, in the not too distant future, everyone who was alive when President John F. Kennedy was assassinated will be gone. The 8 mm Zapruder film, however, will endure forever. As it will be early in the next century when video and pictures in some form replace firsthand experiences with the 9/11 tragedy. When Bryant drew his second strike, my son started recording because the next pitch might be the one that completed the no-hitter. Then, as Bryant made solid contact with the pitch, what did my son do? Enjoy the moment or video?, When the ball appeared to be leaving the park, he put down his camera to watch the no-hitter spoiled. But as the wind grabbed the ball and the center fielder made the amazing catch on the ground, the camera was still at my sons side. While the rest of the stadium applauded the effort of the pitcher and center fielder, and one Phillies supporter seated near us began high-fiving dumbfounded Cub fans, my son said, \"I missed taking the video because I was watching the play.\" For a moment, I thought I detected a hint of disappointment in his voice. Moment over, he consoled himself by snapping a picture of the scoreboard indicating the Cubs had failed to register a hit. I told him that photo and his ticket stub would be fitting souvenirs and then said, \"This is probably the last no-hitter I will ever see in person.\" Although he is only in his twenties, my sons reply was something I hadnt considered. Mindful of the probabilities, he said, \"Dad, this is probably the last no-hitter I will ever see in person, too.\", Likely so, but decades hence he will remember it and hopefully recall old dad watching it with him. For my money, it was the better move to enjoy the moment rather than photograph that final dramatic play. One final thing to be grateful for  at least he wasnt texting. Dr. Cory Franklin lives in Wilmette.]", "Date": "20150727", "Author": "[ Cory Franklin]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-no-hitter-wrigley-field-baseball-perspec-0728-20150727-story.html", "Title": "[ 21st-century dilemma: Watch a no-hitter live or through a lens?]"}