{"Content": "[ At a Harvey City Council meeting in June, four aldermen sat in the dark, the lights turned off. Moments earlier, the four  a majority of the City Council  tried to force through a measure to fight corruption in the scandal-plagued suburb, giving the Cook County sheriff broad powers to review city records. Opposing the effort is a longtime mayor concerned enough about outside investigations that in multiple lawsuits during his tenure he has refused to answer questions under oath, citing a fear his answers could be used to prosecute him. That night in council chambers, as the majority pushed to override the mayors veto, the mayor and his political allies walked out. As they left, somebody turned off the lights, according to witnesses and records of the meeting. \"I was totally shocked,\" Ald. Shirley Drewenski said. \"It was total disrespect for the legislative process. It was like he (Mayor Eric Kellogg) wasnt getting his way and he was having a tantrum.\", The anti-corruption measure has since remained in limbo, in a community so troubled that the mayors opponents recently took the unusual step of writing a formal plea for outside help. Half of the six-person City Council signed a July 31 letter addressed to more than a dozen elected officials and agency heads, from Illinois Attorney General Lisa Madigan to Illinois Comptroller Leslie Munger to FBI Director James Comey to President Barack Obama. In the letter, the three aldermen urged each official and agency, \"in whatever way, under whatever legal authority you may have, to intervene into the City of Harvey.\", On Sangamon Street near the northern border of Harvey sit two, crisp 1-story houses. In the gray one, Ruth Cameron raised two daughters who went off to college. One came back and bought the blue one next door. Together, the women describe a growing list of frustrations. They say the fire hydrant... On Sangamon Street near the northern border of Harvey sit two, crisp 1-story houses. In the gray one, Ruth Cameron raised two daughters who went off to college. One came back and bought the blue one next door. Together, the women describe a growing list of frustrations. They say the fire hydrant... Kellogg disputed the allegations in the letter, which he called \"highly politicized\" and \"filled with misinformation and untruths,\" and said the authors are the ones holding back the city by failing to attend meetings in recent months and refusing to approve payment of city bills. \"I apologize to all elected individuals that received this letter from elected officials in Harvey that are attempting to politicize and provide misinformation regarding our community,\" Kellogg said in a written response provided by city spokesman Sean Howard. \"Letters from elected officials such as the one sent from these individuals decrease employment opportunities and economic growth.\", At a meeting last week, angry residents complained that the citys failure to pay bills has halted garbage collection and left them with piles of rotting trash. The aldermen countered that the city hasnt cut checks for garbage pickup that were approved by the council in the spring, and say they will not approve new payments until they are able to form committees to review invoices. Kellogg previously vetoed a measure to create committee assignments. Days after being re-elected, the mayor of a long-troubled suburb was sued by one of his former top aides who claimed the mayor allowed others to berate and threaten her after they stopped dating. The ex-aide, Sandra Alvarado, served as Harvey Mayor Eric Kelloggs spokeswoman and a top police administrator... Days after being re-elected, the mayor of a long-troubled suburb was sued by one of his former top aides who claimed the mayor allowed others to berate and threaten her after they stopped dating. The ex-aide, Sandra Alvarado, served as Harvey Mayor Eric Kelloggs spokeswoman and a top police administrator... The letter, signed by Drewenski, along with Ald. Joseph Whittington and Ald. Christopher Clark, comes after a series of Tribune investigations since 2013that found widespread problems in a once-stable blue-collar community considered one of the anchors of the south suburbs. The Tribune found Harveys leaders gave out insider deals that drained the city of millions of dollars and failed to follow government accountability laws. The newspaper also documented how outside agencies largely failed to intervene. Since then, little has changed. In June 2014, the U.S. Securities and Exchange Commission sued Harvey in federal court, alleging fraud in a failed hotel deal exposed by the Tribune that saddled taxpayers with millions in debt. But the SEC later settled the case by allowing the city to have its finances monitored by the court  and then the court agreed to keep the information secret from the public. The Illinois comptroller  more than a year after dispatching auditors  has yet to bring Harvey into compliance with annual audits required by law. The office says it hopes to get one of the past-due audits, dating to 2010, done this summer. Kellogg said the city expects to complete the audits through 2013 before the end of October. In their letter, the aldermen recount a litany of scandals. Among the complaints are:, A Police Department rife with allegations of corruption, abuse and incompetence, including the failure to test hundreds of rape kits for DNA that could have led to arrests. After the kits were seized by the Cook County states attorneys office in 2007, authorities linked several of them to men who committed other rapes while the kits were collecting dust in Harvey. The untested kits led, in part, to a review of the Police Department by the U.S. Department of Justices Civil Rights Division, which found that the departments record keeping was so poor that it could not determine whether allegations of police brutality and civil rights violations were true. Federal officials threatened to come back if reforms werent made. But the aldermen wrote that little has been done since, either by the suburb or by federal officials who claimed theyd hold the suburb accountable. The false arrest on a gun charge that sent a Harvey man to prison for more than two years until he was found to have been wrongfully convicted, prompting a judge to take the rare step of issuing a certificate of innocence. The man sued Kellogg and former Harvey police Detective Hollis Dorrough, alleging they framed him because the mayor thought the man had stolen his cocaine. Kellogg denied the allegations, and the city later settled the case for $1.4 million. The findings by the Tribune that an undercover FBI agent pumped about $140,000 into a political committee that helped Kellogg in his 2007 re-election bid. The FBI has refused to explain why it did that, or release any records on the agents undercover operation, which ended in 2008. Millions of taxpayer dollars unaccounted for as the suburb starved its worker pension funds, failed to pay the city of Chicago for water Harvey resold and borrowed big to fund a failed hotel redevelopment that enriched Kelloggs hand-picked city comptroller but left taxpayers saddled with debt. The letter notes that some officials have asked questions and some agencies have launched investigations, but they have done little to hold people accountable. Meanwhile, \"millions of dollars are missing. Laws are broken. Rights are violated. Citizens suffer,\" the letter said. One notable exception has been the Cook County sheriffs office, which was brought in last year to audit the Harvey Police Department after council members stopped Kelloggs efforts to block the review. In 2013, Cook County Sheriff Tom Dart sent letters to 130 suburban municipalities, offering to serve as inspector general for each town free of charge. The role provides sheriffs department officials much greater access to records and employees to investigate allegations of mismanagement and wrongdoing. Kellogg called Darts offer political posturing and continues to fight the majority of the City Councils effort to bring in the sheriffs department as the citys inspector general. That City Council majority may be short-lived. In a twist, one of the aldermen trying to bring in the sheriff is a convicted felon embroiled in a court battle over whether he may remain in office. Ald. Lamont Brown, 41, pleaded guilty in 1991 to possession of a controlled substance and three years later to possession of a stolen motor vehicle. He was elected to his first term in April and was sued by a Harvey man seeking his removal. Brown said he fully supports the letter but decided not to sign it because he didnt want it to appear that it was in done in response to the lawsuit against him. He said he began the process of obtaining a pardon last fall, and during a meeting last week pledged to fight to remain on the board \"despite the challenges that I face.\", \"If I didnt have a strong conviction that I was compelled by God to fight for you all, to work for you all, I would not be here,\" he said. mwalberg@tribpub.com, jmahr@tribpub.com, Twitter @mattwalberg1, Twitter @JoeMahr1]", "Date": "20150810", "Author": "[ Matthew Walberg, Joe Mahr]", "Link": "http://www.chicagotribune.com/news/watchdog/ct-harvey-turmoil-met-20150809-story.html", "Title": "[ Harvey aldermen plead in letter for outside help in troubled suburb]"}