{"Content": "[ Here are some things I bet you dont know about Marina City, the great Chicago urban complex thats on the way to becoming an official city landmark.  Marina City and its corncob-shaped residential towers, finished in 1963, were initially a huge tourist attraction  the Millennium Park of their day. Model apartment units drew 12,000 people a month. Tourists photographed the complex so often that Holiday magazine remarked: \"In most parts of the world, you have to be talented, beautiful or notorious to be pursued by paparazzi. At Marina City, all you have to do is live there.\",  Like Millennium Parks shimmering Cloud Gate sculpture, Marina Citys twin towers became a symbol of Chicago as a forward-thinking, modern city. Anticipating a trend prompted by todays iconic buildings, airlines and whiskey-makers featured it in 60s ads to associate themselves with its modernity and excitement. These morsels come from a draft report on Marina City written for the Commission on Chicago Landmarks, which on Thursday granted the complex preliminary landmark status. Far from being a dry treatise, the report tells the warts-and-all, flesh-and-blood story of the conception, construction and marketing of one of Chicagos most significant 20th-century works of architecture and urban design. No one needs to make the case that Marina City deserves landmark protection. But the report, researched and written by Emily and Lara Ramsey of Ramsey Historic Consultants, makes that case in illuminating, even entertaining, fashion. There is some familiar ground to cover. Designed by visionary Chicago architect Bertrand Goldberg, Marina City had an unlikely patron  the Building Service Employees International Union, often called the janitors union, though it also represented elevator operators and window washers. Although the Chicagos landmarks commission granted preliminary landmark status to Marina City on Thursday, permanent protection for the riverfront complex is not yet a sure thing. The chief question is whether the owner of the hotel and commercial portions of the complex  LaSalle Hotel Properties,... Although the Chicagos landmarks commission granted preliminary landmark status to Marina City on Thursday, permanent protection for the riverfront complex is not yet a sure thing. The chief question is whether the owner of the hotel and commercial portions of the complex  LaSalle Hotel Properties,... The unions president, William McFetridge, had a particular reason for wanting to stem the tide of city residents to the suburbs: People living in suburban houses didnt need a janitor. His friend, the real estate wheeler-dealer Charles Swibel (who later had a troubled tenure as chairman of the Chicago Housing Authority) pitched McFetridge the idea of investing the union funds in middle-income housing. In 1959, McFetridge hired Goldberg, a Harvard-educated architect who had designed the unions offices at 318 W. Randolph St. and had begun to explore cylindrical forms as an alternative to boxy, steel-and-glass high-rises. Soon after, the two dined with Swibel at Fritzels restaurant at 201 N. State St. which catered to high-powered names in politics, entertainment and sports. Goldberg told McFetridge hed found a choice site, a 3.1-acre rail yard along the Chicago River in the 300 block of North State, but that it was \"too rich for your blood.\", As Goldberg recalled: \"The three of us stood out there on the sidewalk and I said: There. (McFetridge) looked at it, and he said to Chuck Swibel, See what you can buy it for.\", Swibel got the land at a bargain price, and Goldberg set about designing the five-building complex, which also includes a 10-story office building (now a hotel), a two-story commercial building and a saddle-shaped theater building (now the House of Blues). With the old rail yard surrounded by warehouses, the idea was to build a self-contained \"city within a city,\" with everything from a bowling alley to a flower shop to spiral parking ramps to a marina that anticipated by decades the citys current push to turn the river into a recreational amenity. Chicagos newly-extended Riverwalk, already a people magnet, and the burgeoning River North district, with its mix of restaurants and entertainment attractions, are both indebted to Goldbergs vision of the city as a dense, vibrant place. To get crucial federal mortgage insurance, which at the time was available only to married couples with children, the Marina City triumvirate had to persuade the Federal Housing Administration to alter its definition of \"family\" to include single people and married couples without children, who were the likely tenants for the complex. During the ceremonial groundbreaking in late November 1960, President-elect John F. Kennedy addressed the crowd by telephone from Palm Beach, Fla. Mayor Richard J. Daley, a major backer of both the project and the president, was there, of course. But the real spectacle came with the actual construction: The towers rose at the rate of one floor per day. Innovative construction cranes climbed up their cylindrical cores, which contain elevators, stairs and mechanical systems. To market the pathbreaking plan, Goldberg and McFetridge spent $50,000 on full-scale mock-ups of the apartment and office spaces. The mock-ups incorporated large-scale versions of skyline photos taken by helicopters hovering at the level of the apartments. Shrewdly, as the report points out, Goldberg had Chicago department store Marshall Field & Co. \"decorate the interiors, to show that everyday furnishings could work in the wedge-shaped rooms of the apartments.\", The sales job succeeded, but Marina City failed to live up to its original developers goals of economic accessibility and racial integration. Members of the janitors union complained they could not afford to live there. When Ebony magazine profiled the complex in 1964, African-American tenants occupied only six of the 896 apartments. One of them, a real estate broker named Albert Gaskin recalled how a white female resident mistook him for a maintenance worker when they met in the complexs laundry room. \"Oh, you have a lot of machines to take care of, dont you?\" she said. \"I dont work here,\" Gaskin replied. \"I live here.\", The report doesnt adequately explain why other real estate developers failed to follow Marina Citys triumphant model, but it does shed valuable light on how Goldberg successfully melded form, function and finance. Besides being distinctive, the cylindrical form of the towers reduced wind loads. Petal-shaped floor plans created a feeling of expansiveness in the modestly-sized apartments. Goldberg estimated that using concrete, rather than steel, reduced construction costs by up to 15 percent. All this begs a question: With Marina Citys shining example of innovation staring us in the face, why are so many todays new apartment buildings so utterly bland?, bkamin@tribpub.com, Twitter @BlairKamin]", "Date": "20150709", "Author": "[ Blair Kamin]", "Link": "http://www.chicagotribune.com/news/columnists/ct-marina-city-column-kamin-met-0710-20150709-column.html", "Title": "[ Famed Marina City granted preliminary Chicago landmark status]"}