{"Content": "[ The board of directors for the Naperville Area Chamber of Commerce is opposing a proposed city sales tax. The measure is scheduled to come before the City Council for tentative approval during its business meeting Tuesday night. City officials are looking for ways to help shrink an anticipated $6.8 million municipal budget shortfall. Nicki Anderson, the chambers president and CEO, said members and business owners have indicated to her that the idea of adding a city retail tax has not been well communicated. Adding a 1 percent municipal tax would bring the sales tax rate in Naperville to 8.25 percent. Anderson said the added tax would put local retailers at a \"competitive disadvantage\" and that the city needs to investigate more thoroughly other ways to cut the deficit. \"There are some unanswered questions about potential (spending) cuts, and ideas for other revenue sources,\" she said. Chamber board Chairwoman Rosemarie Breske Garvey also urged \"thoughtful consideration for all stakeholders\" in a press release issued late Tuesday afternoon. \"Naperville businesses are once again starting to slowly grow after experiencing one of the worst economic downturns in our nations history,\" Breske Garvey said. \"The last thing we need is to implement a local sales tax that will slow growth, drive business out of the city and force businesses to raise prices where it hurts the most: in Naperville families wallets.\", A Naperville Area Chamber of Commerce committee decided through a voice vote Monday not to formally oppose a plan by Naperville to add a 1 percent municipal sales tax, but that doesnt mean members are happy about the idea. \"Were pro-business,\" chamber President and CEO Nicki Anderson said, \"and... A Naperville Area Chamber of Commerce committee decided through a voice vote Monday not to formally oppose a plan by Naperville to add a 1 percent municipal sales tax, but that doesnt mean members are happy about the idea. \"Were pro-business,\" chamber President and CEO Nicki Anderson said, \"and... Among the options the board wants studied further, she said, are cutting line-item expenses in the budget, selling underutilized city assets, evaluating services and a marketing program that would take aim at re-establishing competitive advantages in the business community. In a letter to members that was posted on the chambers website Monday, Anderson encouraged local business people to attend Tuesdays meeting and air their positions on the proposed tax hike, which could provide some $18 million in new revenue annually, according to staff estimates. \"Although this sounds like a logical solution, historically the Naperville Area Chamber of Commerce does not support a sales tax increase as its presented,\" Anderson said in the posted message. The chamber, which counts some 1,300 members, did not take a position opposing the proposed increase in residents monthly garbage fees from $2 to $12.35. City staff say that change, if enacted, will cut city spending by $5 million annually. Chamber officials also have had no discussions centered on the sales tax so far with members of the citys recently expanded Financial Advisory Board, Anderson said. The groups membership was increased from five to seven members earlier this month on an expedited basis. Officials said the quick approval for the change was needed to enable staff and council members to receive valuable input from the recommending body as they move forward with plans to address the budgetary red ink. \"Thats the conversation that I wish I would have had,\" Anderson said. A general meeting  involving chamber members beyond the board and the legislative committee, which has discussed the proposal  would be particularly constructive, she said. It would enable the board to address questions and concerns from the membership, many of whom have said they knew nothing about the proposed tax before hearing from the chamber about it, she said. Anderson said she would like to see a more thorough discussion of the plan among city officials, staff, business owners and other community members. \"Thats what I feel would be really great outreach,\" she said. scarlman@tribpub.com, Twitter @scarlman]", "Date": "20150818", "Author": "[ Susan Frick Carlman]", "Link": "http://www.chicagotribune.com/suburbs/naperville-sun/news/ct-nvs-chamber-tax-st-0819-20150818-story.html", "Title": "[ Chamber board gives sales tax idea a thumbs-down]"}