{"Content": "[ One of the most ironic things about U.S. presidents is how soon after they get comfortable with the job, its over. Thats a happy thought to those who cant wait to see President Barack Obama go  as the ranks of hopeful Republican candidates grow well past a dozen. But the presidents attitude? \"Bucket.\", Thats what he said with a shrug, you may remember, during his comedic speech at this springs White House Correspondents dinner, broadcast live on C-SPAN. \"After the midterm elections, my advisers asked me, Mr. President, do you have a bucket list?\" he mockingly recalled. \"And I said, Well, I have something that rhymes with bucket list.\", As the audience laughed, the president clarified: \"Take executive action on immigration? Bucket! New climate regulations? Bucket! Its the right thing to do.\", Flash forward and, with tongue only slightly in cheek, it is easy to view recent days as the Bucket Period of the Obama presidency. Though last week was memorable because of its political achievements, President Obama says marrying his wife was his best week ever. June 30, 2015. (Reuters), Though last week was memorable because of its political achievements, President Obama says marrying his wife was his best week ever. June 30, 2015. (Reuters), You could hear it, for example, in his blunt rebuke of a heckler who was trying to shout him down at a White House reception. \"Hey, listen, youre in my house,\" Obama said, clearly annoyed. \"... Youre not going to get a good response from me by interrupting me like this .... \"As a general rule, I am just fine with a few hecklers,\" the president continued, lightening up a bit. \"But not when Im up in the house. My attitude is, if youre eating the hors doeuvres ... and drinkin the booze ... I know thats right. Anyway, where was I?\", Although few news reports mentioned it, the heckler happened to be Jennicet Gutierrez, an transgender Latina activist living in the country illegally  a minority group if ever there was one. Writing later in the Washington Blade, Gutierrez said she was trying to protest the administrations detention of other gay, lesbian, bisexual and transgender immigrants here without legal permission. Thats a worthy cause. But is it worthy enough to interrupt the president in a White House ceremony? As Obama might say, bucket. On Monday, I started the work week off right, by signing two bipartisan trade bills into law. Theyll help level the playing field for American workers and businesses, boost our economic ties with lower-income countries, and give our workers the job training and support they need to succeed in... On Monday, I started the work week off right, by signing two bipartisan trade bills into law. Theyll help level the playing field for American workers and businesses, boost our economic ties with lower-income countries, and give our workers the job training and support they need to succeed in... Or as comedian Robin Thede said in a skit on Comedy Centrals \"The Nightly Show\" with Larry Wilmore, its all part of Obamas \"second biggest initiative\" besides Obamacare: \"Obama Dont Care.\", Well, lets allow that Obama does care, but hes being choosy about what he cares about. He appeared to have grown his own new layer of Teflon after his surprising alliance with Republicans and against many unions managed to get his fast-track trade authority through Congress. And any offense in the gay community after Obamas rebuke of Gutierrezs interruption probably evaporated in the celebrations that followed the Supreme Courts nationwide legalization of same-sex marriage. And that came a day after the high court rescued the presidents Affordable Care Act for the second time. Republican opposition? Bucket. Obamas new level of comfort also showed itself after he mentioned the N-word during an otherwise unexceptional interview on Marc Marons podcast \"WTF.\", Mentioning the N-word is a presidential first  in public, anyway. But Obama dont care. Not unless youre also willing to deal with more serious problems with racism. Which is precisely what the president faced at the funeral of the Rev. Clementa Pinckney, one of nine African-Americans fatally shot, allegedly by a white racist, at an evening Bible class in Charleston, S.C. Delivering at least his 12th speech after a mass shooting, according to The Washington Posts count, he departed from his famously eloquent speaking style to lead the minister and crowd in a spontaneous rendition of \"Amazing Grace.\" The surprising move came at precisely the right time to lift spirits locally and nationwide after the horrendous national tragedy. By the end of the week, a CNN/ORC poll reported, Obamas approval ratings had inched up to 50 percent, his highest in that poll since 2013. Hes still got a year and a half left in office and more deeply contentious issues to tackle. But like numerous others who came before him, he appears to be getting comfortable with the job  before he hands it over to somebody else. Clarence Page, a member of the Tribune Editorial Board, blogs at http://www.chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150630", "Author": "[ Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-barack-obama-affordable-care-gay-marriage-perspec-0701-20150630-column.html", "Title": "[ The 'Obama Don't Care' initiative]"}