{"Content": "[ Illinois Gov. Bruce Rauner recently said that like a family, everyone must come together to address the reality of the states financial crisis. But the mayors and village presidents that represent some 750,000 residents in Kane, Kendall and DeKalb counties arent feeling the love. \"For years Springfield has pick-pocketed municipalities. Now the governor has advocated armed robbery,\" Geneva Mayor Kevin Burns said Tuesday. Representatives of the Metro West Council of Government municipal alliance Tuesday balked at the governors proposal to slash in half the local governments share of state income tax revenue. Rauner made the announcement during his first budget address to the Illinois General Assembly last week, as part of a budget plan to \"restore Illinois to fiscal health,\" he said. The suburban leaders met at the annual Metro West Legislative Breakfast at the Gaslite Manor in Aurora to send a unified message back to Springfield that the governors proposal is not acceptable. The suburban mayors and village presidents in their response said they have made their fair share of sacrifices as municipalities and now it is time for the state of Illinois to do its fair share. As Gov. Bruce Rauner announced steep cuts in funding for Medicaid, aid to cities and transportation agencies in his Wednesday address about the coming years budget, public school officials in the Aurora area remained cautiously optimistic. Amid cuts in his \"turnaround budget,\" Rauner also proposed... As Gov. Bruce Rauner announced steep cuts in funding for Medicaid, aid to cities and transportation agencies in his Wednesday address about the coming years budget, public school officials in the Aurora area remained cautiously optimistic. Amid cuts in his \"turnaround budget,\" Rauner also proposed... Nine state senators and representatives from the area attended the nearly three-hour session. Burns said the governors policy-makers neglected to seek input from local municipalities. \"If we are all part of the same family, then invite all of the members of the family to dinner. Clearly he has requested we go to the drive-through,\" Burns said. Aurora Mayor Tom Weisner said Illinois has a newly-elected governor and the mayors are ready to participate in the conversation. He said, though, a 50 percent cut in income from the state could mean a loss of an estimated $10 million per year to his city. \"The body of politics in Illinois has its parts with Springfield as the head and the cities as the heart. I would argue we cannot strengthen the head of the state by weakening the heart,\" Weisner said. Weisner said cities and villages across the state have been in the trenches to keep their communities afloat by taking responsible action during tough economic times. \"I would suggest rather than looking at our bank accounts, the state instead look at our example and learn from it,\" Weisner said to applause. He said cities are not sitting on a \"pile of reserves,\" as Rauner has suggested. The impact to Oswego of the proposed state cuts would be a loss of $1.5 million a year, which represents about 9 percent of the villages general fund budget, according to Oswego Village President Brian LeClercq. \"Let me know if we need to pass on police protection, drinking water or on our roads,\" LeClercq said. The proposed loss to Elgin would be about $5 million annually, or the cost to fund three of the citys seven fire stations, said Elgin Mayor David Kaptain. The proposed cuts would translate into $1 million and $1.2 million per year less for both Geneva and Batavia, respectively. State Rep. Anna Moeller, D-Elgin, said there has long been a concern the state could \"sweep\" the income tax revenues out from local municipalities, but it has never actually been contained in a budget plan. \"It gives me reason to pause and be worried,\" Moeller said. State Sen. Karen McConnaughay, R-St. Charles, said there was enough in the budget plan to make people \"squirm in our seats,\" but that municipalities need to think of what their message needs to be to Springfield. \"Everyone needs to take a deep breath. There are a lot of moving parts to this,\" McConnaughay said. \"Cutting (funding) sounds easier to a new administration than it really is in reality because you provide so many of the basic services the citizens of this state require. Start with the idea that you have to educate a new governor so he understands what the real impacts are,\" she said. \"We cannot go back and represent the interests of local municipalities without specific alternatives. The cuts have to happen someplace.\", State Sen. Linda Holmes, D-Aurora, said while the governor is new in the political process the proposed cuts are \"real life issues\" and not a \"training exercise.\", She said regardless of what is proposed in the budget, it will take 60 votes in the House and 30 votes in the Senate to pass measures. Many of the leaders present said that Rauner needs to understand the concerns raised at the Aurora meeting. \"This isnt like the family sharing the pain,\" Oswego Village Administrator Steve Jones said of the proposed cuts. \"This is like irresponsible parents taking money out of the allowance jar of the kids.\", Linda Girardi is a freelance reporter]", "Date": "20150224", "Author": "[ Linda Girardi]", "Link": "http://www.chicagotribune.com/suburbs/aurora-beacon-news/news/ct-abn-metro-west-st-0225-20150224-story.html", "Title": "[ Fox Valley leaders blast Rauner plan for cuts to local government ]"}