{"Content": "[ The Supreme Court acted Monday to keepTexas 19abortionclinics open, amid a legal fight that threatens to close more than half of them. The justices voted 5-4 to grant an emergency appeal from the clinics after a federal appeals court upheld new clinic regulations and refused to keep them on hold while the clinics appealed to the Supreme Court. The Supreme Court order will remain in effect at least until the court decides whether to hear the clinics appeal of the lower court ruling, not before the fall. The courts decision to block the regulations is a strong indication that the justices will hear the full appeal, which could be the biggestabortioncase at the Supreme Court in nearly 25 years. If the court steps in, the hearing and the eventual ruling would come amid the 2016 presidential campaign. Chief Justice John Roberts and Justices Samuel Alito, Antonin Scalia and Clarence Thomas would have allowed the state to move ahead with regulations requiringabortionfacilities to be constructed like surgical centers. Doctors at all clinics also would be required to have admitting privileges at a local hospital. The clinics said enforcing the new regulations would lead to a second major wave of clinic closures statewide since the law was enacted in 2013.Texashad 41abortionclinics in 2012; 19 remain. The admitting privileges requirement already is in effect in much of the state. Stephanie Toti, a lawyer for the Center for Reproductive Rights who is representing the clinics, said some clinics that closed because doctors lacked admitting privileges might be able to reopen. While the clinic operators said they were relieved by the courts action, supporters of the state law criticized the order. \"Women and babies are being denied protections with the Supreme Court blocking pro-life legislation,\" said Lila Rose, president of Live Action, an anti-abortion advocacy group. The regulations would have left the state with no clinic west of San Antonio. Only one would have been able to operate on a limited basis in the Rio Grande Valley. The Supreme Court also is weighing an appeal from Mississippi, which is seeking to enforce an admitting privileges requirement that would close the lastabortionclinic in the state. A different three-judge panel of the same federal appeals court, the New Orleans-based 5th U.S. Circuit Court of Appeals, has blocked the Mississippi law. In November 2013, Justice Stephen Breyer wrote that four justices probably would want to review the constitutionality of theTexasregulations. Last year, the high court prevented enforcement while the case was on appeal to the 5th Circuit. Backers of the regulations say they are common-sense measures intended to protect women.Abortionrights groups say the regulations have only one aim: to make it harder, if not impossible, for women to getabortionsinTexas. The case could be attractive to the justices because it might allow them to give more definition to the key phrase from their last bigabortionruling, Planned Parenthood v. Casey, in 1992. States generally can regulateabortionunless doing so places \"an undue burden\" on a womans right to get anabortion. Monday was the 23rd anniversary of the Casey ruling. Associated Press]", "Date": "20150629", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-supreme-court-texas-abortion-20150629-story.html", "Title": "[ Supreme Court rules Texas abortion clinics can remain open]"}