{"Content": "[ Hillary Clintons problems dont seem to be going away. Aside from poll numbers showing her slipping in Iowa against potential competitors, she has not been able to figure out how to respond either to her e-mail scandal or the consequences of her foreign policy. And her email scandal just got a whole lot worse. McClatchy reports, It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as Top Secret.  The report continued, The inspector general for the Intelligence Community notified senior members of Congress that two of four classified emails discovered on the server Clinton maintained at her New York home contained material deemed to be in one of the highest security classifications more sensitive than previously known. Then word broke Tuesday evening that Clinton is agreeing to turn over her server to the Justice Department. The plot certainly thickens now, and depending on what is on the server or what the FBI can reconstruct, more damaging revelations may well follow. As CNN reported, For Clinton, the move which Republicans like House Speaker John Boehner have urged for months indicates her campaign sees a growing risk in the issue of her use of a private email server, which has stoked concerns about her trustworthiness. Boehner, who has hounded Clinton for months to give up the server, put out a statement, which read: Its about time. Secretary Clintons previous statements that she possessed no classified information were patently untrue. Her mishandling of classified information must be fully investigated. House Select Committee on Benghazi Chairman Trey Gowdy, R-S.C. who can claim credit for starting the inquiry that uncovered the home server, observed, The IC Inspector General revealed Secretary Clintons emails and server contained not just top secret classified information, but compartmented classified intelligence not releasable to foreigners, which must be noted in the timing of this announcement. He continued, Secretary Clintons decision to prioritize her own convenience and desire for control over the security of our countrys intelligence should concern all people of good conscience. This is a serious national security issue, and the seriousness of it should transcend normal, partisan politics. Even without new evidence from the Justice Department inquiry, being swept up in an FBI-led inquiry is never a plus for a presidential contender. As things stand, Clintons cavalier attitude toward the nations security whether for convenience or to avoid scrutiny has already left many voters nonplussed:, The expanding inquiry threatens to further erode Clintons standing as the front-runner for the Democratic presidential nomination. Since her reliance on private email was revealed in March, polls in crucial swing states show that increasing numbers of voters say Clinton is not honest and trustworthy, in part, because of her use of private emails. Joe Biden almost certainly isnt going to challenge Hillary Clinton, and thats too bad  for Clinton. I say that only half in jest. Surely, nobody at Clinton headquarters in Brooklyn is eager for a primary bloodbath with the vice president. But the absence of a credible challenge to Clinton has... Joe Biden almost certainly isnt going to challenge Hillary Clinton, and thats too bad  for Clinton. I say that only half in jest. Surely, nobody at Clinton headquarters in Brooklyn is eager for a primary bloodbath with the vice president. But the absence of a credible challenge to Clinton has... Sen. Chuck Grassley, the Republican chairman of the Judiciary Committee, wants Clinton and her aides to come clean and cough up information about their personal email use. . . . Clinton, which has repeatedly denied she ever sent or received classified information, has attempted to downplay the scrutiny as mere partisan attacks, but questions about her judgment and motive for setting up a private server in her Chappaqua house in 2009 continue to dog her. Her campaign declined to comment. One would think this would be enough to disqualify a Cabinet nominee or a congressional candidate. It verges on inexcusable for a presidential contender. Then there is Clintons record at the State Department. In a blistering attack on her lack of vigilance, Jeb Bush at the Ronald Reagan Presidential Library on Tuesday night told the audience:, So why was the success of the surge followed by a withdrawal from Iraq, leaving not even the residual force that commanders and the joint chiefs knew was necessary? That premature withdrawal was the fatal error, creating the void that ISIS moved in to fill - and that Iran has exploited to the full as well. ISIS grew while the United States disengaged from the Middle East and ignored the threat. And where was Secretary of State Clinton in all of this? Like the president himself, she had opposed the surge, then joined in claiming credit for its success, then stood by as that hard-won victory by American and allied forces was thrown away. Try as she might to focus on the policies she wants to enact if elected president, Hillary Rodham Clinton just cant dig out of her inbox. Clintons email problems are getting worse. She agreed to turn over her private server to the Justice Department this week on the same day Congress got word... Try as she might to focus on the policies she wants to enact if elected president, Hillary Rodham Clinton just cant dig out of her inbox. Clintons email problems are getting worse. She agreed to turn over her private server to the Justice Department this week on the same day Congress got word... In all her record-setting travels, she stopped by Iraq exactly one time.In an attempt to counteract the speech, Clinton aide Jake Sullivan, reacting to excerpts released early in the day, fumbled awkwardly for an excuse. ISIS grew out of al Qaeda in Iraq, and where did AQI come from? It didnt exist before the invasion, he said. It emerged in no small part as a result of President Bushs failed strategy, and it gained strength by signing up former Sunni military officers, officers from the very army the Bush administration disbanded. Huh?! For starters, Clinton voted for the Iraq war. Moreover, Iraq was essentially peaceful and stable when President George W. Bush left office. It was on her watch that Iraq came apart. Indeed, as Jeb Bushs campaign was quick to point out, Clinton recognized that at least in Syria another failure of the Obama-Clinton policies a vacuum (left by hers truly, by the way) allowed the Islamic State to take hold. Democrats still show no sign they are willing to abandon Clinton. Instead, they seem to be heading into the 2016 election with a deeply flawed candidate schlepping around plenty of baggage the details of which are not yet known. With subpar political skills and lack of preparedness to answer tough questions, Clintons only hope may be a Republican nominee who is so scary and so lacking in credibility that the country will choose her by default. Alas, there are so many qualified and impressive Republicans, the chance that will happen goes down every day. Washington Post, Jennifer Rubin writes the Right Turn blog for The Post, offering reported opinion from a conservative perspective.]", "Date": "20150813", "Author": "[ Jennifer Rubin]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-hillary-clinton-emails-server-20150813-story.html", "Title": "[ Hillary Clinton's problems are only getting worse]"}