{"Content": "[ Promising to fight what he deems \"obscene levels\" of income disparity and a campaign finance system that is a \"real disgrace,\" independent Vermont Sen. Bernie Sanders said Wednesday he will run for president as a Democrat. In an interview with The Associated Press, Sanders confirmed his plans to formally join the race Thursday. The self-described \"democratic socialist\" enters the race as a robust liberal alternative to Hillary Rodham Clinton, and he pledged to do more than simply raise progressive issues or nudge the former secretary of state to the left in a campaign in which she is heavily favored. \"People should not underestimate me,\" Sanders said. \"Ive run outside of the two-party system, defeating Democrats and Republicans, taking on big-money candidates and, you know, I think the message that has resonated in Vermont is a message that can resonate all over this country.\", As he has for months in prospective campaign stops in the early voting states, and throughout his political career, the former mayor of Burlington, Vermont, on Wednesday assailed an economic system that he said has devolved over the past 40 years and eradicated the nations middle class. \"What we have seen is that while the average person is working longer hours for lower wages, we have seen a huge increase in income and wealth inequality, which is now reaching obscene levels,\" Sanders told the AP. Bernie Sanders announced his 2016 candidacy saying, \"This is the debate over major issues facing the American people,\" on April 29, 2015. (WGN TV), Bernie Sanders announced his 2016 candidacy saying, \"This is the debate over major issues facing the American people,\" on April 29, 2015. (WGN TV), \"This is a rigged economy, which works for the rich and the powerful, and is not working for ordinary Americans. ... You know, this country just does not belong to a handful of billionaires.\", The son of an immigrant from Poland who sold paint for a living in Brooklyn, Sanders has for decades championed working-class Americans. He lost several statewide races in the 1970s before he was elected mayor of Burlington in 1981, and went on to represent Vermont in the U.S. House for 16 years before his election to the Senate in 2006. An independent in the Senate, he caucuses with Democrats in Washington and he is likely to attract some interest from voters who have unsuccessfully sought to draft Massachusetts Sen. Elizabeth Warren to join the race. But Sanders rejected the idea his appeal is limited to voters on the left, boldly predicting Wednesday that his message would appeal to both fellow independents and Republicans. Sanders said he would release \"very specific proposals\" to raise taxes on wealthy Americans and corporations, as well as offer tuition-free education at all public colleges and universities. He touched on his past opposition to free-trade agreements, his support for heavier regulations of Wall Street and the nations banking industry, and his vote against the Keystone XL oil pipeline as a preview of his campaign. \"So to me, the question is whose views come closer to representing the vast majority of working people in this country,\" Sanders said. \"And you know what? I think my views do.\", The 73-year-old Sanders starts his campaign as an undisputed underdog against Clinton. Sanders said he has known the former first lady, senator from New York and secretary of state for more than two decades. \"I respect her and like her,\" he said. He noted he has \"never run a negative ad in my life,\" but still drew a distinction with Clinton in the interview, promising to talk \"very strongly about the need not to get involved in perpetual warfare in the Middle East.\", \"I voted against the war in Iraq,\" he said. \"Secretary Clinton voted for it when she was in the Senate.\", Clinton is hosting a series of fundraisers this week, starting what could be an effort that raises more than $1 billion. Sanders said he will make money and politics a central theme of his campaign, including a call for a constitutional amendment to overturn the U.S. Supreme Courts 2010 Citizens United decision, which he blames for unleashing a torrent of money from wealthy donors into politics. \"What youre looking at here is a real disgrace,\" he said. \"It is an undermining of American democracy. \"But can we raise the hundreds of millions of dollars that we need, primarily through small campaign contributions to run a strong campaign? And I have concluded that I think there is a real chance that we can do that.\", Sanders is the first major challenger to enter the race against Clinton, who earlier this month became the first Democrat to formally declare her intention to run for president. He is likely to be joined in the coming months by former Maryland Gov. Martin OMalley, former Virginia Sen. Jim Webb and ex-Rhode Island Gov. Lincoln Chafee. Associated Press]", "Date": "20150429", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-bernie-sanders-president-2016-20150429-story.html", "Title": "[ Sanders confirms 2016 run to fight 'obscene' income disparity]"}