{"Content": "[ Americans must immediately turn their attention to the 2016 presidential election, because time is meaningless, two years is a mere 730 days and its not like we have much else going on anyway. So focus in, people. This is important stuff. As we already know, the 2016 presidential race will pit candidate-to-be-named-later against other-candidate-to-be-named-to-later in an epic (political showdown/blowout) the likes of which weve (never seen/seen many times before). The excitement is non-palpably palpable. Time, which a few paragraphs ago was meaningless, is now of the essence, so Id like to introduce you to some potential Democratic and Republican candidates. The race will undoubtedly involve incessant name-calling, rumor-mongering and scandal-tweeting, so for your convenience Ill present each politician as he or she will likely be characterized by the opposing party. That way the mud comes pre-slung. Its just easier for everyone. Democrats (as seen by Republicans):, Hillary Clinton  A recent Washington Post/ABC News poll showed that Clinton is the only potential candidate from either party who a majority of voters believe might actually make a good president. Thats likely because Clinton bribed the pollsters by offering them lucrative real-estate investment opportunities in Arkansas. Greetings, Republican overlords, and congratulations on your momentous midterm mashing of those pesky Democrats. Tuesdays election was not just a GOP wave, it was a conservative tsunami, a liberal-ectomy, a Rip-Roarin Republican Rampage. It was a repudiation of all things President Barack Obama... Greetings, Republican overlords, and congratulations on your momentous midterm mashing of those pesky Democrats. Tuesdays election was not just a GOP wave, it was a conservative tsunami, a liberal-ectomy, a Rip-Roarin Republican Rampage. It was a repudiation of all things President Barack Obama... Clinton, a distant relative of an unpopular former U.S. president/Lothario, is best known as the mastermind behind the terrorist attack on the American consulate in Benghazi. She is 350 Earth years old and suffers from irreparable brain damage. Elizabeth Warren  This Massachusetts senator, the great-great-great granddaughter of Karl Marx, is a leading advocate for the destruction of America as we know it and a huge fan of laziness. She helped create the Consumer Financial Protection Bureau, a job-crushing watchdog agency that denies bankers and corporations their God-given right to make unlimited amounts of money at the expense of \"regular people,\" aka \"moochers.\", Warren is a former Harvard law professor, an occupation that, according to the Constitution, disqualifies her from being president. She also claims to have Native American ancestry and is likely planning to imprison all white people. Joe Biden  He is best known for being second-in-command to Americas first Muslim dictator. Also, LOL!!!, Its official. I hereby nominate Sarah Palin to be the next president of the United States of America and also Alaska. And why, you ask, have I suddenly thrown my influential support behind this half-term governor and failed vice presidential candidate?, The answer is simple: Money. In case you... Its official. I hereby nominate Sarah Palin to be the next president of the United States of America and also Alaska. And why, you ask, have I suddenly thrown my influential support behind this half-term governor and failed vice presidential candidate?, The answer is simple: Money. In case you... Republicans (as seen by Democrats):, Jeb Bush  This former Florida governor, like his brother and father before him, has hopes of becoming a terrible president who nobody likes. History shows, however, that Americans dont approve of multiple leaders from the same family, unless that familys name is Clinton and theyre wonderful. Jeb Bush is the brother of former President George W. Bush  did we mention that George W. Bush is his brother?  and his last name is Bush. Also, Bush Bush Bush Bush Bush. In high school he was voted Most Likely to Imitate his Brother (George W. Bush) and Invade a Country Under False Pretenses. His last name is Bush. Chris Christie  A former cast member of \"The Sopranos,\" this obstreperous New Jersey governor is best known for lying down on the George Washington Bridge and blocking traffic, resulting in the deaths of 279 people and three kittens. Christie yells a lot, which makes people sad, and would likely bomb the first country whose leader looked at him funny. Some have said his weight might be a concern to voters. Christie responded by devouring those people and washing them down with a barrel of red wine. Ted Cruz  Recently released from the Texas Rehabilitation Center for the Perpetually Loopy, this tea party icon wants to repeal Obamacare, impeach President Barack Obama twice and teach American children that 1 + 1 = tyranny. His hobbies include standing in front of television cameras while random words fall out of his mouth, recreational narcissism and hunting poor people for sport. Should he become president, his stated goals include erecting a 50-foot-tall border fence made of Bibles, eradicating the color blue and cloning himself over and over until he has enough Ted Cruzes to form the Independent Nation of Ted Cruzica. There are others, of course, and they too will be viewed through mud-spattered lenses provided by the opposing party. Whats important is that we all buy into these narratives as early as possible so we can largely ignore the 2016 presidential campaign. After all, we have important things to do. Like start focusing on the 2018 midterms. And the 2020 presidential race. And the inevitable war between the United States of Clinton and the Independent Nation of Ted Cruzica. rhuppke@tribpub.com]", "Date": "20141110", "Author": "[ Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-talk-huppke-2016-presidential-election-20141110-story.html", "Title": "[  Early look at potential 2016 presidential candidates, as seen by the opposing party]"}