{"Content": "[ For Francisco Lopez-Sanchez, the border between the U.S. and Mexico was more like a revolving door. He was deported in 1994, 1997, 1998, 2003 and 2009. He should have been deported again earlier this year, after he finished his third prison sentence for illegal re-entry. Instead, he was turned over to the San Francisco sheriff, who let him go. On July 1, he allegedly shot and killed 32-year-old Kate Steinle as she walked along a pier with her father. What went wrong? Well get to that in a minute. But taking money away from local police departments isnt the way to prevent it from happening again. Thats the solution proposed by Republicans in Congress. They blame Steinles death on San Franciscos sanctuary ordinance, which is meant to shield undocumented immigrants who are otherwise law-abiding from deportation. Last week, the House passed a bill that would strip federal law enforcement grants from jurisdictions with sanctuary policies. Nationwide, more than 300 local governments  including Chicago and Cook County  have such policies. Sanctuary jurisdictions typically dont detain people based on immigration status if they would otherwise qualify for release. A driver whos here illegally doesnt have to worry about being deported over a speeding ticket; an immigrant arrested on suspicion of shoplifting can be released on bail pending a court date. In some places, police arent even allowed to ask whether a person is in the country legally. If you dont recognize the name Juan Francisco Lopez Sanchez, dont worry: You will. Hes not a candidate for president, but before long hell have higher name recognition than Jeb Bush. A felon convicted on several drug charges, the Mexican national had been deported five times but managed to... If you dont recognize the name Juan Francisco Lopez Sanchez, dont worry: You will. Hes not a candidate for president, but before long hell have higher name recognition than Jeb Bush. A felon convicted on several drug charges, the Mexican national had been deported five times but managed to... The reasoning: Public safety suffers when local police are seen as immigration agents. People who fear theyll be deported are less likely to cooperate if they witness a crime, or if theyre victims. Sanctuary policies also spare local taxpayers the expense of arresting and holding people the feds are in no hurry to deport. The point isnt to provide a safe haven for habitual felons like Lopez-Sanchez. \"This man is not an immigrant,\" Rep. Luis Gutierrez, D-Chicago, told a House committee last week. \"Immigrants come here to work hard, sweat and toil. This mans a foreigner who came here to cause damage.\", Lopez-Sanchezs criminal record includes seven drug convictions in the 1990s. When he came back across the border after being deported a third time, he spent nearly five years in prison for illegal re-entry before being deported again. He came back, went to prison, got deported, came back, went to prison , Then, instead of handing him over to immigration authorities to be deported again, federal prison officials sent him to San Francisco to face a 20-year-old marijuana charge. After Trayvon Martin was killed, President Obama spoke emotionally about his death, declaring \"this could have been my son.\", After Michael Brown was killed, Obama promised to ensure that \"justice is done\" and declared: \"We lost a young man, Michael Brown, in heartbreaking and tragic circumstances.... After Trayvon Martin was killed, President Obama spoke emotionally about his death, declaring \"this could have been my son.\", After Michael Brown was killed, Obama promised to ensure that \"justice is done\" and declared: \"We lost a young man, Michael Brown, in heartbreaking and tragic circumstances.... They should have anticipated what would happen next: The local states attorney declined to prosecute such an old case. San Franciscos sanctuary ordinance  in place since 1989  prohibited the sheriff from detaining Lopez-Sanchez without a warrant. The feds say they had asked the sheriff to hang onto him so they could pick him up. But hed done his time. He wasnt wanted for any new crime. So he was released. If immigration officials had gotten a warrant, Lopez-Sanchez would have been held in San Franciscos jail for them to pick up. Or they could have deported him immediately, as they did after each of his other stints in prison. They dropped the ball. Three months later, Steinle was killed. Her death was senseless, tragic and preventable. But Republicans in the U.S. House are pursuing a wrongheaded solution. They want to withhold crime-fighting money from local governments that have sanctuary policies. Passing the bill  they called it \"Kates Law\"  was a chance for them to talk tough about our broken immigration system without actually doing anything about it. The Senate isnt likely to pass the bill. The president has said hed veto it. Heres the truth: There are 11 million undocumented immigrants in the country, and study after study shows they are less likely to commit crimes than the population at large. Our streets are safer when they are able to interact with police freely. Threatening to take money away from local police is a sound bite, not a solution. The real fix is the tough political compromise that the House has been ducking for years: a top-to-bottom overhaul of the immigration system. The Senate passed an excellent bill in 2013, but the House has done nothing. Thats mostly because hard-liners cant stomach the idea of granting legal status to immigrants who came here without visas. The Senate bill would have required those immigrants to pay a fine and any unpaid taxes before they could apply for legal residency. It would not require them to leave. U.S. Rep. Bob Dold of Illinois, one of five Republicans who voted against the House anti-sanctuary bill last week, urged his colleagues to fix the whole system instead. \"Cutting funding for local law enforcement would not have prevented this horrible crime,\" he said of Steinles death. \"We need to focus on reforms that will actually make our country and our community safer.\", Yes, the country needs a secure border. It also needs a fair and orderly system for admitting new immigrants and a flexible visa system so businesses can hire the workers they need. When there are jobs but no visas, the workers will come  legally or not. Thats why we have 11 million undocumented immigrants. Most of them are leading peaceful, productive lives. They are the immigrants the sanctuary laws are intended to protect. Granting legal status to those who qualify would have the same effect. They could go about their lives, while police go about their jobs. Treating them all like criminals makes it all but impossible to sort out the few who are truly dangerous.]", "Date": "20150730", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-immigration-sanctuary-cities-kate-steinle-san-francisco-murder-edit-0731-jm-20150730-story.html", "Title": "[ A misguided crackdown on sanctuary cities]"}