{"Content": "[ Lets start with simple math:, One million dollars a day. Its a startling number. Cook Countys pension reform plan has been stalled in Springfield for almost two years, but the obligations continue to grow. The shortfall stands at more than $6.5 billion and the meter keeps running  to the tune of a $1 million daily. This is irresponsible and unsustainable. It is unfair to current and former Cook County employees who ultimately will qualify for a pension they paid into. It also is unfair to future generations of taxpayers who may be asked to shoulder the bill. We developed the pension reform plan over two years in collaboration with county unions and other stakeholders. It was carefully constructed to meet an inevitable constitutional challenge and it will not cost the state one dime. We cant wait for Springfield to act. We cant keep kicking the can down the road. We cant engage in smoke and mirrors financing schemes. And we have to face the reality that borrowing, and watching pension liabilities grow exponentially, are ways to keep taxes low today but will raise them for our children and grandchildren. Todays leverage is a future generations tax burden. Which brings me to my proposal to raise the countys sales tax by 1 percent. The irony of having to introduce this measure is not lost on me. I campaigned on rolling back the last of the penny sales tax put in place by my predecessor. Times have changed. Back then, the revenue from those pennies did not go to meet growing pension obligations or to retire Cook County debt. And it was not invested in the countys infrastructure. The money was spent to support an operational structure that was bloated and inefficient. The revenue gleaned from my proposed sales tax increase will not be put into operations. During the first year we will devote 90 percent of the new revenue to address the county government worker retirement systems shortfall. During the second year, more than 70 percent will go toward the pension fund. The remaining revenue in both years will be dedicated to the growing inherited debt and ending the unfortunate long-standing practice of diverting the motor fuel tax revenue for purposes other than roads and bridges. We need to once again properly fund infrastructure throughout the county. The property tax bill that just arrived in the mail from Cook Countys treasurer compels you to make good on years of politicians ruinous decisions about public finances: By months end youll pay a lot of money to local governments that let their unfunded pension liabilities overwhelm them. But... The property tax bill that just arrived in the mail from Cook Countys treasurer compels you to make good on years of politicians ruinous decisions about public finances: By months end youll pay a lot of money to local governments that let their unfunded pension liabilities overwhelm them. But... Eliminating my predecessors sales tax hike forced county officials to examine what we do and how we do it. And we found ways to make the county leaner and more efficient. Since I took office we closed budget deficits of $1.4 billion and decreased taxpayer funding of the county health system by $225 million. We reduced the countys head count by 8 percent, eliminating about 2,000 positions. Weve worked hard to make county government more responsive to residents. Rolling back the last of the old sales tax saved Cook County residents $1.4 billion during the last five budget cycles. And were far from finished. As part of the budget for fiscal year 2016, the finance team will identify more than $100 million in cuts. We will examine the necessity of every vacant position; look to slim down our fleet of vehicles; utilize reverse auctions to get the best prices for commodities we purchase; and continue to reduce the countys tax allocation to the health systems operations. I have also made the commitment that if Springfield approves actuarially sound pension reform, I will reassess Cook County revenue needs and reduce the sales tax increase accordingly. To those who say \"Whats the rush?\" my answer is simple. If we do not inform the state of Illinois of our sales tax rate by Oct. 1, the rate change cannot occur until next July 1, pushing the countys first receipts until October 2016. The pension funds shortfall would then grow an additional $270 million of unfunded interest in the coming year. Time literally is money. Our approach of coupling aggressive expense reductions and efficiencies with added revenues is not a quick fix. It is not a stopgap measure to tide us over until the next crisis. We are determined to be honest  with ourselves and with residents  about the real needs that will put Cook County on a path to financial stability. Toni Preckwinkle is president of the Cook County Board.]", "Date": "20150714", "Author": "[ Toni Preckwinkle]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-perspec-toni-preckwinkle-cook-county-sales-tax-board-0715-jm-20150714-story.html", "Title": "[ Toni Preckwinkle op-ed: Why we must raise the sales tax]"}