{"Content": "[ My phone didnt ring even once on Thursday. This may seem a strange thing to report, but as a terrorism analyst I am used to being called when a violent, ideologically motivated attack occurs. So when a 21-year-old white man entered an AME church in Charleston, S.C. and murdered nine African-Americans at a Bible study, according to authorities, I thought some reporter might at least raise the specter of racially motivated terrorism. Nope, no calls. When reports surfaced the next day that the alleged killer had adorned his Facebook page with symbols popular among white supremacists and that he had a reputation for telling racist jokes, I thought, \"Now someone will surely ask me about lone wolf terrorism.\" Again, silence. Then it dawned on me: White Americans dont do terrorism. No, terrorism is something others do to us. It is a weapon used by extremists far from our shores, people with a different religion and skin color, who infiltrate our society to attack us because they hate our way of life. When a true-blue, red-blooded American picks up a gun and shoots a member of Congress because he doesnt like her politics or a young man touting white pride perpetrates a massacre at a black church, commentators rush in to disconnect those individuals from the ideological context in which they act. \"These are just disturbed young men acting out of their own warped worldview, not representatives of something larger and more insidious,\" they argue. Oddly, no one makes that argument for the young Muslim man from Bolingbrook arrested for trying to join ISIS. He cannot possibly have been a confused 19-year-old more in need of rehabilitation than punishment. No, even though he killed no one, he is a terrorist. The first funeral service for victims of the Emanuel AME church massacre took place in North Charleston Thursday, with mourners gathering to remember 70-year-old Ethel Lance, a longtime member of the Emanuel AME church. (AP), The first funeral service for victims of the Emanuel AME church massacre took place in North Charleston Thursday, with mourners gathering to remember 70-year-old Ethel Lance, a longtime member of the Emanuel AME church. (AP), The first funeral service for victims of the Emanuel AME church massacre took place in North Charleston Thursday, with mourners gathering to remember 70-year-old Ethel Lance, a longtime member of the Emanuel AME church. (AP), The first funeral service for victims of the Emanuel AME church massacre took place in North Charleston Thursday, with mourners gathering to remember 70-year-old Ethel Lance, a longtime member of the Emanuel AME church. (AP), Mourners are walking past the open casket of slain state Sen. Clementa Pinckney at the South Carolina Statehouse. Pinckney was one of nine people killed in a church shooting. June 24, 2015. (AP), Mourners are walking past the open casket of slain state Sen. Clementa Pinckney at the South Carolina Statehouse. Pinckney was one of nine people killed in a church shooting. June 24, 2015. (AP), Police in Shelby, North Carolina have released dashcam video June 22, 2015, showing the suspect in last weeks shooting rampage at a Charleston church moments after his arrest. (AP), Police in Shelby, North Carolina have released dashcam video June 22, 2015, showing the suspect in last weeks shooting rampage at a Charleston church moments after his arrest. (AP), South Carolina Gov.Nikki Haley on June 22, 2015, calls for the Confederate flag, originally used as a Civil War battle flag by the seven slave states, to be removed from the Statehouse. (Reuters), South Carolina Gov.Nikki Haley on June 22, 2015, calls for the Confederate flag, originally used as a Civil War battle flag by the seven slave states, to be removed from the Statehouse. (Reuters), Thousands of people marched across Charlestons main bridge in a show of unity after nine black church parishioners were gunned down during a Bible study. (AP), Thousands of people marched across Charlestons main bridge in a show of unity after nine black church parishioners were gunned down during a Bible study. (AP), Of course, Dylann Roof was disturbed. Who in his right mind could do such a horrific thing? That, however, is not the point. Roof allegedly dipped into a deep and bitter well of racism readily available online and still permeating American culture, and it turned his rage to deadly purpose, authorities say. The Southern Poverty Law Center reports that 16 white supremacy and hate organizations operate in South Carolina alone. Nationally, there has been a dramatic increase in such groups since President Barack Obama was elected in 2008. In Texas, the Sons of Confederate Veterans want the right to put the Confederate flag on their license plates. In Selma, Ala. some citizens object to changing the name of a bridge named for a Confederate general and Ku Klux Klan leader. Lest anyone accuse me of bashing the South, I would point out that most of the shootings of unarmed African-American men by police over the past year have occurred in Northern and Midwestern cities. There will always be disturbed people, and as long as they have easy access to guns, they will perpetrate horrible crimes. We can, however, do more to counter the ideology that motivates so much violence. It is time to stop designating racist entities as \"groups\" and call them what they really are: \"domestic terrorist organizations.\" The Stars and Bars (Confederate battle flag) should be recognized not as a symbol of pride in a mythical past but as a symbol of hatred as odious as the swastika. And as the friends of the alleged Charleston shooter now sadly admit, racial and ethnic jokes should not be dismissed as harmless, if a bit off-color, humor. Terrorism and the threat of terrorism permeate racism, and it is time to speak that important truth more forcefully. Thomas R. Mockaitis is a history professor at DePaul University, where he teaches British, modern European and military history. His research and writing cover terrorism, insurgency, counterinsurgency and peace operations.]", "Date": "20150622", "Author": "[ Thomas R. Mockaitis]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-charleston-terrorism-dylann-roof-perspec-0622-20150619-story.html", "Title": "[ The problem with avoiding the 'terrorism' label]"}