{"Content": "[ Barack Obamas critics think he has made two mistakes with the Iranians. The first was reaching a deal on their nuclear program. The second was thinking they would abide by it. Its a mystery why, after allegedly tricking us into giving them everything they wanted, the Iranians would be so eager to evade these easy terms. But thats what the detractors expect. \"I think we have to assume that they will cheat on the deal,\" said Sen. Tom Cotton, R-Ark. Worse yet, theyll get away with it. In this scenario, Iran will renege on one obligation after another, block inspectors and string out every dispute  and the countries that signed the deal will let it slide. \"There will be a series of small, incremental violations like that, that ultimately over time will wear down the enforcement mechanism,\" predicts Sen. Marco Rubio, R-Fla. Lets consider the threat of cheating. One complaint is that the accord allows Iran to delay inspections of some sites for up to 24 days or more, making it easy to clean them up before the inspectors arrive. In fact, it wouldnt be easy, because nuclear materials linger  not for weeks, but for centuries. Back in 2003, when it was suspected of conducting forbidden nuclear experiments at one facility, Iran blocked International Atomic Energy Agency monitors for more than six months. But when inspectors finally got in, they were able to detect telltale residues. The Tribune Editorial Board has expressed skepticism about the Iran nuclear deal. An editorial Sundayclaimed that the deal allows Iran to keep secret some of its earlier nuclear weapons program and hinders full access to nuclear sites by the International Atomic Energy Agency. Unfortunately, the... The Tribune Editorial Board has expressed skepticism about the Iran nuclear deal. An editorial Sundayclaimed that the deal allows Iran to keep secret some of its earlier nuclear weapons program and hinders full access to nuclear sites by the International Atomic Energy Agency. Unfortunately, the... What if Iran were able to cover up something nefarious? A report from the Belfer Center for Science and International Affairs at Harvard notes that under the terms of the deal, even if Iran \"is able to successfully hide and remove evidence, the U.S. (and other governments) could still conclude that Iran was cheating.\" We dont have to prove guilt. Iran has to prove innocence. To opponents of the agreement, none of this matters. Even if we catch the Iranians doing something prohibited, theyll get away with it because no one will have the stomach to challenge them. The theory is that once Iran is open for business, companies in Europe, Russia and China will be making too much money for their governments to interfere. So theyll pretend everything is fine. Guess what? Even if those other countries wimp out, it wont matter. If the IAEA has a dispute with Iran, the issue will go to a commission, representing seven governments (including the U.S.) as well as the European Union. If any of them is not satisfied with Irans conduct, it can send the complaint to the United Nations Security Council. New York Sen. Chuck Schumer, the No. 3 Senate Democrat and next-in-line party leader, said late Thursday that he is breaking with President Barack Obama and will oppose the Iran nuclear deal. \"After deep study, careful thought and considerable soul-searching, I have decided I must oppose the agreement... New York Sen. Chuck Schumer, the No. 3 Senate Democrat and next-in-line party leader, said late Thursday that he is breaking with President Barack Obama and will oppose the Iran nuclear deal. \"After deep study, careful thought and considerable soul-searching, I have decided I must oppose the agreement... Sanctions would \"snap back\" unless the Security Council votes not to restore sanctions  and it takes just one country (say, us) using its veto to prevent that from happening. In practice, the U.S. will hold all the cards. We can impose economic retribution on Iran even if all our negotiating partners object. But take the worst-case scenario. Suppose Iran commits a violation, and our partners devise some ingenious way to block sanctions. Then what? The U.S. would still have the ultimate recourse: military action. Any Republican in the White House would launch airstrikes rather than let Iran renege. And if I were the Iranian government, I wouldnt bet that Hillary Clinton  who voted for the Iraq War and urged Obama to bomb in Libya as well as Syria  would look the other way. Besides, two powerful factors would impel any American president to blow something up. The first is the intense scrutiny any violation would elicit  from the IAEA, Israel, Saudi Arabia, congressional Republicans and the news media. The second is that the president would have no real alternative. If the Iranians violate the deal, they will be informing the world that diplomacy has been a waste of time. Having tried the peaceful route, the president would be under strong pressure to use force  and would have excellent grounds to do so. Here are the facts Iran has to face: Any violations of the deal will be detected and exposed. When that happens, Iran will be hit with the painful economic sanctions it made this deal to escape. Or it will face military action, another outcome this deal was supposed to avert. The critics think if this deal goes through, there will be more cheating in Iran than in a country music playlist. But the Iranians have probably figured out what those country songs attest to: If youre cheating tonight, youll be crying tomorrow. Steve Chapman, a member of the Tribune Editorial Board, blogs at www.chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150812", "Author": "[ Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-iran-nuclear-cheat-sanctions-perspec-0813-20150812-column.html", "Title": "[ What if Iran cheats?]"}