{"Content": "[ Republican Gov. Bruce Rauner on Monday sought to distance himself and a private education group he helps fund from the growing scandal over a $20.5 million no-bid contract at Chicago Public Schools that is under federal investigation. The governors comments were the first since it was disclosed that federal investigators have demanded Chicago Public Schools records related to the Chicago Public Education Fund, a nonprofit education group closely aligned with the education initiatives of both Mayor Rahm Emanuel and Rauner. The scandal has focused on CPS CEO Barbara Byrd-Bennett, who once worked for the Wilmette-based SUPES Academy company that received the no-bid contract to train school principals. The district announced Friday that she is taking a leave of absence. The SUPES training program was launched with seed money from the nonprofit education fund. CPS took over and expanded the program after the first year. The nonprofits CEO confirmed Monday that it had been contacted by federal investigators but also sought to distinguish its initial work from the later years of the program. CEO Heather Y. Anichini also said the fund had not been served with any subpoenas. \"We have been advised that our participation in the recent investigation regarding CPS and SUPES Academy is solely as a witness,\" Anichini said in an emailed statement. \"We continue to cooperate in the ongoing federal investigation. Throughout this process, we remain focused on our commitment to the education of all of Chicagos students and to the educators in our schools.\", Interim CEO says no more no-bid contracts for CPS on April 20, 2015. (CBS Chicago), Interim CEO says no more no-bid contracts for CPS on April 20, 2015. (CBS Chicago), On Monday, Rauner was asked about his views on the role private foundations should play in public education policy, given the federal investigation into the SUPES contract. At first Rauner said the education fund wasnt involved in bringing SUPES to CPS. \"That particular group, which I dont know anything about, was brought in, I believe, by the CEO of the schools. It wasnt brought in by the fund, by the foundation. I dont know,\" Rauner said during an appearance before an education writers group at a River North hotel. When a questioner pointed out that the education fund he was part of was involved with SUPES, Rauner tried another tack. \"My experience with the public education fund has been mostly good. Although I will say this, the fund didnt make many of its own decisions as much as it was a facilitator for what the mayor or the schools or the leadership wanted to do,\" the governor said. \"It was a little bit more of a support group rather than a truly independent group. And that was a source of frustration for me over time.\", Federal corruption investigators looking into a $20.5 million no-bid contract at Chicago Public Schools also have asked for any records related to an elite nonprofit education group that has long been at the center of city school reform efforts  the first indication that the public relations problem... Federal corruption investigators looking into a $20.5 million no-bid contract at Chicago Public Schools also have asked for any records related to an elite nonprofit education group that has long been at the center of city school reform efforts  the first indication that the public relations problem... But records show that Rauner was a key player in the group and that the group played a key role in bringing the executive training program to the public schools. Rauners family foundation gave the Chicago Public Education Fund $500,000 in 2012, according to federal tax records, and Rauner said Monday that he and his wife have given the fund \"many millions of dollars\" over the years. Rauner also was chairman of the nonprofit for a time and said he served on the board for at least 10 years. In 2012, the Chicago Public Education Fund issued a news release saying it provided $380,000 to fund the first year of the SUPES Academy program, which it described as a \"pioneering effort to create the nations first district-based academy for managers of principals.\", The Rauner-connected group also stated that \"following a successful first year supported by The Fund, CPS absorbed the cost\" for the program during the 2012-2013 school year and that CPS \"is further expanding the program during the 2013-2014 school year to become the primary source of support and development for all CPS principals.\", In her statement, the fund CEO said the nonprofit organization has made more than $50 million in grants over the past 15 years, primarily to organizations working with teachers and principals in Chicagos public schools. \"In 2011, our organization made a $380,000 grant to SUPES Academy for a one-year pilot program to train CPS network chiefs and their deputies. Network chiefs are the CPS employees who supervise and manage school principals,\" Anichini said. \"In 2012, following the completion of that pilot program, we declined a request by CPS leadership to provide a second year of funding for SUPES Academy training of principals. The Chicago Public Education Fund, its directors, and its staff have had no involvement with SUPES Academy since 2012.\", The Chicago Public Education Fund is made up of a broad list of the areas most influential politicians and business leaders  all of whom have made restructuring education a top civic priority over the past decade. Many have become key political supporters of Rauner, Emanuel or both. Indeed, Rauner was a board director and is currently a director emeritus. Last week, the governors hand-picked board of education named Tony Smith the states new superintendent of schools. Smith, who has spent most of his career in California, was appointed to the funds board of directors last year and was on Rauners transition team after the November election. Launched in 2000, the group was first led by then-Chicago Tribune Publisher Scott Smith. Rauner joined the board the next year and later was its chairman before becoming an emeritus member of the board, along with future U.S. Commerce Secretary Penny Pritzker, who is a former member of the Chicago school board, and current school board President David Vitale. Others currently on the nonprofit board include Ken Griffin, CEO of Citadel, who has financially backed both Rauners and Emanuels campaigns; Mellody Hobson of the powerful Ariel Investments; Helen Zell, wife of real estate magnate Sam Zell; Susan Crown, a principal of the Chicago investment firm of Henry Crown & Co.; and Beth Swanson, a former top education deputy to Emanuel. \"But the investigation, I hope that the potential wrongdoing that Ive read about didnt occur,\" Rauner said Monday. \"I dont know. But I hope anybody that did wrongdoing gets fully prosecuted.\", Also Monday, Jesse Ruiz, Emanuels choice to lead the school district on an interim basis, said he \"ordered a halt to sole-source contracts\" pending the findings of an independent review of the CPS contracting process. \"It is critical that the district maintain the public trust, and I do not think we can initiate these contracts until we have independent verification that they adhere to the highest ethical standards,\" Ruiz wrote in a memo, adding that he asked school district lawyers to \"prepare options to eliminate the SUPES contract if any wrongdoing is found.\", Emanuel said Ruiz \"did the right thing by ordering both a review of the process, a review of the contract and if anything is found about SUPES, what action is to be taken.\", The mayor was then asked why halting sole-source contracts wasnt done earlier at CPS and whether the mayors office had any role in picking SUPES. \"No, you obviously know that by all the information available. And so the answer to that is no,\" Emanuel said in reference to whether the mayors office was involved in the contract. \"And the second answer is I do support the steps that Jesse has taken immediately, because I think they are the appropriate steps, both as it relates to SUPES particularly and the process in general.\", Chicago Tribunes Hal Dardick contributed. kgeiger@tribpub.com, jchase@tribpub.com, jjperez@tribpub.com]", "Date": "20150420", "Author": "[ Kim Geiger, Juan Perez Jr., John Chase]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-cps-contract-emanuel-rauner-met-0421-20150420-story.html", "Title": "[ Rauner tries to distance himself from CPS contract scandal]"}