{"Content": "[ People are yearning for something different. So a billionaire real estate mogul who moonlighted as a reality TV show host looks pretty good because theres never been a President of the United States quite like him in history. If you dont like Donald Trump or the Republican Party, theres Bernie Sanders running for president in the Democratic Party primaries. A former socialist, Sanders is the anti-Trump. Almost unknown to most Americans when he began his campaign, Sanders is all about increasing the minimum wage, offering free college tuition to everyone, and taxing the rich. Despite the vast philosophical gulf that seems to separate Trump from Sanders, heres what Trump recently said about incredibly high salaries of CEOs in this country. Corporate executives salaries are a \"total and complete joke,\" but theres probably nothing that can be done because boards of directors set those salaries and the typical CEO \"puts in all his friends ... and they get whatever they want, you know, because their friends are sitting on the board.\", Sanders could have said something very similar, although he would likely promise to pass some law that would limit the incomes of CEOs, while vowing to place laborers on the boards of every great company in America. I believe the campaigns of Trump, the Republican Party front runner, and Sanders, a serious threat to the campaign of fellow Democrat Hillary Rodham Clinton, are growing in popularity for the same reason. There is a large segment of the American public thats simply fed up with business as usual in Washington, in political campaigns and in the corporate boardrooms of America. The billionaires whom Bernie Sanders loves to attack founded fabulous businesses that created products and services that enhanced the lives of millions of people. In addition, these businesses have created incredible wealth for millions of people through employment not only at their companies but... The billionaires whom Bernie Sanders loves to attack founded fabulous businesses that created products and services that enhanced the lives of millions of people. In addition, these businesses have created incredible wealth for millions of people through employment not only at their companies but... Trumps popularity, and ability to grab the national spotlight whenever he opens his mouth, baffles traditional Republicans. They claim the guy is a bombastic blowhard who knows nothing about foreign policy, has flip-flopped on major issues of domestic importance (such as national health care and abortion) and wouldnt have a clue how to run the government if elected. His insensitive statements about Mexicans ought to alienate two major voting blocs that will be essential to victory in 2016. The mans hair is a disaster. And every time a former Republican governor, or current U.S. senator blasts Trump for his shortcomings, the billionaire sees another percentage point or two boost in his polls. \"Thats exactly why I like this guy,\" theyre saying. \"Hes not like the rest of you.\", And they dont get it because theyve spent their entire political careers getting to where they are. As for Sanders, hes alienated mainstream Democrats for decades. Theyre simply not liberal enough for him. Unlike Barack Obama, who people have accused of being a socialist, Sanders in his youth was actually a leader in the Socialist Party of Vermont. He alienated his former allies by acting too much like a traditional politician. A wave of criticism from Republicans and Democrats alike rose Thursday after GOP presidential front-runner Donald Trump insulted the physical appearance of his partys only female White House contender. Its a new test for the candidacy of the brash- talking Trump, whose standing in opinion polls... A wave of criticism from Republicans and Democrats alike rose Thursday after GOP presidential front-runner Donald Trump insulted the physical appearance of his partys only female White House contender. Its a new test for the candidacy of the brash- talking Trump, whose standing in opinion polls... Despite his success in the opinion polls, Sanders remains unknown to most Americans. It doesnt seem to matter that he rarely makes the nightly TV news. Thats because Clinton is almost always there and whats being said about her isnt pretty. For months she has said there was nothing wrong with her using her personal cell phone and computer for government business while U.S. secretary of state, but has finally acknowledged that, all right, maybe it wasnt such a good idea. Typical politician. Thats what people think to themselves whenever they see Clinton on the nightly news. And so liberal Democrats who claim to care about things like honesty, find themselves looking for an alternative. And theres Bernie Sanders, a guy so wacky he actually thought Clinton could be beaten while the rest of the Democratic Party establishment decided that her name recognition, fundraising efforts and campaign network had made her unbeatable. Sanders, who looks like the professor in science fiction movies who tries to tell everyone an asteroid is heading to Earth, is suddenly not only the champion of the left-wing of the party, but the only serious choice available to any Democratic voter who simply doesnt like Clinton. Republicans, of course, have plenty of choices. I cant even remember how many candidates are running for the nomination on the GOP side of the ledger, but there are too many to include in any one televised debate. They have a slate of first-string candidates and a slate of second-string candidates and then there is Trump, the only candidate Republican voters actually seem to like. No one can say with any certainty what a President Trump or President Sanders would do if elected to office. Would Trump host a weekly TV show? Im guessing he would. If elected, would his daughter and son end up in his cabinet. As a fan of \"Celebrity Apprentice,\" I believe he trusts their judgment more than any other human being on Earth, but would also simply like to have them sitting next to him at press conferences nodding their heads in agreement. I dont think Trump would build a gigantic wall between Mexico and the U.S. but I do believe he could convince NBC to pick up a show featuring teams of actors, comedians, fashion models and former athletes competing to build sections of such a structure in exchange for $10,000 to their favorite charity. Former Gov. Rod Blagojevich and Jessica Simpson would co-host. As for Sanders, theres almost nothing he would suggest that wouldnt send shivers through the spines of his fellow Democrats. If he suggested dismantling the military, every congressman and senator who represents a state with a military base would oppose him, not to mention every Democratic lawmaker planning to seek re-election. When it comes to the Middle East, Sanders believes the nations of the Middle East ought to solve their own problems and become more actively involved. He says Islamic State (aka ISIS) is a grave threat, but says the U.S. ought not to be seen as leading the war against it because it will look like the Christians vs. the Muslims and we would lose. He notes Saudi Arabia is the fourth largest defense spender in the world, bigger than the United Kingdom and France, that the royal family had billions of dollars it could spend and wonders why they theyre not using their military resources to defeat the terrorist threat. Traditional Democrats, who know the Saudis fund many of the terrorist operations throughout the world, just to stay on their friendly side, would never say anything like that. It would be like saying that members of the Saudi royal family were allowed to fly out of the United States after 9-11 when all other flights were grounded, despite the fact that American intelligence agencies wanted to question them. Im not sure the people supporting Trump or Sanders even want the same things as those two candidates. But they do want something different. The two candidates who sound the most different right now are Trump and Sanders. And the thing I like about their campaigns is that theyre really ruining the plans of all the people who traditionally make the decisions about who ought to run and who ought to win and how the country ought to be governed. Anything that makes life uncomfortable for those people makes me happy. pkadner@tribpub.com]", "Date": "20150914", "Author": "[ Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-trump-sanders-st-0915-20150914-story.html", "Title": "[ Kadner: Trump and Sanders make life difficult for kingmakers]"}