{"Content": "[ Niles Township High School District 219s superintendent and assistant superintendent for operations are on paid leave after a special meeting, the board announced late Monday night in an email. Superintendent Nanciann Gatta and Assistant Superintendent for Operations/Chief Legal Officer John Heintz have both \"agreed\" to take leave until further notice \"due to differences,\" between Gatta, Heintz and the board, the email states. Sent by Jim Szczepaniak, the districts director of strategic partnerships and community relations, the email saysthe board has also hired a forensic information technology consulting firm, 4Discovery; an accounting firm, Sikich LLC; a law firm, Franczek Radelet; and a separate law firm, Mayer Brown, the latter of which for \"legal counsel to assist the board in review of particular employment-related matters.\", According to 4Discoverys website, the company has \"broad experience in performing computer forensics investigations, responding to cyber incidents and the recovery and analysis of electronically stored information. We have performed hundreds of cases in a variety of high-stakes matters for over a decade.\", Due to the \"confidential issues involved,\" the board, Gatta and Heintz are \"not in a position to provide any additional information or comment at this time,\" the email says. While Gatta is on leave, Assistant Superintendent for Curriculum & Instruction Anne Roloff will assume responsibility for the day-to-day operations of the district, the email says. \"Tomorrow is our first day of the new school year, and our top priority is welcoming back our students, who are ready and eager to learn,\" Board President Mark Sproat said in the email. \"Our excellent professional teachers and staff are focused on one thing: providing a challenging and engaging academic environment for all of our students.\", A new board member has been appointed by the Niles Township School District 219 board to fill a vacancy left by former longtime board president Robert Silverman, who resigned in June, two years before his term expired. The school board has selected Skokie resident Joseph S. Nowik, an executive... A new board member has been appointed by the Niles Township School District 219 board to fill a vacancy left by former longtime board president Robert Silverman, who resigned in June, two years before his term expired. The school board has selected Skokie resident Joseph S. Nowik, an executive... rray@pioneerlocal.com, Twitter @iamrichardray]", "Date": "20150811", "Author": "[ Richard Ray]", "Link": "http://www.chicagotribune.com/suburbs/skokie/news/ct-skr-district-219-gatta-heintz-tl-0813-20150810-story.html", "Title": "[ District 219 School Board: 2 top officials on paid leave ]"}