{"Content": "[ The Iranian-American reporter for the Washington Post detained in Tehran for more than a year on charges including espionage spoke in his own defense Monday during a final closed-door hearing in a trial that has been criticized by the paper and press freedom advocates. A verdict in journalist Jason Rezaians case could come as early as next week, said his lawyer, Leila Ahsan. She told The Associated Press she submitted a 20-page defense brief at the start of Mondays session, gave an oral defense during the hearing, and provided the court with a separate written statement at the end following remarks from the prosecutor. Ahsan confirmed that Rezaian also addressed the court during the hearing, which she said was the last in the case. She declined to provide details, citing confidentiality rules surrounding the trial. Rezaians mother, Mary, appeared at the courthouse with her sons wife and fellow journalist, Yeganeh Salehi, though they were not allowed inside the courtroom as in past hearings. She repeated her familys and the Posts position that Rezaian is innocent, telling reporters he is a victim of the hostility between Iran and the United States that dates back to the 1979 Islamic Revolution. The case has been playing out as Iran negotiated with the U.S. and other world powers to reach a landmark deal that gives the Islamic Republic relief from crippling sanctions in exchange for curbs on its nuclear program aimed at preventing it from building an atomic bomb. The Obama administration is now trying to secure congressional support for the agreement, which faces resistance in the U.S. and from hard-liners in Iran. U.S. officials have pressed for the release of Rezaian and other Americans detained in Iran. Washington has joined the Post, Rezaians family and media freedom groups in criticizing the charges against Rezaian and his detention in Tehrans Evin Prison. Tehran (AFP) - The trial of Washington Post reporter Jason Rezaian resumed Monday in Tehran, in what could be the final hearing before a judgment is issued on whether he spied on Iran. Tehran (AFP) - The trial of Washington Post reporter Jason Rezaian resumed Monday in Tehran, in what could be the final hearing before a judgment is issued on whether he spied on Iran. \"He is paying the price of the suspicion, the animosity and the paranoia between the two countries,\" Mary Rezaian said. Jason Rezaian, 39, was born and spent most of his life in the United States, and holds American and Iranian citizenship. Iran does not recognize dual nationalities for its citizens. His trial is being held in the Revolutionary Court, which typically hears cases involving national security and other sensitive issues. The judge in the case, Abolghassem Salavati, is known as for his tough sentences and has heard other politically charged cases, including those of protesters arrested in connection with demonstrations that followed the 2009 presidential elections. Rezaian, Salehi, and two photojournalists were detained on July 22, 2014, in Tehran. All were later released except Rezaian, who according to the Post faces up to 10 to 20 years in prison if convicted on charges that include espionage and distributing propaganda against the Islamic Republic. A letter a detained Washington Post journalist wrote to U.S. President Barack Obama and a trip he made to the U.S. Consulate in Dubai have become major topics of his espionage trial in Iran. Jason Rezaian, the Posts 39-year-old bureau chief in Tehran, is being tried in a Revolutionary Court on... A letter a detained Washington Post journalist wrote to U.S. President Barack Obama and a trip he made to the U.S. Consulate in Dubai have become major topics of his espionage trial in Iran. Jason Rezaian, the Posts 39-year-old bureau chief in Tehran, is being tried in a Revolutionary Court on... The Posts executive editor, Martin Baron, said the court has provided no official word of when it might announce a verdict and \"it remains unclear even to Jasons lawyer what might happen next.\" He called the trial a \"sham.\", \"The process has been anything but transparent and just, and that pattern persists. The only thing that is clear is Jasons innocence,\" Baron said in a statement. \"Now is the time for Irans senior leaders to end this judicial process, with its sick brew of farce and tragedy,\" he added. \"Jason and his wife ... deserve to be exonerated and to be given back their freedom and lives.\", Rezaians brother, Ali, issued a family statement, saying Jason \"has been held for more than a year  three times longer than any Western journalist ever held in Iran.\", \"My brothers life has been cruelly interrupted for over a year for crimes he did not commit. His unlawful detention has carried on for far too long and he deserves to be vindicated and set free without further delay,\" Ali Rezaian added. In a statement, Ahsan said she strongly rejected in the courtroom \"the contention that there is secret evidence only shared with the judge and prosecution.\", \"There is no evidence that would support the charges against Jason,\" she added. \"I expect nothing but his full acquittal.\", Earlier, Ahsan said she expects Salehi, a journalist for The National newspaper in Abu Dhabi, to face trial at some point after Rezaians case is decided, though no court date has been set. Ahsan also serves as Salehis defense lawyer. Rezaians mother objected to his long detention and the repeated delays of the trial. She called on authorities to release details about the charges her son faces and the tapes from the trial itself, \"so that the Iranian people and the American people can see if Jason really did harm to Iran or not.\", She said her son was lonely and exhausted. \"He is very tired. He is very isolated. They do not have him with other people that he can speak with (in) the same languages, English, Farsi, and so he is very isolated,\" she said. Under Irans penal code, Rezaian should have been allowed out of detention in July, by the first anniversary of his arrest, she said. The Post last month filed a petition with the United Nations Human Rights Councils Working Group on Arbitrary Detentions that is aimed at pressuring Iran to release Rezaian. Haleh Esfandiari, an Iranian-American dual national who was detained by Iranian security authorities in 2007, said moderate President Hassan Rouhanis government is likely pressing the judiciary behind-the-scenes to release Rezaian given how contentious the case has become. Rouhani told reporters in June he is following the case and committed to pursuing the legal rights of all Iranians, including those with other nationalities. Esfandiari, who now directs the Middle East program at the Woodrow Wilson International Center for Scholars, cautioned, though, that the Iranian \"judiciary doesnt like to be pushed around or manipulated.\", Iranian officials insist the judiciary is independent and say no one is authorized to intervene in judges decisions. A guilty verdict might still allow Rezaian to be let out of prison, perhaps with a sentence of time served or on bail pending appeal, Esfandiari said. There is also the possibility that Rezaian could seek a pardon directly from Supreme Leader Ayatollah Ali Khamenei, who holds the final say in the Islamic Republic, though the outcome is far from certain. \"I think there has been a tug of war between the government and the judiciary and the security institutions that arrested him,\" she said. \"But if the supreme leader wanted to get invovled, all he had to do was tell these people in the judiciary to expedite this and dont drag it out.\", Associated Press]", "Date": "20150810", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-washington-post-reporter-held-in-iran-20150810-story.html", "Title": "[ Trial wraps up for Washington Post reporter held in Iran, could get verdict soon]"}