{"Content": "[ Pitching himself as a \"doer\" in a field of talkers, Louisiana Gov. Bobby Jindal declared his candidacy for the 2016 Republican presidential nomination Wednesday and set about trying to distinguish himself from better known rivals. Its a long-shot effort for an accomplished but overshadowed governor, and his prospects will depend in large measure on his continued courtship of evangelical voters. But several other contenders also are determined to win over that group. \"We have a bunch of great talkers running for president,\" Jindal said at his opening rally. \"Weve had enough of talkers. Its time for a doer. Im not running for president to be somebody. Im running for president to do something.\", An Oxford-educated son of Indian immigrants, Jindal can point to a political career filled with many achievements in a short time: a position as state health secretary when he was merely age 24, election to Congress at 32 and election as governor four years later. But the GOP lineup does not lack seasoned politicians, some with much more star power. Jindal quickly struck at one of them, accusing former Florida Gov. Jeb Bush of wanting Republicans to \"hide our conservative ideals.\", \"But the truth is if we go down that road again, we will lose again,\" Jindal said. Jindal announced his campaign online earlier Wednesday. Video clips on his website showed Jindal and his wife, Supriya, talking to their three children about the campaign to come. Aides discussed Jindals plans to focus on social conservatives, as he has done for months in extensive travels, and highlight his reputation as a leader steeped in policy. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. Jindal intends to present himself as \"the youngest candidate with the longest resume,\" citing an extensive background in public policy and government, strategist Curt Anderson said. In his speech, the Louisiana governor sought to position himself as an outsider: \"I am running for president without permission from headquarters in Washington, D.C.\", Unpopular at home, Jindal waited until the state legislative session had ended and lawmakers found a way to close a $1.6 billion budget gap before he scheduled his presidential announcement. But he has been building his campaign for months with trips to key presidential voting states, particularly Iowa, where he has focused on Christian conservatives. Raised a Hindu but a convert to Catholicism as a teenager, Jindal is competing for the evangelical vote with several contenders, including Texas Sen. Ted Cruz and former Arkansas Gov. Mike Huckabee. While Jindal will continue to focus on \"religious liberty,\" Anderson said, he aims to prove a candidate can be \"both smart and Christian.\" And in recent weeks, Jindal has worked to showcase more of the policy wonk reputation that got him elected governor, rather than just focusing on cultural issues. He has drawn distinctions from other GOP contenders by noting he has published \"detailed plans\" on health care, defense, education and energy policy. He has suggested governors are better equipped to become president because they have run state governments, balanced budgets and implemented policy. Thats an argument, however, that other White House hopefuls are making or can: Govs. Scott Walker of Wisconsin, Chris Christie of New Jersey and John Kasich of Ohio. And Jindal doesnt get glowing reviews of his governance at home, as both Republicans and Democrats blame the governors financial policies for causing repeated budget crises and suggest those policies are driven by political ambitions. As the governor spoke inside, anti-Jindal protesters amassed outside. Christopher Williams, a University of New Orleans student who called for the protest on a Facebook page, said participants had a variety of beefs with Jindal, such as his tax policy, education cuts and opposition to gay marriage. \"One thing that the governor has been able to do is unite people against him,\" Williams said. A path to a GOP primary victory remains difficult for Jindal. Republican candidate debates begin in August and its unclear if he will make the cut if based on standing in national polls. Campaign manager Timmy Teepell, a former chief of staff who ran Jindals two races for governor, said Jindal will focus on the states that vote early in the presidential race, not a \"national campaign.\" Jindal has trips planned to New Hampshire and Iowa later this week. Associated Press]", "Date": "20150624", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-bobby-jindal-announcement-20150624-story.html", "Title": "[ Bobby Jindal running for president: Enough 'talkers,' 'time for a doer']"}