{"Content": "[ University of Chicago Medicine will start construction early next month on its Orland Park outpatient clinic and have it open for business at 143rd Street and LaGrange Road by the end of 2016. Thats the timetable cited by U of C officials following approval Monday night of a ground lease between the university and the village for land in the downtown redevelopment area known as the Main Street Triangle. The agreement also commits the village to complete work on a parking lot and 513-space garage within that time frame, although U of C is paying for most of the cost of the garage. The U of C will build a 110,000-square-foot medical clinic at the northwest corner of the major intersection, paying the village $18.1 million over the 25-year term of the lease and taking ownership of the land after that. The universitys investment in the project is more than $65 million. When its finished, the clinic will bookend the Ninety 7 Fifty on the Park apartment building at 143rd Street and Ravinia Avenue, and a consultant is working with national restaurant chains and specialty retailers interested in locating in the Triangle. By Oct. 1, 2016, the village is required to finish a 207-space parking lot that will be north of the outpatient clinic and is to finish the garage by the end of 2016. Work on the garage will start this fall. Ending more than two years of negotiations, the agreement anticipates the village spending about $8.6 million on infrastructure, including a bit more than $1 million on the parking lot and $2.6 million for the garage, with U of C contributing $10.6 million toward the garage. Midlothian corner to feature more than weeds, A long-vacant corner at a busy intersection in Midlothian will finally be redeveloped into a gas station, car wash and strip mall. A long-vacant corner at a major intersection in Midlothian will finally be redeveloped next year. The village has entered... Midlothian corner to feature more than weeds, A long-vacant corner at a busy intersection in Midlothian will finally be redeveloped into a gas station, car wash and strip mall. A long-vacant corner at a major intersection in Midlothian will finally be redeveloped next year. The village has entered... Orland Park also will spend $1 million to construct the shell of a planned restaurant as well as extend Jefferson Avenue north to 142nd Street. Sept. 1 is when U of C gets access to the site and will begin construction immediately, according to Marco Capicchioni, vice president of facilities planning, design and construction for the university. He said the clinic will be operating by the end of next year. Currently, Orland Park has $2.8 million budgeted for infrastructure work in the Triangle and will have to address the extra cost in upcoming discussions on the 2016 village budget, Village Manager Paul Grimes said following Monday nights vote. The expenditures will take place in a narrower window than village officials initially expected, he said. \"We always knew the costs would have to be borne\" by the village but anticipated them being spread \"over two or three fiscal years,\" he said. Grimes said that its possible the village could adjust next years budget to cover the costs or could borrow the money. \"We borrowed for much of the infrastructure that is there (Triangle) now,\" he said. The surface parking lot will be used by the medical clinic but will be available for public parking on nights and weekends, and the publicly owned parking deck will have spaces on the top two floors for U of C employees. Grimes said some safeguards will be put in place to bar Metra riders from avoiding the 143rd Street stations pay lot and parking in the garage. The garage will actually span the extension of Jefferson Avenue, and original plans called for having it underground, but soil issues forced a change. Village officials estimate that the agreement with U of C will generate nearly $30 million in revenue for Orland Park over 25 years. Much of that will come from the lease payments as well as sales tax revenue generated by a CVS pharmacy on the ground level of the clinic and a proposed restaurant north of the parking garage. Having the parking situation firmed up is a \"critical component\" in securing other tenants in the Triangle, said Tim Blum, who was hired by the village to market the property. He said there are \"about a half-dozen\" national restaurant chains hes talking with about taking the building the village will construct, and that whichever is selected will be \"high end\" and \"best-in-class.\", Blum, who played a key role in redeveloping the once-moribund indoor mall into Orland Park Place mall, said upscale \"specialty\" retailers that dont have a presence in Orland Park could also be tenants within the Triangle. Mayor Dan McLaughlin said he hears from residents about how redevelopment of the Triangle property has been progressing too slowly. He said \"we could sell that property in a New York minute\" to a developer who would put a big-box store or strip mall there, but that village officials are being methodical in who it wants to see occupy the prime real estate. mnolan@tribpub.com]", "Date": "20150818", "Author": "[ Mike Nolan]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-orland-triangle-lease-st-0819-20150818-story.html", "Title": "[ More of Orland Park 'Triangle' taking shape]"}