{"Content": "[ Before Hillary Clinton had even made her presidential run official, some unlikely allies began campaigning for her. At the National Rifle Associations annual convention Friday, Wayne LaPierre, the organizations executive vice president said: \"Hillary Rodham Clinton will bring a permanent darkness of deceit and despair, forced upon the American people to endure.\", This is the same Wayne LaPierre who spent the past six years warning that President Barack Obama would transform the nation into a gun-less, unrecognizable hell-state rife with rampaging bands of terrorists and \"knockout gamers.\", Even if you dont like Obama, its clear that prophecy was a bit off. The gun industry has cleaned up during the Obama years, which is probably why LaPierre so badly wants Clinton to win. Yes, I realize predicting \"a permanent darkness of deceit and despair\" is an unorthodox endorsement. But the more craziness Clintons so-called detractors spout the better her chances of becoming commander-in-chief. GOP presidential candidate Ted Cruz also spoke at the NRA conference and uttered this gem: \"If Hillary Clinton is going to join with Barack Obama and the gun grabbers and come after our guns, then what I say is, Come and take it. \", My first response was: \"OK, Ted, hows tomorrow around noon-ish sound?\", My second response was: \"Ted, that should technically be, Come and take them. \", Third, and most important, was: Gun grabbers? Nobody has had their guns grabbed. Gun sales have gone through the roof since Obama was first elected, mainly because people like LaPierre have done such a good job making NRA members think the president will be popping by momentarily to grab their guns. These comments from LaPierre and Cruz, coming before Clintons Sunday campaign announcement, are emblematic of a swath of the Republican Party that has been locked in crazy mode for so long it may have forgotten what sanity sounds like. That, without question, bodes well for Clinton, but not for our democracy. The former secretary of state undoubtedly has the qualifications to become president, but she also has the baggage that comes with the Clinton name and an array of issues that Americans should rightfully hear her address. Issues including the highly dodgy disposal of email from her time as secretary of state, her close ties to financial industry executives and the international fundraising conducted by her familys charitable organization, the Clinton Foundation. As expected, Hillary Clinton will formally announce on Sunday her plan to guarantee Fox News another eight years of excellent ratings. Or, as some people call it, run for president. While its possible another Democrat will rise up and challenge Clinton in the primaries, most consider the former... As expected, Hillary Clinton will formally announce on Sunday her plan to guarantee Fox News another eight years of excellent ratings. Or, as some people call it, run for president. While its possible another Democrat will rise up and challenge Clinton in the primaries, most consider the former... My concern is this: If GOP rabble-rousers cant temper their over-the-top rhetoric, Clinton will coast to the presidency without addressing serious questions because shell seem like the only non-crazy option. Thats likely why she launched her campaign with a mundane video that devoted a minute-and-a-half to \"everyday Americans\" and about 30 seconds to Clinton saying, \"Im running for president.\" Shes now off to smaller campaign events in Iowa and other states, keeping things low key. Which may be all she needs to do. Americans have listened to years of far-right rants about Obama destroying the very fabric of the nation and driving us all to ruin, and Id guess most are more than a little sick of the nonsense. Its one thing to have differing views on economic or foreign policy. Its another thing to scream \"TYRANNY!\" at the top of your lungs every time Obama speaks. That makes \"everyday Americans\" roll their eyes and say, \"OK, Im going to go on about my business here and leave you to your conspiratorial clucking.\", Consider this: A recent CNN/ORC International poll found that 51 percent of respondents consider Clintons use of a personal email address and home-based server while she was secretary of state to be \"very serious\" or \"somewhat serious.\", There are, indeed, serious questions to be asked. But on the same day Clinton announced her candidacy, former Republican Sen. Rick Santorum tweeted a link to a video about the email scandal that features clips of ISIS soldiers and the sound of gunshots punctuating a voiceover claiming Clinton has \"placed America in even greater peril in an already dangerous world.\", Ease up on the drama throttle, Santorum. Clinton wasnt sending e-vites asking ISIS members to attend her Fourth of July barbecue. If you take a serious issue and go full-crazy on it, you make it seem less serious. The Republican Party has people like former Florida Gov. Jeb Bush and Sen. Marco Rubio, who declared his candidacy Monday, who have been reluctant to cave to the zany fervor that Obamas presidency has drawn out of the GOP base. If someone sensible can prevail in the primaries and set a tone thats at least a few notches below apocalyptic  and if the Democrats can contain their own crazies  we might have a presidential campaign thats reasoned, and that tests both candidates. But if Clintons opponents decide the only path to the White House leads through the Land of Loopy Hyperbole, shell just sit back and let them repeatedly shoot themselves in the foot until all that remains are angry, legless Republican torsos. And if the ballot offers \"Hillary Clinton\" or \"angry, legless Republican torso,\" American voters wont have a difficult decision to make. rhuppke@tribpub.com]", "Date": "20150413", "Author": "[ Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-talk-huppke-hillary-clinton-20150413-story.html", "Title": "[ Hillary Clinton will coast if opponents go to Crazy Town]"}