{"Content": "[ The Republican-controlled Congress is taking up the cause, once again, of defunding Planned Parenthood. This latest effort comes in response to macabre hidden-camera videos shot by the Center for Medical Progress of staff at Planned Parenthood talking about the grisly practice of chopping up fetuses for parts. Theres a debate over whether the videos prove the centers claim that Planned Parenthood is ghoulishly trying to make a profit selling baby lungs, livers and hearts.  Theres less of a debate that the videos speak directly to the ugly nature of second-trimester abortions. Granted, a few extremists see nothing wrong in the talk of cleverly \"crushing\" babies to preserve the quality of the organs for sale or \"compensation\" to medical researchers. A writer for Slate says: \"The graphic images of aborted fetuses are meant to disgust me, to convince me that abortion is a barbaric act of killing. But I dont see death in these videos. I see hope.\",  Washington Post columnist Ruth Marcus had a much more human and, I think, common response. Marcus, who is pro-abortion rights, says of the abattoir shoptalk recorded by the Center for Medical Progress, \"If you hear this and fail to squirm, there is something wrong with you.\",  Acknowledging that the reality of what happens at Planned Parenthood makes us squirm is a useful place to start.  Thats because the abortion lobby, abetted by many in the media, employs the rhetorical camouflage of medical euphemisms so that people are insulated from the deeply disturbing realities of late-term abortion. When a pregnant woman wants to keep her baby, its a baby; when she doesnt, it becomes mere \"uterine contents.\" Media reports on the video controversy routinely refer to \"tissue\" instead of \"organs,\" even though medically these are different things. Why? Because when we hear about organs hearts, lungs, brains we know these are features of human bodies, not abstract \"uterine contents.\", About half of all pregnancies in the United States are unintended. And, excluding miscarriages, about 40 percent of those accidental pregnancies end in an abortion. This results in about 1 million abortions a year, according to recent statistics assembled by the Guttmacher Institute. Each one is... About half of all pregnancies in the United States are unintended. And, excluding miscarriages, about 40 percent of those accidental pregnancies end in an abortion. This results in about 1 million abortions a year, according to recent statistics assembled by the Guttmacher Institute. Each one is...  Applying different words does not change a wombs contents. To suggest otherwise confuses science with magic.  Theres a second point to be made about the squirming. Perhaps it offers a different way to think about abortion.  So much political discourse these days is driven by a desire even a right to be protected from ideas and images that offend. The examples from campus \"trigger warnings\" to the purging of the Confederate flag from public life are too lengthy to list here. We live in an era in which feelings come first.  And though I think this often goes too far, its worth remembering that feelings really do matter in a democracy. It was Thomas Jefferson who wrote, \"To compel a man to furnish contributions of money for the propagation of opinions which he disbelieves and abhors is sinful and tyrannical.\",  It was at least partly on these Jeffersonian grounds that proponents of removing the Confederate flag from South Carolinas statehouse grounds won their argument. The statehouse belongs to everyone, and forcing those who abhor that flag to pay for it, even symbolically and even if many of its supporters meant no offense, is still sinful. Planned Parenthood has been a trusted nonprofit provider of womens health care for nearly a century. Each year, 2.7 million people come to our health centers for high-quality, nonjudgmental, compassionate care. Since our very beginning, our health centers, providers and patients have come under... Planned Parenthood has been a trusted nonprofit provider of womens health care for nearly a century. Each year, 2.7 million people come to our health centers for high-quality, nonjudgmental, compassionate care. Since our very beginning, our health centers, providers and patients have come under...  Well, if you dont believe that a fetus with arms, legs, a face and a brain is an actual human life worthy of protecting, or at least deserving of a level of respect greater than a hangnail, its doubtful anyone will ever persuade you otherwise.  But maybe you can still accept that other people disagree with you. Abortion is not simply a symbolic act, but perhaps it would help to see it as one. And, if you can muster that much imagination, maybe you can also understand why those truly offended by the practice dont want their tax dollars subsidizing it.  Yes, yes, weve all heard that no federal dollars go to Planned Parenthood for abortions. But this is an accounting fiction drafted to do the work of a moral distinction. If the federal government were funding churches or businesses that opposed gay marriage or sold Confederate flags its doubtful liberal critics would credit such defenses.  Defunding Planned Parenthood is not the same as repealing the right to abortion. Indeed, the point here isnt to say that all abortions are indefensible. Rather, its that people who think they are indefensible shouldnt be compelled to pay for them. Tribune Content Agency, Jonah Goldberg is a fellow at the American Enterprise Institute and a senior editor of National Review. You can write to him in care of this newspaper or by e-mail at goldbergcolumn@gmail.com, or via Twitter @JonahNRO.]", "Date": "20150805", "Author": "[ Jonah Goldberg]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-planned-parenthood-abortion-funding-20150805-column.html", "Title": "[ Defunding Planned Parenthood not the same as repealing the right to abortion]"}