{"Content": "[ Rand Paul lashed out Saturday at military hawks in the Republican Party in a clash over foreign policy dividing the packed GOP presidential field. Paul, a first-term senator from Kentucky who favors a smaller U.S. footprint in the world, said that some of his Republican colleagues would do more harm in international affairs than would leading Democrat Hillary Rodham Clinton. \"The other Republicans will criticize the president and Hillary Clinton for their foreign policy, but they would just have done the same thing  just 10 times over,\" Paul said on the closing day of a New Hampshire GOP conference that brought about 20 presidential prospects to the first-in-the-nation primary state. \"Theres a group of folks in our party who would have troops in six countries right now, maybe more,\" Paul said. Foreign policy looms large in the presidential race as the U.S. struggles to resolve diplomatic and military conflicts across the globe. The GOP presidential class regularly rails against President Barack Obamas leadership on the world stage, yet some would-be contenders have yet to articulate their own positions, while others offered sharply different visions. Former Florida Gov. Jeb Bush, whose brother, President George W. Bush, authorized the 2003 invasion of Iraq, declined to say whether he would have done anything different then. Yet Jeb Bush acknowledged a shift in his party against new military action abroad. When it comes to attending a gay wedding, not all presidential aspirants say I do. It sounded at first like a simple, if unusual, question to ask a potential leader of the free world: Would you go to a same-sex wedding?, But it is fast becoming a kind of conservative litmus test for potential... When it comes to attending a gay wedding, not all presidential aspirants say I do. It sounded at first like a simple, if unusual, question to ask a potential leader of the free world: Would you go to a same-sex wedding?, But it is fast becoming a kind of conservative litmus test for potential... \"Our enemies need to fear us, a little bit, just enough for them to deter the actions that create insecurity,\" Bush said earlier in the conference. He said restoring alliances \"that will create less likelihood of Americas boots on the ground has to be the priority, the first priority of the next president.\", The GOPs hawks were well represented at the event, led by Florida Sen. Marco Rubio and Wisconsin Gov. Scott Walker, who has limited foreign policy experience but articulated a muscular vision during his Saturday keynote address. Walker said the threats posed by radical Islamic terrorism wont be handled simply with \"a couple bombings.\", \"Were not going to wait till they bring the fight to us,\" Walker said. \"Were going to bring the fight to them and fight on their soil.\", South Carolina Sen. Lindsey Graham addressed the question of putting U.S. troops directly in the battle against the Islamic State group militants by saying there is only one way to defeat the militants: \"You go over there and you fight them so they dont come here.\", Scott Walkers expected campaign for the White House got a boost Thursday as his former campaign managers formed a political group able to raise and spend unlimited amounts of money. Two former campaign managers for the Republican governor of Wisconsin said Thursday they have formed a super PAC... Scott Walkers expected campaign for the White House got a boost Thursday as his former campaign managers formed a political group able to raise and spend unlimited amounts of money. Two former campaign managers for the Republican governor of Wisconsin said Thursday they have formed a super PAC... Texas Sen. Ted Cruz suggested an aggressive approach as well. \"The way to defeat ISIS is a simple and clear military objective,\" he said. \"We will destroy them.\", Businesswoman Carly Fiorina offered a similar outlook. \"The world is a more dangerous and more tragic place when America is not leading. And America has not led for quite some time,\" she said. There were few specifics offered in the conference, which came as several presidential candidates accelerate their political operations. Clinton began her campaign last week, and the emphasis on foreign affairs suggests her time as secretary of state will play prominently in the contest. Paul didnt totally reject the use of military force, noting that he recently introduced a declaration of war against the Islamic State group. But in an interview with The Associated Press, he emphasized the importance of diplomacy. He singled out Russia and China, which have complicated relationships with the U.S. as countries that could contribute to U.S. foreign policy interests. \"I think the Russians and the Chinese have great potential to help make the world a better place,\" he said. \"I dont say that naively that theyre going to, but they have the potential to.\", Paul suggested the Russians could help by getting Syrian President Bashar Assad to leave power. \"Maybe he goes to Russia,\" Paul said. Despite tensions with the U.S. Russia and China negotiated alongside Washington in nuclear talks with Iran. Paul has said he is keeping an open mind about the nuclear negotiations. \"The people who already are very skeptical, very doubtful, may not like the president for partisan reasons,\" he said, and \"just may want war instead of negotiations.\", Associated Press]", "Date": "20150418", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-republicans-new-hampshire-20150418-story.html", "Title": "[ GOP White House hopefuls bicker over America's role in world ]"}