{"Content": "[ At Chicago Theological Seminary, a big brouhaha has come in 1,600 tiny packages. Rather than hand out souvenir buttons or bumper stickers at events this summer, students and faculty from the United Church of Christ seminary handed out FDA-approved premium latex condoms and a message. \"Take Two (for the second coming!)\", Was the slogan a lewd play on words? \"Thats a choice people could make,\" said the Rev. Alice Hunt, president of the Hyde Park seminary. But she acknowledges that the tchotchkes, which were intended to symbolize support for marriage equality, rubbed some people the wrong way. \"It was done with a little humor that not everyone appreciated,\" she said. \"We believe that Christs message is always about love and inclusion.\", \"Theres a lot of angst about the same-sex marriage issues, particularly in certain communities,\" she added. As word of the condoms spread online, it prompted a social media backlash from conservative Christian pundits, who called the campaign immoral and argued that it didnt accurately reflect the Christian point of view. \"The majority of people who identify as Christians are not Bible-believing Christians,\" said Bethany Blankley, a conservative evangelical radio host whose column has popped up on a number of conservative news sites. \"For a Christian to make any kind of foul joke about the Second Coming of Jesus Christ  is beyond disgusting.\", Neighborhood groups met with police and city officials last week to discuss the future of the citys annual Pride Parade, and while community leaders believe improvements can be made next year, they said the overall tone of the meeting was positive. For a parade with an estimated 1 million attendees,... Neighborhood groups met with police and city officials last week to discuss the future of the citys annual Pride Parade, and while community leaders believe improvements can be made next year, they said the overall tone of the meeting was positive. For a parade with an estimated 1 million attendees,... The condoms, stamped with the bawdy slogan and a rainbow flame (an LGBT version of the Chicago Theological Seminary logo) were ordered specifically for the Pride Parade. The seminary also doled them out on Pride Day at the United Church of Christ General Synod and another Christian event earlier this month called Wild Goose Festival. The seminary, which houses an LGBTQ Religious Studies Center, has been hailed as a model for promoting sexual health and education among aspiring clergy. Hunt said sexual health is indeed a continuous conversation on campus, but the discussion unfolding now seems more like a shouting match inside an echo chamber, she said. \"It was done in affirmation of the community,\" she said. \"It wasnt encouraging X, Y or Z. Most of the stuff thats come out has  been talking about biblical truths, implying that they have a corner on biblical truth and theres no point in engaging that.\", mbrachear@tribpub.com , Twitter @TribSeeker]", "Date": "20150730", "Author": "[ Manya Brachear Pashman]", "Link": "http://www.chicagotribune.com/news/ct-second-coming-condoms-met-20150730-story.html", "Title": "[ Seminary's 'second coming' condoms offend some conservative Christians ]"}