{"Content": "[ The 2016 presidential campaign is quickening, with candidates popping up like daffodils. If youre a political junkie, this will be one of those leap years you live for, when no incumbent president is up for re-election. If youre a concerned citizen, this should be an unusually stimulating and educational experience. If youre among the millions of young people wholl be enticed into caring for the first time about politics and governance, welcome to a probably wild scrum. Ride your memory of these special years however far back it takes you  to 2008 (eventual winner: Barack Obama), or 2000 (George W. Bush). To 1988 (George H.W. Bush), or 1968 (Richard Nixon). To 1960 (John F. Kennedy), or 1952 (Dwight D. Eisenhower). If one of these was the year you fell in love with politics, you were front and center for a rollicking race to the White House. Each of these campaigns had unanticipated candidates, unexpected twists and unforeseen intrigues. With the presidential nominations of both major parties up for grabs, you saw big numbers of ambitious pols frantic to fill the beckoning voids. So if Uncle Fritz the family know-it-all says 2016 will be a dud, with Hillary Clinton already coronated as the Democratic choice and a slew of Republican back-benchers squabbling in the corner, hear him out and say, \"Maybe so.\" Then tell him 2016 has the makings of a hotly contested and raucous affair. Heres why:, When a president is assured his partys nomination for a second term, the election is mostly a referendum on him. In 2012, voters didnt have to figure out what to make of Barack Obama; the candidate who had promised hope and change now had a four-year record in the White House by which to judge him. Likewise in 2004, with George W. Bush, who had survived a turbulent Florida recount four years earlier to then become a thoroughly known quantity. Each time the static question facing Americans was: Does this president deserve another term? Who, if anyone, should replace him was a secondary matter. These incumbent-free elections, by contrast, give voters a chance to start fresh and weigh what they want in a president: Executive skills? Foreign policy savvy? Business acumen? Rhetorical gifts? A calming demeanor or a combative one? Age and experience or youth and vigor?, The sheer number of combatants can enliven voters, as in 1988, when Ronald Reagan was ending his second term. Such a huge field emerged that political reporters covering the Iowa precinct caucuses campaign likened it to the verbose cast of a thick Russian novel: To win the GOP nomination a sitting vice president, George H.W. Bush, had to turn back Sen. Bob Dole of Kansas, Rep. Jack Kemp of New York, former (and future) Defense Secretary Donald Rumsfeld of Illinois and four other prominent Republicans. Twelve Democrats ran; Massachusetts Gov. Michael Dukakis had to outlast such rivals as Rep. Dick Gephardt of Missouri, Sen. Paul Simon and the Rev. Jesse Jackson of Illinois, and Sen. Joe Biden of Delaware. During the 2012 Republican National Convention in Tampa, one speaker dared to express a deliberate faux pas. Libertarian-leaning Sen. Rand Paul, whom I watched from nosebleed seats near the press boxes, wove into his 17-minute speechan idea considered offensive to many Republican voters. Noting... During the 2012 Republican National Convention in Tampa, one speaker dared to express a deliberate faux pas. Libertarian-leaning Sen. Rand Paul, whom I watched from nosebleed seats near the press boxes, wove into his 17-minute speechan idea considered offensive to many Republican voters. Noting... Not that you have to go back that far to find a bombastic primary season: The open year of 2008 delivered an unpredictably rambunctious campaign. In the early months of that race, the person consistently sitting atop the GOP polls was former New York Mayor Rudy Giuliani, with former Sen. Fred Thompson of Tennessee next. Sen. John McCain of Arizona, the eventual nominee, languished in third. Early in 2007, Clinton had a fat lead over other Democrats. But Obama pushed her aside. Whatever attributes you value can probably be found in this years array of potential contenders. The political website Ballotpedia lists 32 declared or possible candidates. Ideological preferences range from the tea party on the right (Sens. Ted Cruz of Texas, Rand Paul of Kentucky and Marco Rubio of Florida) to the socialist on the left (Sen. Bernie Sanders of Vermont). The GOP race is wide open, with no clear front-runner and plenty of talented candidates apparently capable of raising enough money to compete. Yes, the Democratic nomination may be Clintons to lose ... as she managed to do eight years earlier. But even that contest may have more suspense than expected. A new scandal, a health scare or a gaffe by the candidate (or her husband) could bring a stampede of dark-horse challengers. In the business of low political blows, gun rights advocate Wayne LaPierre reminds us of Hillary Clintons best not-so-secret weapon: her amazing ability to drive her rivals and critics nuts. \"I have to tell ya,\" said the National Rifle Associations executive vice president and CEO to thundering... In the business of low political blows, gun rights advocate Wayne LaPierre reminds us of Hillary Clintons best not-so-secret weapon: her amazing ability to drive her rivals and critics nuts. \"I have to tell ya,\" said the National Rifle Associations executive vice president and CEO to thundering... In presidential politics, there is no such thing as a sure thing  except, perhaps, that incumbent-free zones give voters uncommon opportunities to select from so many possible paths and policies. Within six months or a year  and definitely in 18 months as Election Day 2016 looms  we may all be weary of this campaign. For now its an exciting embarrassment of riches.]", "Date": "20150414", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-hillary-clinton-obama-cruz-paul-rubio-edit-20150414-story.html", "Title": "[ The thrill of a wide-open race for president]"}