{"Content": "[ You can pack the Confederate flag in an attic or bury it six feet underground, but thats not going to make racism disappear. Intolerance, bigotry and hate dont need a banner as they march together through city streets, across farm fields and sail across massive oceans. You may as well stand in front of a tornado and shout, \"Stop\" as try to convince the haters that their beliefs will lead to no good. Every civilization in the history of the world has in some way justified its mistreatment of some other race of people by proclaiming \"we are better\" and, inevitably, \"they are worse.\", Perhaps it is something in the DNA of the human race, although theres an argument to be made for the lyrics of Rodgers and Hammersteins, \"Youve got to be carefully taught.\", \"Youve got to be carefully taught before its too late; Before you are six, or seven or eight; To hate all the people your relatives hate; youve got to be carefully taught,\" according to the song. Maybe its a need to feel superior or a way to cope with a feeling that you are inferior. It could simply be a way of identifying with members of your own tribe or to rationalize bad luck, bad weather, misfortune in business or a bad crop. \"They\" are responsible for it all. And \"they\" are always unlike us. In a historic moment, South Carolina Gov. Nikki Haley this week called for removal of the Confederate Battle Flag from the Statehouse grounds. It was the right thing to do and, to many of us, long overdue. Whatever arguments have been offered in the past for its prominent placement on government... In a historic moment, South Carolina Gov. Nikki Haley this week called for removal of the Confederate Battle Flag from the Statehouse grounds. It was the right thing to do and, to many of us, long overdue. Whatever arguments have been offered in the past for its prominent placement on government... Theyre not as clean. Not as hard working. Worship the wrong god, or the right god but in the wrong way. They lack respect. Expect too much. Cant be trusted. They simply arent like us and never will be. Ultimately, someone will say, \"they\" deserve to die. And its not like killing someone who is human like the rest of us. More like crushing an insect or defending your home against an intruder. Millions of people have died because of hate through the centuries. Yet you wont find that listed as a cause of death in any scholarly medical journal. People have a greater fear of AIDS, Ebola, TB or the flu then they do of their fellow mans ability to spread hate. Our Founding Fathers, students of history, understood hates potential to take over and destroy entire nations. And they did their best to provide us with words intended to inoculate generations far into the future  \"We hold these truths to be self-evident, that all men are created equal.\", NASCAR issued a statement Tuesday backing South Carolina Gov. Nikki Haleys call to remove the Confederate flag from the Statehouse grounds in the wake of the Charleston church massacre. The motorsports series issued its statement on the same day South Carolina lawmakers agreed to discuss removing... NASCAR issued a statement Tuesday backing South Carolina Gov. Nikki Haleys call to remove the Confederate flag from the Statehouse grounds in the wake of the Charleston church massacre. The motorsports series issued its statement on the same day South Carolina lawmakers agreed to discuss removing... But they didnt believe it themselves. They believed landowners were better people. They believed blacks were no better than a plow or a horse, pieces of property to be bought and sold. And notice that while \"men\" were created equal, women were not the equal of men. The people who signed the Declaration of Independence and later drew up the U.S. Constitution were flawed but understood that to survive and thrive, a new nation had to be better than those that had come before it. Protestants couldnt be allowed to force their beliefs on Catholics, Catholics couldnt be allowed to use the government to punish Jews, those with power couldnt be allowed to persuade the masses, the majority, to destroy the lives of those who were in the minority. That is the concept that to this very day many Americans fail to grasp  the minority have the same rights as the rest of us. Something about that will always bother people because it fails a common-sense test. Whats the point of acquiring power, having your own country, being richer than the rest, if you cant expect special treatment?, The fact that for more than 150 years the Confederate flag has symbolized everything but the United States of America has seemed to elude many people who were born here and would proclaim themselves patriots. Unlike those who would condemn the display of that flag, I have come to welcome it because it reminds me that people will often say one thing and do something else. They will pledge allegiance to one flag and raise another over a state Capitol. They will shout, \"... with liberty and justice for all,\" and then question the loyalty of a neighbor who refuses to recite those words. They will call Americans who die in combat \"heroes\" and never think about why they were sent off to war or how their deaths differ from those of all the men who have died in battle over the centuries for kings and dictators. I would like to believe that the great difference between this nation and all the others throughout history is that we were the first to acknowledge the rights of those who would ultimately be mistreated. It is wrong to treat others as if they are not as good as the rest of us. It is evil and self-destructive. And since the day of this nations birth, our leaders have done their best, as imperfect as that may have been, to send us the message that we must be better. Abraham Lincoln and Martin Luther King are revered because they gave their lives to preserve that dream. Both of them, it is often forgotten, were hated by millions of their fellow countrymen in their time. It is easy to forget history. To ignore the lessons that intolerance, bigotry and racism have taught us time and again. And its human nature, I suppose, to dismiss the many triumphs of humanity, the hard-fought victories that would have seemed unimaginable to people of the 1700s. We have more than perhaps any nation in the history of the world. Computers in our homes that give us access to knowledge that would have baffled Aristotle and Plato. The freedom to get in a car and travel the country unimpeded, whenever we choose. The ability to vote for presidents and denounce them publicly without fear that our families will be imprisoned. Women can run large corporations or choose to stay home and raise their children. A black man can rise to the highest office in the land and command the most powerful military on Earth. People can make fortunes by singing songs, throwing a football or simply being a Kardashian. Yet its not a perfect country, to be sure. There are crooks in places of power and on neighborhood streets. There are people who have it all and want more. There are people with nothing who will stop at nothing to get theirs. And never, it seems, is there enough. When a hurricane strikes, a tornado touches down or theres an attack on America by terrorists, the country comes together and helps. No one says, \"dont spend money helping the people who have lost their homes\" or on those who have been murdered by hate groups. Even those who oppose taxes and government spending say nothing because its necessary to stand together, as neighbors, as a country. But warning sirens do not sound when hatred threatens the land. There is no shelter in a basement from those looking to hide in safety. Removing Confederate flags, swastikas and other symbols of hatred from the landscape will remove the venom that sickens society. There are many things, bad things, that none of us can do anything about. They are beyond the control of the ordinary person. But for the sake of those ages six or seven or eight, we can stop teaching how to hate. It can only happen by one person, one family, at a time. \"We hold these truths to be self-evident, all men are created equal.\" All you have to do is believe in the gift that you were given. pkadner@tribpub.com]", "Date": "20150623", "Author": "[ Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-hate-st-0624-20150623-story.html", "Title": "[ Kadner: Hiding the symbols of hate won't stop the haters]"}