{"Content": "[ Pope Francis will meet with homeless people, immigrants and prisoners during his upcoming trip to Cuba and the United States. Hell also preside over a meeting about religious liberty a major issue for the U.S. Catholic Church in the wake of the Supreme Courts gay marriage decision. The Vatican published the itinerary Tuesday for the eagerly awaited Sept. 19-28 visit. Francis added the Cuba leg onto the start of his U.S. trip at the last minute after helping contribute to the historic thaw in U.S.-Cuba relations. In Cuba, hell celebrate Mass in Revolution Square in Havana  as both of his predecessors did during their trips to the Caribbean island nation. Hell travel to Holguin and pray before the Virgin of Charity of Cobre, the patron of Cuba, and meet with Cuban families in the eastern city of Santiago. Francis arrives Sept. 22 at Andrews Air Force Base in Washington, D.C. and the next day will be welcomed on the South Lawn of the White House by President Barack Obama, the Vatican said. He will become the first pope to address the U.S. Congress on Sept. 24, and will meet with homeless people later in the day at a local parish, St. Patricks. Hell give America a new saint by canonizing the 18th-century Spanish missionary Junipero Serra at the National Shrine. On Sept. 25, Francis will deliver a speech on sustainable development at the United Nations, where hell have another opportunity to voice his concerns about the environment ahead of make-or-break climate negotiations in Paris later this year. Hell host an interfaith gathering at Ground Zero in New York and meet with children and immigrant families on the other end of Manhattan, in Harlem. While St. John Paul II and Benedict XVI celebrated Mass in Yankee Stadium during their New York visits, Francis will celebrate Mass for a slightly smaller crowd in Madison Square Garden, and preside over a vespers service at the newly spruced-up St. Patricks Cathedral. On Sept. 26, he heads to Philadelphia where he will join the churchs World Meeting of Families. He will host a \"meeting for religious liberty\" on Independence Mall with immigrants and the Hispanic community, the Vatican itinerary said. U.S. Catholic bishops have been decrying what they say are attacks on religious liberty for years, particularly over federal health care laws that require insurance coverage for contraception. Their latest rallying cry has come in the wake of the Supreme Court decision declaring that same-sex marriage is legal nationwide. Francis will visit prisoners at the Curran-Fromhold Correctional Facility in Philadelphia before celebrating the final Mass of the family meeting on Sept. 27. He returns to the Vatican on Sept. 28. Associated Press]", "Date": "20150630", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-pope-cuba-visit-20150630-story.html", "Title": "[ Pope to meet with homeless, prisoners, immigrants during U.S. trip]"}