{"Content": "[ If you look like me  old, white and male  you like police. But anecdotal evidence aside, the relationship between American citizens and the police sworn to protect them seems to have gone askew. And the fault lines on trust seem to be widening. Were not allowed to make the obvious observation about the relationship between guns and shooting deaths. Guns dont kill people; people with guns kill people. In that regard, I think its not guns that kill people. Its the triggers. Ban triggers. Surely, there isnt a Constitutional Amendment that protects triggers, too. We cant talk about the causative effect of firearms on flying bullets because its upsetting to Fans of One Particular Amendment. So lets skip that point. Instead, lets talk about safe countries. Despite evidence that America is far less criminally violent than it was 20 years ago, people are shot fatally for provocations that do not seem significant. Were a trigger-happy bunch of galoots. Its just a factual observation. The shootings often are captured on video, but what the video shows is a function of who you are  police or average citizen, black or white, young or old; Republican or Democrat. The fatal shooting of 18-year-old Michael Brown in Ferguson, Missouri, last year has led to new scrutiny of the use of deadly force by police. As of Friday evening, officers nationwide had shot and killed 585 people in 2015, according to an ongoing examination by The Washington Post. Of those,... The fatal shooting of 18-year-old Michael Brown in Ferguson, Missouri, last year has led to new scrutiny of the use of deadly force by police. As of Friday evening, officers nationwide had shot and killed 585 people in 2015, according to an ongoing examination by The Washington Post. Of those,... As the Resident Ancient Caucasian, I like cops. They hardly ever shoot people who look like me. That makes my general attitude positive. I get along well with almost anyone who does not shoot me whether they wear a uniform or Bermuda shorts. But if my skin had an identifiable pigment, I might be less happy. The truth is, because the statistics are seldom solicited for wider assessment, no one knows for sure how often a police officer shoots a citizen and why. Its deadly for police, too. Fifty officers were shot and killed in the line of duty in 2014, compared to 32 in 2013, a 56 percent increase. In 2011, police killed six people in Australia, two in England, six in Germany and, according to an FBI count, 404 in the United States. And that FBI number counted only \"justifiable homicides,\" sifted from voluntarily submitted data from just 750 of 17,000 police agencies. Fully a quarter of civilian deaths involved a white officer killing a black person. Its just an odd coincidence. About 100 protesters gathered along West Florissant Avenue in Ferguson late Tuesday in a demonstration that was decidedly smaller and calmer than others on recent nights. Attendees mostly mingled quietly along the side of the road. Some chanted, and a few held signs. Police officers, most wearing... About 100 protesters gathered along West Florissant Avenue in Ferguson late Tuesday in a demonstration that was decidedly smaller and calmer than others on recent nights. Attendees mostly mingled quietly along the side of the road. Some chanted, and a few held signs. Police officers, most wearing... Its not surprising that hometown police forces concerned not only about citizen safety but also police credibility want to understand what happens in these confrontations and why. We typically predict that technology will cure whatever is wrong with us. But this issue might defuse that premise. When police moments that call for intelligent conflict resolution turn deadly, it might be attitude, training or both. Or the officer night not have a choice. In this view, the video camera is the perfect referee. Who will claim victimhood if the camera records a different reality?, But police generally believe they are almost always right when they pull the trigger, otherwise they wouldnt do it. In fact, the most recent Pew/Gallup three-year national study of opinions reflected why the problem is more complicated and nuanced than adding video evidence. Combined 2011-2014 data show that 59 percent of whites have general confidence in police, compared with 37 percent of blacks. The older and whiter you are, the more you love police. In fact, most white Americans love their police. Of 17 tested institutions rated for white confidence, police rank behind only the military and small business. Among blacks, police drop to seventh, behind not only the military and small business, but also the presidency, organized religion, and the medical system. Black Americans trust television news  even Fox  more than police. The Reuters/Ipsos Polling study found Democrats (53 percent) believe the police unfairly target minorities. Only 19 percent of Republicans agree. Republicans (70 percent) trust police. Old people trust police; young people dont. When a University of Cincinnati street police officer shot and killed an unarmed black motorist recently, the entire episode was captured on the officers body cam. What he claimed happened  he was provoked and then dragged by the motorists car  does not show up on the video. What the video seems to show is not what the officer believed happened, even as he radioed for help seconds after the shooting. Truth or cognitive dissonance? Thats the question even perfect video recordings might not settle. But heres a truth. The last time a British officer was killed by a gun was in 2012. They have people with different skin pigmentation in England, too. So maybe the common denominator is something else. David.Rutter@live.com]", "Date": "20150811", "Author": "[ David Rutter]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/opinion/ct-ptb-rutter-trust-gap-st-0812-20150811-story.html", "Title": "[ Rutter: Technology won't fix hair-trigger trust deficit]"}