{"Content": "[ On a recent Tuesday evening, several dozen volunteers met at the Resurrection Project, an immigrant rights advocacy organization in Chicagos Pilsen neighborhood, to learn how to file freedom of information requests. The volunteers, most of them immigrants in the country illegally, were hoping to help others collect the documents needed to apply for protection from deportation under President Barack Obamas executive action, papers that may come from U.S. Citizenship and Immigration Services, border and customs enforcement or the FBI. \"A lot of people cross the border and dont know if they got fingerprinted. They dont know if they said they were a U.S. citizen,\" said Erendira Rendon, senior organizer with the Resurrection Project, who led the workshop. \"There are some folks who have order of deportations but dont know. Theyre like, I think I got something in the mail from immigration.\", But the advocates knew their work was only aspirational. Hours before applications for the first of the federal deportation protection program were to begin in February, a federal judge in Texas ordered the process halted in response to a lawsuit brought by 26 mostly Republican-led states. The legal decision was devastating to local immigrants. But immigrant advocates are treating the court battle as a temporary setback. They are encouraging people to continue collecting what they would need for the document-heavy sign-up with the expectation that someday they will be able to turn their dreams into a reality. Immigrant rights advocates believe the judges ruling is on shaky legal ground and ultimately wont be upheld. The immigrants they are trying to persuade to come out of the shadows and hand over their personal information to the federal government, however, are not as sure. They fear the deportation protection will be permanently scuttled. But they also wonder how safe their personal information would be in a program that can be halted by one judge. Wendy and Oscar Robles put their daughters Natalia, 8, and Patricia, 5, to bed in their Northwest Side Chicago home. He faces deportation proceedings and was hoping for relief from administration action, which has been put on hold. Wendy and Oscar Robles put their daughters Natalia, 8, and Patricia, 5, to bed in their Northwest Side Chicago home. He faces deportation proceedings and was hoping for relief from administration action, which has been put on hold. \"In the community, theres definitely concern,\" Rendon said. \"It adds a little bit to the scary factor. Theres a little bit more skepticism in the audience when were giving presentations.\", Justice Department lawyers asked an appeals court for an emergency ruling that would allow the program to go forward, and a coalition of 14 mostly Democratic-led states, including Illinois, filed a brief there to lift the embargo. But it has left people like Virginia Chavez, an immigrant who has lived illegally in Pilsen for 18 years, deflated. \"Right now I am sad, deceived and more than anything angry,\" Chavez, 48, said after the Freedom of Information Act workshop. \"Because we have worked all these years. So it makes me feel powerless to not be able to execute the action that Obama had announced.\", Long time coming, Chavez began her outreach when the president offered 600,000 \"Dreamer\" youths protection from deportation in 2012. After an immigration overhaul bill died in Congress a year later, she and others began pushing for Obama to pen administrative relief. Immigrant rights activists are hailing Chicagos next Roman Catholic archbishop, hoping that Blase Cupichs outspoken advocacy for their cause translates to meaningful changes to local and state laws that would make Illinois the friendliest state for immigrants. \"Its always very encouraging to... Immigrant rights activists are hailing Chicagos next Roman Catholic archbishop, hoping that Blase Cupichs outspoken advocacy for their cause translates to meaningful changes to local and state laws that would make Illinois the friendliest state for immigrants. \"Its always very encouraging to... The president did so in November, including an expansion of the 2012 program known as Deferred Action for Childhood Arrivals, or DACA, for people who are older than 31, as well as a new program for parents of citizens or legal permanent residents called Deferred Action for Parents of Americans, or DAPA. This time, as a mother of two U.S. citizens, it was to be Chavez turn to qualify for a three-year protection from deportation and permission to work legally. She was excited that she soon would be able to move out of her minimum-wage job taking care of the elderly. With the announcement of the presidents plan, Chicagos advocacy community launched an initiative to help the states 280,000 potential applicants sign up for the deportation protection. At organizations like the Resurrection Project, that included training immigrants in the U.S. illegally as volunteers, who would go to churches and schools in their neighborhoods to encourage people to sign up. Those volunteers would then help screen them before handing them over to a pro bono attorney or other person certified to help them fill out the forms. But then the application process was halted, and volunteers could only guide immigrants in collecting their birth certificates, bank statements, phone bills, school and medical records and other documents that show they have been living in the U.S. on a permanent basis since January 2010. \"When we do workshops were like, Saca la maleta (Pull out the suitcase) because its like really cultural. We have everything in one maleta,\" Rendon said. \"Its very document-heavy. You have to get documents everywhere.\", Added complication , But now even that education effort has been challenged, after Illinois Gov. Bruce Rauner, facing a $6.2 billion state deficit, proposed cutting the $6.6 million the state gives immigrant services for fiscal year 2016. \"It wasnt even in the budget,\" said Lawrence Benito, executive director of the Illinois Coalition for Immigrant and Refugee Rights, an advocacy group. The budget has yet to be approved by the General Assembly, but if it remains unchanged, more than half of the 60 state-funded organizations that serve Chicagos immigrant community would have to lay off staff. Another 11 percent would have to shut down their programs altogether, according to a report issued by the immigrant rights coalition last month. \"We expected more clients in the field and expected expanded services from our organization (for expanded DACA and DAPA sign-ups),\" said Seung Yong Lee of Korean American Community Services, a social service agency with offices in Chicagos Albany Park neighborhood and Prospect Heights, that helps immigrants with DACA and citizenship applications. \"We cannot anticipate anything now.\", Rauner later went a step further and froze $3.4 million in funding for immigrant services for the remainder of this fiscal year. The grant stop has had an immediate chilling effect on immigrant services, organizations said. \"There goes the infrastructure to perform the outreach and education for DAPA and DACA as well,\" said Fred Tsao, policy director of the immigrant rights coalition. Deportation threat, The legal and financial blows have immigrants in the Chicago area uneasy about what to do next. When the presidents deportation protection seemed a certainty, Oscar Robles, 41, and Wendy Robles, 31, of Chicagos Irving Park neighborhood, were excited that they would no longer have to depend on a year-by-year reprieve, called a stay of removal or deportation, to delay Oscar Robles deportation proceedings. Now the family finds it once again has to apply for the temporary stay. \"I am sad because this is our only hope,\" Wendy Robles said of the executive action that is on hold. People like Chavez and Rendon are trying to remind immigrants to not lose the faith and to keep preparing for administrative relief. \"I tell them, No, you have to have faith in God and keep fighting,\" Chavez said. \"If we dont fight, nothing will change.\", mmrodriguez@tribpub.com, Twitter @merjourn]", "Date": "20150424", "Author": "[ Meredith Rodriguez]", "Link": "http://www.chicagotribune.com/news/ct-immigrant-deportation-executive-action-met-20150424-story.html", "Title": "[  Immigrants' lives on hold while they wait for administrative relief to return]"}