{"Content": "[ There was a time in Republican presidential politics when Chris Christie was a star, Scott Walker a mystery and John Kasich a memory. How things can change. Today, they are the last of the GOPs undeclareds  a trio of ambitious governors whose fortunes have shifted dramatically in recent months, illustrating why its far too early to count anyone out in the GOPs crowded and unruly White House race. \"Does anyone remember me?\" Kasich, who first ran for president more than a decade ago, said Wednesday as he looked out at a crowd of roughly 200 people gathered for his first Iowa appearance in years. \"Im shocked.\", With Louisianas Gov. Bobby Jindal formally launching his presidential bid on Wednesday, 13 high-profile Republicans have officially entered the campaign for the partys 2016 nomination. Only three major prospects remain: Ohios Kasich, Wisconsins Walker and New Jerseys Christie, each planning to announce his intentions in the coming weeks. They are expected to join a field with five sitting or former senators, five current or former governors, two business leaders and a retired neurosurgeon. The \"in or out\" phase of the Republican presidential race is nearing its end, but with just over seven months until Iowas leadoff caucuses, no clear leader has emerged in the race for the nomination. \"Theres so many candidates, its almost impossible for the average person to keep track,\" said tea party leader Mark Meckler, who heads up the conservative group Citizens for Self-Governance. Yet the uncertainty in the race has as much to do with one candidate as any other: former Florida Gov. Jeb Bush. The son of one president and brother of another had hoped to overwhelm his Republican competitors by raising tens of millions of dollars and assembling top staff talent during the first half of this year. While aides say Bushs fundraising has been impressive, he has struggled to break out in early polls, leaving room for party activists on the ground in early-voting states to consider new faces. Kasich is a new face only for those who dont remember that, 16 years ago, he was a challenger to another presidential candidate named Bush. The 63-year-old Republican governor and former congressman ran a short-lived bid that was quickly dashed by Bushs older brother, then-Texas Gov. George W. Bush. The often-blunt Kasich says hes seriously looking at 2016 largely because of Jeb Bushs inability to match his brothers dominance, leaving room for a dark-horse candidacy such as his own to catch on. It doesnt hurt that he posted an overwhelming re-election victory in 2014 in one of the nations premier swing states. \"Everybody has a place. Everybody can rise,\" Kasich said Wednesday, echoing a central theme of Bushs candidacy. \"Its who delivers the biggest message and who can touch peoples hearts.\", Christie, meanwhile, has almost been reduced to an afterthought due to lingering questions about his personality and political baggage following the George Washington Bridge scandal. And while he and Kasich lack Bushs stacked bank account, they represent perhaps the most direct threat to Bush among those in the race. All three appeal to the partys more moderate voters. Kasich and Christie were among the few Republican governors to expand Medicaid eligibility as part of President Barack Obamas health care law, they have prioritized treatment for drug addicts and the mentally ill, and both have shown a willingness to stand up to those in the farthest reaches of the partys conservative base. Christie was once considered an early front-runner in the 2016 race, having passed on a bid in 2012. His backers have little doubt that hes in, as hes been raising money for both a political action committee and a super PAC, delivering meaty policy speeches and paying visits to key early-voting states  most notably New Hampshire. Kasich and Christie pose a particular challenge to Bush in the nations first presidential primary state, which typically favors pragmatic leaders over party ideologues. While Kasich made his first trip to Iowa since 1999 this week, he has been a regular to visitor to New Hampshire in recent months. And underscoring the importance of the state, a person familiar with Christies planning says his team has considered setting his official announcement there in an event that could come as early as next week. The person spoke to The Associated Press on condition of anonymity to discuss the topic ahead of Christies formal announcement. Walker, meanwhile, has surged into the top tier of his partys presidential hopefuls after impressing Republicans in Iowa earlier this year, yet he remains largely unknown beyond his base in the Midwest and party activists. Some Republicans see him as having the ability to unite the GOPs more conservative and moderate wings, and he has said his announcement will come in early- to mid-July. The question for all, Meckler said, is whether they can stand out. \"Even knowing whos in the field is becoming more and more difficult,\" Meckler said.]", "Date": "20150625", "Author": "[ Thomas Beaumont]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-gop-almost-set-for-2016-with-only-walker-and-2-other-governors-left-to-get-in-20150625-story.html", "Title": "[ GOP almost set for 2016, with only Walker and 2 other governors left to get in]"}