{"Content": "[ After a five-day stint in jail for refusing to issue marriage licenses to same-sex couples, Rowan County Clerk Kim Davis will return to work as soon as Friday to face another day of reckoning.  The Apostolic Christian, now a symbol of strong religious conviction to thousands across the globe, would not say whether she would allow licenses to continue to be issued or try to block them once again, defying a federal court order that could send her back to jail.  Davis walked out of the Carter County Detention Centers front door Tuesday, arm in arm with her lawyer and with Republican presidential candidate Mike Huckabee, to a podium backed by a 150-voice church choir. Thousands of supporters and waved white crosses and sang \"Amazing Grace\" and \"God Bless America.\",  Davis will take a couple of days off from work to spend with her family and will return to work Friday or Monday, according to Charla Bansley, a spokeswoman for Liberty Counsel, the Christian law firm representing Davis. Her statement did not say whether Davis would allow her office to grant licenses.  At 8 a.m. Wednesday, her office at the Rowan County Courthouse in Morehead opened as scheduled. Deputy clerk Brian Mason said anyone seeking a license will get one. If Davis returns to work and tells him to stop, he said hell tell her he cant obey her, and instead must follow a federal judges order to issue licenses.  In lifting his contempt order against Davis, U.S. District Judge David Bunning said he was satisfied that her deputies were fulfilling their obligation to grant licenses to same-sex couples in her absence. But Bunning warned that she could go right back to jail if she interferes with the issuance of marriage licenses to same-sex couples upon her return.  \"Kim cannot and will not violate her conscience,\" said Mat Staver, founder of the Liberty Counsel, the Christian law firm representing Davis. As for what might happen next, he said \"Youll find out in the near future.\",  Staver said the licenses deputy clerks issued to same-sex couples last week were not valid because they were not given under Davis authority. But the Kentucky attorney generals office said it believes otherwise.  Attorney General Jack Conway also said that for now, he wont appoint a special prosecutor to investigate whether Davis committed a state crime by refusing to issue licenses. One rejected couple had asked the local prosecutor to consider charging Davis with official misconduct, a misdemeanor applicable to public officials who neglect their duties. Rowan County Attorney Cecil Watkins cited a conflict of interest and passed the complaint to Conway.  But in a one-sentence statement Wednesday, Conway noted that Davis actions are being monitored already: \"Judge Bunning and the federal court have control of this matter, and therefore a special state prosecutor is not necessary at this time.\", Rowan County Clerk Kim Davis waves to a crowd of her supporters at a rally in front of the Carter County Detention Center on Sept. 8, 2015, in Grayson, Ky. Rowan County Clerk Kim Davis waves to a crowd of her supporters at a rally in front of the Carter County Detention Center on Sept. 8, 2015, in Grayson, Ky.  At least one of the four couples that sued Davis have not yet received a marriage license. Five of Davis six deputy clerks  all except her son, Nathan  agreed to issue licenses to gay couples with Davis behind bars. In lifting the contempt order, Bunning asked for updates on the clerks compliance every two weeks.  On Wednesday, deputy clerk Mason said 10 marriage licenses had been issued in Davis absence since Friday: eight Friday and two Tuesday. Seven of those went to same-sex couples, including Mark Shrayber and Allen Corona, who flew in from San Francisco.  Shrayber said they decided on a Rowan County wedding to show their support for gay couples.  \"We are in 2015. We are not burning witches anymore,\" said Shrayber, adding that hes disgusted to see Davis becoming \"a martyr.\",  Shrayber and Corona picked up their license at the office on Tuesday, got married at Morehead State University, and then returned Wednesday to file the paperwork. Some local residents ran up to hug them, they said.  If Davis orders her deputies not to issue licenses after she returns to work, she would push them into their own thorny legal conundrums: Defy their boss, or a federal judge? Scott Bauries, a law professor at the University of Kentucky, suspects any deputy choosing not to issue licenses could be held in contempt.  Davis, 49, has refused to resign her $80,000-a-year job. Elected as a Democrat, she can lose her post only if she is defeated for re-election or impeached by the state General Assembly. Katherine Franke, a professor at Columbia Law School, said legislators should find the political will to remove her, since she has ignored her oath of office in favor of her religious conviction.  \"The claim shes making is a clear loser. Its a political claim, its not a legal claim,\" Franke said. \"Thats why she lost on the district level and the circuit level and she will continue to lose. Shes fighting for justice on the level of religious law. But we dont live in a theocracy.\",  It is unlikely the Kentucky state legislature would impeach Davis. The Republican president of the state Senate spoke at a rally at the state Capitol and filed an amicus brief asking Bunning not to hold Davis in contempt. Several lawmakers have already filed legislation for the 2016 session to exempt county clerks from having to issue marriage licenses.  The couples who sued will ask the judge to again hold Davis in contempt if she returns to work and blocks her deputies from dispensing licenses, according to their attorney, Dan Canon.  \"We are hoping she is going to comply with it. Well have to see,\" Canon said. \"But if experience is a teacher, Ms. Davis just doesnt believe that court orders apply to her.\", Associated Press]", "Date": "20150909", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-kentucky-clerk-kim-davis-gay-marriage-20150909-story.html", "Title": "[ Gay couple weds after getting marriage license from Kentucky clerk's office]"}