{"Content": "[ President Obama has approved sending up to 1,500 more troops to Iraq, roughly doubling the number of U.S. forces on the ground helping Iraqi and Kurdish forces battle the militant group Islamic State, U.S. officials said on Friday. Obamas decision greatly expands the scope of the U.S. campaign and the geographic distribution of American forces, some of whom will head into Iraqs fiercely contested western Anbar province for the first time to act as advisers. It also raises the stakes in Obamas first interactions with Congress after his Democratic Party was thumped by Republicans in mid-term elections this week. The White House said it would ask Congress for $1.6 billion for a new \"Train and Equip Fund\" and billions more for operations to battle the group. Pentagon Rear Admiral John Kirby said those funds would need to be approved before the first additional forces head to Iraq, something one official speculated could happen in just weeks. \"(Iraqi forces are) going on the offense now. And what this is designed to do is to help them continue to be able to do that, to improve their capability and their competence on the battlefield,\" Kirby said, stressing no American ground forces will take on combat roles. Alarmed by the advance of Islamic State militants across Iraq, Obama began sending non-combatant troops back to Iraq in the summer for the first time since he withdrew U.S. forces from the country in 2011. At the time of the withdrawal, the Pentagon boasted of Iraqi military capabilities. But Iraqi forces crumbled in the face of Islamic States offensive, exposing the toll sectarian strains and mismanagement took on the military. Republican victors of Tuesdays U.S. congressional elections broke bread with Democratic President Barack Obama on Friday. On the menu besides sea bass: whether the two sides can put aside differences and agree on some legislation in the two years to come.But Obama and congressional leaders spent... Republican victors of Tuesdays U.S. congressional elections broke bread with Democratic President Barack Obama on Friday. On the menu besides sea bass: whether the two sides can put aside differences and agree on some legislation in the two years to come.But Obama and congressional leaders spent... Officials denied the new U.S. troop buildup amounted to \"mission creep\" and said it was justified partly because of new Iraqi Shiite Prime Minister Haider al-Abadis efforts to reach out to Sunni tribesmen and new calls from Iraqs most senior Shiite cleric to rush to the Sunni tribes aid. AUTHORITY FOR 3,100 U.S. TROOPS, One Obama administration official, speaking on condition of anonymity, pointed to an Iraqi plan to \"organize and equip 5,000 tribesmen in Anbar.\", \"This is now being openly discussed in Iraq and its starting to happen,\" the official said. About 1,400 U.S. troops are now on the ground, just below the previous limit of 1,600 troops. The new authorization gives the U.S. military the ability to deploy up to 3,100 troops. Kirby said about 870 of the additional U.S. troops would be involved in \"hands-on training,\" and disclosed that \"well over 700 additional trainers will come from foreign governments.\", Iraqi Kurdish forces have blunted, but not broken, the siege of the Syrian border town of Kobani, a week after arriving to great fanfare with heavy weapons and fighters in a bid to save it from Islamic State. Kobani has become a test of the U.S.-led coalitions ability to halt the advance of the... Iraqi Kurdish forces have blunted, but not broken, the siege of the Syrian border town of Kobani, a week after arriving to great fanfare with heavy weapons and fighters in a bid to save it from Islamic State. Kobani has become a test of the U.S.-led coalitions ability to halt the advance of the... The Pentagon said it planned to establish several sites across the country to train nine Iraqi army brigades and three brigades of Kurdish Peshmerga fighters. They would be set up in northern, western and southern Iraq. Kirby said the training would focus on tasks such as battlefield leadership, tactical organization, logistics and intelligence matters. The remaining 630 or so American forces would help establish \"advise and assist\" operations centers, adding to similar centers in existence in Baghdad and Arbil. Kirby said many of the additional American troops would be dedicated to securing bases where training and advising would take place and cautioned that American troops still face risks. \"We already had a couple of military deaths associated with this conflict ... Nothing we do is without risk,\" he said. FIGHTING IN ANBAR PROVINCE, Officials said one location to which military advisers would soon travel was western Anbar province, bordering Syria, where Islamic State fighters are on the offensive. Iraqs main military divisions in Anbar have been hit hard. At least 6,000 Iraqi soldiers were killed through June and double that number have deserted, according to medical and diplomatic sources. The announcement of the force expansion was made on the same day Obama met with members of Congress at the White House and updated them on the fight against Islamic State in Iraq and in Syria, Obamas Iraq campaign has been criticized, particularly by some Republicans concerned about his determination to limit the U.S. role to air strikes and advising and training missions far from the front lines. U.S. Representative Buck McKeon California Republican, said in a statement: \"I would urge the President to reconsider his strategy and clearly explain how this additional funding supports a new direction. Such clarity is more likely to find swift Congressional approval.\"]", "Date": "20141107", "Author": "[ Phil Stewart and Roberta Rampton]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-american-troops-iraq-20141107-story.html", "Title": "[ Obama authorizes 1,500 additional U.S. troops for deployment to Iraq]"}