{"Content": "[ Chicago next year will once again have the highest sales tax rate of any major U.S. city, according to a new analysis from a tax policy research organization. The city rate will hit 10.25 percent on Jan. 1, when a penny-on-the-dollar sales tax increase the Cook County Board narrowly approved Wednesday goes into effect. That will push Chicago above four Alabama cities, including Montgomery, where the rate is 10 percent, and Seattle, where the rate is 9.5 percent, the Tax Foundation analysis found. \"Chicago, by any measure, is the city that will have the highest rate,\" Jared Walczak, a Tax Foundation policy analyst, said in an interview Friday. The foundation is a 78-year-old nonpartisan, nonprofit group based in Washington, D.C. There are other, much smaller, towns in five states that will still have higher rates, but they are in places where there is either a much greater reliance on sales taxes than Illinois to fund government or are little towns that derive the bulk of their revenue from tourists, Walczak said. \"Chicago stands out because its a high sales tax amidst a sea of high taxes, even with the partial sunsets of the 2011 Illinois (income) tax hikes,\" Walczak wrote in a blog post announcing the analysis. \"Its rate as of January 1, 2016, will also stand out as the highest rate in a major city.\", The county sales tax rate will rise from 0.75 percent to 1.75 percent. The balance of the sales tax comes from the state, city and mass transit portions. Its not the first time Chicago will have the nations highest rate among major cities. The sales tax rate was 10.25 percent after the County Board enacted an identical 1-percentage-point increase in 2008. But that increase was rolled back over time, first under then-County Board Chairman Todd Stroger and then current board President Toni Preckwinkle, who in 2010 pledged during her campaign to kill of what remained of the increase. The board approved the new increase this week at her request, with Preckwinkle saying the tax was needed to restore financial health to the countys underfunded pension system, cover rising payments for debt incurred before she took office and boost spending on roads and bridges. hdardick@tribpub.com, Twitter@ReporterHal]", "Date": "20150717", "Author": "[ Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-cook-county-sales-tax-0716-20150717-story.html", "Title": "[ Chicago will have nation's highest big-city sales tax rate come January]"}