{"Content": "[ As Chicagoans hear the news that the South Side will host the Obama presidential library, some may ask: Whos going to pay for that?, The answer is that presidential libraries are built with private donations, and the Obama librarys construction and endowment are expected to require up to $500 million in contributions. But after construction, taxpayers will foot much of the bill to keep the library running. Last year, taxpayers spent about $66 million on the 13 presidential libraries across the country. Thats about 21 cents per U.S. resident. Its a tiny fraction of the federal governments $3.5 trillion annual budget. But the notion that taxpayers help pay for presidential libraries doesnt sit well with everyone  including those who view them as tools to help shape public opinion. After they are built, the libraries are handed off to the National Archives and Records Administration. The major responsibility of the National Archives is to preserve and make accessible the presidents papers, records and other historical materials. But it isnt always clear where the governments work begins and where that of the foundation  the nonprofit group whose mission is to ensure that the presidents vision for his library is carried out  ends. Advocates from a variety of institutions comment on why the proposed Barack Obama presidential library has to be on Chicagos South Side. Advocates from a variety of institutions comment on why the proposed Barack Obama presidential library has to be on Chicagos South Side. \"The public is sometimes confused by this private-public partnership,\" said Benjamin Hufbauer, a presidential library scholar and associate professor at the University of Louisville. \"They are basically museums of spin established by the presidents ... but they want the federal government to run them and give them legitimacy.\", But Susan Donius, director of the National Archives Office of Presidential Libraries in Washington, said having presidential libraries located around the country gives people firsthand access to democracy. While a curatorial staff oversees the exhibits, the story is the presidents to tell. The museum emphasizes the points he wants to make about his four or eight years in office and the exhibits reflect that era of American history as well as the major events shaping that presidents administration, Donius said. The relationship between the federal government and the foundation varies from library to library. In some cases, the foundation continues to occupy offices and other space in the library even after the building is deeded to the National Archives. While the federal government covers most staffing, maintenance and operational costs, foundations often pay for programs and exhibits. The government pays for building repairs, but major exhibit renovations generally are handled by foundations. Since 1986, foundations have been required to create a private endowment to offset increasing operating costs. Under a 2008 amendment, President Barack Obama will be the first president required to have an endowment representing 60 percent of the cost to build his library. His predecessors had a 20 percent threshold. The endowments come as the National Archives presidential library spending has declined from $70 million in 2007 to $66 million in 2014. dglanton@tribpub.com]", "Date": "20150501", "Author": "[ Dahleen Glanton]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-obama-library-taxpayers-20150430-story.html", "Title": "[ Who'll pay for Obama library? Private donors -- and taxpayers]"}