{"Content": "[ Mayor Rahm Emanuels formula for fixing Chicago Public Schools has always put a priority on building better leaders, so it could have been a setback for the mayors agenda when a prominent education nonprofit balked at funding a training program for principals in mid-2012. It turned out to be little more than a speed bump. Emanuels first schools CEO, already on the outs with the mayor, was soon replaced by a new boss  Barbara Byrd-Bennett, a veteran educator who just months earlier had been the lead trainer for SUPES Academy LLC, an education consulting firm. Minutes after confirming Byrd-Bennetts appointment as the new schools CEO in October 2012, the Emanuel-appointed school board voted to give SUPES a $2.1 million principal training contract, followed less than a year later by a $20.5 million deal. Both were done without competitive bidding or public debate. That arrangement is now at the center of a federal criminal investigation. A Tribune examination has found that questions of redundancy, effectiveness and potential conflicts of interest were set aside in the push for the new training program at CPS, an expansion of a pilot project launched and then dropped by the nonprofit Chicago Public Education Fund. The outgoing schools boss and the head of the education fund said they had no interest in SUPES running a principal training program. Interviews and records show a yearslong trail of connections between central figures in the controversy  all players in national school reform efforts  as they moved through a revolving door between public schools and profitable consulting work. They eventually converged in Chicago, where Emanuels aggressive focus on remaking the school system was embraced by civic leaders, philanthropists and universities, as well as for-profit firms that stood to gain a piece of the action. The consultant and the mayors office, The Tribune has reported that the consultant at the center of the controversy, SUPES owner Gary Solomon, advised the mayor-elects transition team on selecting Jean-Claude Brizard as Emanuels first schools CEO in 2011. Newly examined records show that Solomon was in frequent email contact with Emanuels deputy chief of staff for education, Beth Swanson, from the early months of the administration. The email exchanges between Swanson and Solomon included a flurry in 2012 around the same time Byrd-Bennett left her lead trainer role at SUPES to become Brizards top deputy at CPS. Once Byrd-Bennett took that CPS job, talk escalated about expanding SUPES work from training administrators to also training principals. On May 1, 2012, Solomon forwarded an email to Swanson with the subject line \"Principal Thoughts.\" Then, between July 10 and July 11, they exchanged emails with the heading \"Principal Presentation.\", Acting Chicago schools boss Jesse Ruiz announced Wednesday that the district was suspending payment on a $20.5 million no-bid contract at the center of a federal criminal probe, but he also defended his own vote for the 2013 deal in his role as vice president of the Chicago Board of Education. Acting Chicago schools boss Jesse Ruiz announced Wednesday that the district was suspending payment on a $20.5 million no-bid contract at the center of a federal criminal probe, but he also defended his own vote for the 2013 deal in his role as vice president of the Chicago Board of Education. In a recent interview, Emanuel told the Tribune he didnt know Solomon, doesnt know what role the consultant played in bringing Brizard to Chicago and doesnt recall any of the discussions or background leading up to the $20.5 million training program with SUPES. Asked whether Solomon had connections to Swanson, the mayor said, \"Im not going to talk about it, given that there are questions.\", The mayors office and CPS have to date not fulfilled the Tribunes requests for emails to or from the Emanuel administration that are related to the controversy. But a partial log of such emails provided by the administration  confined to senders, recipients and subject lines  indicates City Halls ongoing involvement in the principal training discussion. The school district also has not provided other records that might shed light on the administrations actions. Souring on SUPES, In an interview, Heather Anichini, the president of the public education fund, said she opposed handing principal training to SUPES. Anichinis group did spend $380,000 on a pilot program with SUPES for it to train midlevel school managers that was announced in the middle of the 2011-12 school year. After that, however, the organization decided to end its involvement with SUPES and made no secret of it, Anichini said. At the time, Swanson, Board of Education President David Vitale and then-school board member Penny Pritzker all served as board members of the nonprofit as well, though Anichini said none of them sat on the committee that reviewed SUPES work. The nonprofit, which often provides financial backing for initiatives at CPS, draws its support from some of the Chicago areas most affluent and influential citizens. Board members have included hedge fund billionaire Ken Griffin, Gov. Bruce Rauner and Pritzker, now the U.S. commerce secretary. During late summer and early fall 2012, the fund was \"in constant conversation\" with CPS leadership and \"Barbara specifically\" about its decision to step away from underwriting a second year of SUPES funding, Anichini said. That coincides with the time frame during which Emanuel made Byrd-Bennett the de facto leader of CPS. In those conversations, Anichini said, CPS leaders expressed a desire to have SUPES add principal training to its portfolio. \"We clearly communicated our experience and the reasons for not making an additional grant,\" Anichini said. One reason for the funds decision, Anichini explained, was that Byrd-Bennett was now working for CPS and so would not be available to lead the training sessions. Another reason, Anichini said, was a \"lack of clarity\" from SUPES on how it could add value to the training in a second year for network chiefs who had already gone through the program. From the outset of his administration, Emanuel made principal development a key component of his efforts to overhaul city schools. \"My biggest thing when I ran for mayor in 2011, We need a bench of good principals, assistant principals, and we need a training program, \" Emanuel told the Tribune in the recent interview. \"I also announced we need a principal bonus system. We set that up. Since day one, I announced that even before I was elected mayor.\", Brizard, in a separate interview, said he never would have considered expanding SUPES work to training principals because CPS already had a program in place to accomplish that using partnerships with universities already well-established in the field. The Chicago Leadership Collaborative, which Brizard had launched with Emanuel in 2011, was doing \"pipeline development\" to groom new principals, and Brizard said he was looking to leverage Northwestern University to train existing principals. Brizard said he was still schools CEO when the education fund was in discussions over the future of the SUPES training but by then he was \"out of the loop,\" a consequence of being marginalized by Emanuel. Brizards signature was on the CPS staff recommendation for the initial SUPES contract approved Oct. 24 as Byrd-Bennett was replacing him, but he said he had no knowledge of the deal and believes his signature was actually marked by a stamp, which is common practice at CPS. Brizard said he doesnt recall being involved in a no-bid contract at CPS. There was a lot of buzz in the education community when the school board awarded the $20.5 million contract for principal training without using a request-for-proposal process, known as an RFP, that could have allowed other training organizations to compete for the work, he said. \"When the contract came, a lot of us were surprised there was no RFP,\" Brizard said. \"All of this could have been avoided if they had put out an RFP.\", Approved without dissent, The school board did not discuss the deal in open session before its 6-0 vote at the June 2013 meeting and has declined to release any records of its closed-door executive session at that meeting or of any presentation from CPS or Emanuel officials about the proposal. In the days after the investigation became public last month, Vitale and board member Jesse Ruiz said the board followed the advice of a CPS \"review committee\" that examines no-bid contract requests. Such contracts are \"relatively unique\" and are subject to a \"separate procurement process in which management makes the case for the services that they are seeking and why the vendor can meet the specifications of those services,\" Vitale said. \"They make that case to a committee here in the system, and the committee determines whether or not the standards for sole-sourcing have either been met or not met. If they are met, the board is briefed on the sole-sourcing prior to the board voting,\" Vitale said. Vitale said the board was satisfied that Byrd-Bennett had no conflict of interest in the SUPES contracts because she no longer worked for the firm. But Vitale said when the board approved the deal there was enough public comment and noise about the nature of the contract that he agreed with the CPS inspector general \"that he should look into it.\" The internal investigation gave way to the federal probe. Since those initial statements, however, Vitale has declined to comment further. So has Ruiz, who was named acting schools CEO after Byrd-Bennett took a leave of absence. The other board members who voted for the deals did not respond to Tribune inquiries or said little. \"Id really rather not talk about it,\" said Andrea Zopp, a school board member and former prosecutor who last week announced her bid for the 2016 Democratic nomination for U.S. Senate. \"Theres a lot in the public record on this already.\", Byrd-Bennett also has declined to answer Tribune questions. Solomon confirmed through a spokesman that he played a role in Emanuels selection of Brizard but has declined to answer further questions. Swanson, now a vice president at the Joyce Foundation, declined to answer questions. Her attorney said Swanson was cooperative with authorities and is not a subject of their investigation, only a witness. Anichini, the head of the public education fund, has been interviewed by federal authorities who told her she is only considered a witness in the investigation, said fund attorney Paul Langer. Federal authorities have declined to explain the nature of their investigation, though attention has focused on the connections between Byrd-Bennett and Solomon, who also owns two other education firms that have had CPS business. Armed with grand jury subpoenas, investigators have swept up public records related to the contracts and Solomons firms. Prosecutors have also subpoenaed CPS records related to Byrd-Bennett and three of her top aides at CPS  Tracy Martin, Sherry Ulery and Rosemary Herpel. The path to Chicago, The four have had a long history together, dating back to Byrd-Bennetts days as CEO of the Cleveland public schools from 1998 to 2006. In Cleveland, Martin and Ulery worked directly for Byrd-Bennett at the school system while Herpel ran an education nonprofit that supplemented education initiatives at the district. When Byrd-Bennett left Cleveland to run an education nonprofit in Washington, D.C. the three followed her to new school-related jobs in that city. Such activity is common in the close-knit world of school reform, said Michelle Rhee, the former D.C. school chancellor who hired Martin and Ulery for her staff. Rhee, a prominent figure in the education reform community, said she made the hires at the suggestion of Byrd-Bennett, whom she knew by reputation. \"It is a very small circle of folks,\" Rhee explained, adding that it is common for education leaders to bring trusted aides with them when moving from job to job. \"Its like a football coach. You bring your (assistants) with you.\", Detroit was the next stop for Byrd-Bennett and her three associates. In May 2009, Byrd-Bennett signed an $18,500-a-month contract with an emergency financial manager to become the chief academic and accountability auditor for the citys struggling public school system. Less than a month later, records show, Martin, Ulery and Herpel all had signed consulting agreements with the Detroit system. They were paid through Byrd-Bennetts office, with Martin and Ulery each earning nearly $16,000 a month and Herpel $11,000 a month, Detroit school district records show. The paths of Byrd-Bennett and Solomon also crossed in Detroit. Synesi Associates, Solomons education consulting firm, and PROACT Search, his executive recruiting firm, got business from Detroit schools after Byrd-Bennett arrived on the scene. And eventually, Byrd-Bennett left the Detroit job to work for Solomon at SUPES. Teaching scandal to consulting career, Solomons career in education had its roots in the Chicago suburbs and dates back to 1992 when he taught at Niles West High School in Skokie. He became an administrator at Niles West, but in 1999 the district suspended him with pay after he was accused of sending sexually explicit emails to students and other inappropriate behavior. Solomon resigned but was never criminally charged in the matter. He fought the district over his suspension and the district agreed to pay him $50,000 to settle the case. After Niles West, Solomon eventually was hired as vice president of sales for the test preparation firm The Princeton Review. One of his clients in that job was the Philadelphia school system, then run by former Chicago schools CEO Paul Vallas. Solomon came to develop an on-again, off-again relationship with Vallas. While still working at Princeton Review, Solomon launched a education consulting firm that touted itself as connected to \"the Vallas model\" of school reform. Vallas, who had no formal links to Solomons firm, chastised the consultant for trying to capitalize on Vallas reputation. Vallas, however, got over his annoyance. He took Solomon with him as a consultant when Vallas moved to Louisiana to rebuild a school district battered in 2005 by Hurricane Katrina. By 2008, Vallas was recommending to school officials in Peoria that they hire another Solomon-run consulting firm to improve school performance in that central Illinois city, according to an account published that year in the Peoria Journal Star and a spokesman for the Peoria school district. No contract was ever signed in Peoria and Vallas disputed the assertion that he had pitched work specifically for Solomons firm. Vallas, who later returned to the Chicago area and unsuccessfully ran for Illinois lieutenant governor last year, said he and Solomon stopped working together in 2010. Vallas declined to explain why. But by then, Solomon had found a path to get consulting work in Detroit, where Byrd-Bennett was helping run the schools. Within a year Byrd-Bennett had joined SUPES as senior adviser and master teacher, and in December 2011 Emanuel and education fund officials announced SUPES would launch a pilot training program in Chicago. Tribune reporters Bob Secter, Bill Ruthhart and Juan Perez Jr. contributed. dheinzmann@tribpub.com, jcoen@tribpub.com, jchase@tribpub.com]", "Date": "20150521", "Author": "[ David Heinzmann, Jeff Coen, John Chase]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-chicago-school-board-contract-met-20150521-story.html", "Title": "[ CPS principal training deal got green light despite red flags ]"}