{"Content": "[ Chicagos Northwestern Memorial HealthCare is expanding west, entering an agreement with KishHealth System, a smaller hospital system in DeKalb. Talks between the healthcare providers began in late May, when Northwestern Memorial and KishHealth System signed a letter of intent to \"explore an affiliation.\", Come Wednesday, they announced a deal. During our discussions with KishHealth System, we were impressed with their desire to expand clinical innovation and breakthrough research to patients in DeKalb County and northern Illinois, Dean M. Harrison, Northwestern Memorial HealthCares president and CEO, said in a statement. KishHealth, a nonprofit system, has two hospitals: the 98-bed Kishwaukee in DeKalb and 25-bed Valley West in Sandwich. It also has several outpatient centers. The deal comes about a year after Northwestern Memorial combined with Winfield-based Cadence Health, which owns Central DuPage and Delnor hospitals. Northwestern Memorial is primarily known for its 894-bed academic medical center in Chicagos Streeterville neighborhood. The system also includes a hospital in Lake Forest. By joining Northwestern Medicine, we will be able to bring an expansion of resources and opportunities for advanced care to the communities we serve, Kevin Poorten, KishHealths president and chief executive, said in a statement. Poorten will stay on as president of KishHealth System. Northwestern Memorial Hospital gained approval Tuesday to double the number of operating rooms in its new, downtown Chicago outpatient center to keep up with increasing demand for surgeries. The hospital met before the Illinois Health Facilities and Services Review Board, asking to increase the... Northwestern Memorial Hospital gained approval Tuesday to double the number of operating rooms in its new, downtown Chicago outpatient center to keep up with increasing demand for surgeries. The hospital met before the Illinois Health Facilities and Services Review Board, asking to increase the... KishHealth reported revenue of $221.7 million for the year ended April 30, 2014, a decline of 2.4 percent from 2013. Northwestern HealthCare, a nonprofit company, had revenue of $2.4 billion for the year ended Aug. 31, up 42 percent from 2013. , asachdev@tribpub.com, Twitter @ameetsachdev]", "Date": "20150805", "Author": "[ Ameet Sachdev]", "Link": "http://www.chicagotribune.com/business/ct-northwestern-kishhealth-0529-biz-20150528-story.html", "Title": "[ Northwestern, KishHealth System partnering]"}