{"Content": "[ Republican Gov.-elect Bruce Rauner on Monday dismissed the idea of holding a special election for Illinois comptroller following Judy Baar Topinkas death, saying a legal analysis by the attorney general makes it clear he can appoint a replacement to serve out the entirety of her new four-year term. Rauners statement followed Democratic Attorney General Lisa Madigans legal interpretation that stated Topinkas death created two vacancies  one for the remaining month of her current term that could be filled by outgoing Democratic Gov. Pat Quinn, and a second for the term beginning Jan. 12 that Rauner could fill. Still, the attorney general argued that Rauner and lawmakers should pass legislation that would allow voters to pick a new comptroller during the next statewide election in 2016, saying its \"undemocratic\" for someone to be appointed to a four-year term. That could potentially set the stage for Illinois to have up to three different comptrollers from now until 2018, though the issue is far from resolved and could end up before the courts. A Rauner spokesman said lawyers for the incoming Republican believe the timing of elections for constitutional officers is set by the state constitution, not law, therefore \"a special election would be problematic.\", \"The imminent legal issue on this matter is settled  there are two appointments to fill the comptroller vacancy,\" said Rauner spokesman Mike Schrimpf. \"The constitution requires that Bruce appoint a comptroller to a four-year term and that is how we plan to proceed.\", Topinkas death so close to the Jan. 12 inauguration of statewide officials sparked a host of legal questions that have yet to be tested regarding Illinois succession provisions. While Madigans analysis provides some guidance, much depends on how Quinn chooses to proceed. The tragic death of beloved Illinois Comptroller Judy Baar Topinka has been followed, predictably, by much speculation about who should replace her and how that person will be chosen. But I believe its more important for us to focus on what Comptroller Topinka was trying to accomplish  eliminating... The tragic death of beloved Illinois Comptroller Judy Baar Topinka has been followed, predictably, by much speculation about who should replace her and how that person will be chosen. But I believe its more important for us to focus on what Comptroller Topinka was trying to accomplish  eliminating... Quinns office was relatively tight-lipped Monday, with a spokesman saying Madigans report is under review. Quinn is unlikely to name a successor for Topinka prior to her memorial service, which is scheduled for Wednesday at a union hall in Countryside. Rauner last week called on Quinn to appoint Topinka chief of staff Nancy Kimme to serve out the remaining month. Kimme also is a top deputy in Rauners transition team. Madigans legal analysis was based on a review of the Illinois Constitution, state laws and documents regarding how the constriction was drafted. She determined that the constitution details \"two distinct scenarios in which the governor is authorized to fill the Office of Comptroller with an appointee  when the comptroller-elect fails to qualify and when the comptrollers office becomes vacant.\", Madigan concluded that Topinkas death last week of complications from a stroke led to both scenarios. The office is currently vacant, but a failure to qualify will not occur until \"an officer-elect cannot be sworn in and thus qualify to begin serving.\", If the old Pat Quinn were around, he would be booking a hotel conference room for a Sunday morning press conference to scream about the shenanigans of a lame-duck governor. That Quinn would roast the lame-duck governor for sliding his former campaign manager into a $175,000-a-year job with a two-year... If the old Pat Quinn were around, he would be booking a hotel conference room for a Sunday morning press conference to scream about the shenanigans of a lame-duck governor. That Quinn would roast the lame-duck governor for sliding his former campaign manager into a $175,000-a-year job with a two-year... Democratic Senate President John Cullerton supports a special legislative session to pass a law to hold a special election for comptroller. mcgarcia@tribpub.com]", "Date": "20141215", "Author": "[ Monique Garcia]", "Link": "http://www.chicagotribune.com/news/ct-lisa-madigan-comptroller-vacancy-20141215-story.html", "Title": "[ Rauner opposes special election for comptroller]"}