{"Content": "[ President Barack Obama has asked Congress to authorize the use of force against the Islamic State, declaring in his State of the Union address: We need that authority. No, he doesnt. Obama has been using force against the Islamic State for six months now. Between his inherent authority as commander in chief and two existing authorizations for the use of military force, he has all the authority he needs to defeat the Islamic State. What is holding Obama back is not the lack of congressional authorization but his own stubborn unwillingness to employ the kind of force his military commander says is necessary to win. So if there is no legal or warfighting reason for Obama to ask Congress for a new Authorization for Use of Military Force, or AUMF, why does he want one?, First, Obama is chafing at having to rely on the legal authorization for a war in Iraq that he repeatedly claimed to have ended. Today, Obama is relying on both the post-9/11 authorization to go after al-Qaida and its affiliates and the 2002 authorization for Operation Iraqi Freedom. Last July, national security adviser Susan Rice said the 2002 AUMF for Iraq was no longer operative, telling House Speaker John Boehner in a letter, With American combat troops having completed their withdrawal from Iraq ... the Iraq AUMF is no longer used for any U.S. government activities. Now Obama is relying on that very AUMF to fight the Islamic State. Awkward. Obama wants Congress to formally declare an end to President George W. Bushs Iraq war by rescinding the 2002 authorization, while passing a new, more limited authorization to fight his new, more limited campaign against the Islamic State. But the idea that the current campaign against the Islamic State is not a continuation of the same war that Bush was fighting is a fantasy. The Islamic State is the same enemy that we fought (and defeated) during the 2007 surge in Iraq and is an offshoot of the same al-Qaida network we have been fighting since the 9/11 attacks. Just because Obama withdrew U.S. combat forces from Iraq does not mean that war ended. Quite the opposite, his withdrawal created the vacuum that reignited the dying embers of the Islamic State  restarting a battle that the U.S. had already won. If we could fight the Islamic State in 2007 under current law, we can fight it in 2015 and beyond. There is no reason to pass a new AUMF for the same conflict, just to give credence to the myth that Obama ended the Iraq war. Vowing that Islamic State forces are \"going to lose,\" President Barack Obama urged Congress on Wednesday to authorize military action against terrorists who are cutting a swath across the Middle East. Yet he ruled out large-scale U.S. ground combat operations reminiscent of Iraq and Afghanistan.\"Im... Vowing that Islamic State forces are \"going to lose,\" President Barack Obama urged Congress on Wednesday to authorize military action against terrorists who are cutting a swath across the Middle East. Yet he ruled out large-scale U.S. ground combat operations reminiscent of Iraq and Afghanistan.\"Im... Second, and more important, Obama wants to tie the hands of his successor with a resolution that prevents him or her from deploying significant ground forces to defeat the Islamic State. He has asked Congress to explicitly state that the new AUMF does not authorize the use of the United States Armed Forces in enduring offensive ground combat operations. Moreover, he wants Congress to declare that the use of military force shall terminate in three years unless reauthorized. This makes Obama the first president in history to formally ask that Congress restrict his authority as commander in chief to fight a war. If Obama chooses to reject the advice of his military commanders and refuses to deploy U.S. forces in offensive ground combat operations, that is his prerogative. But he and Congress have no right to bind the next commander in chief by placing unconstitutional limits on the mission and by imposing an artificial timetable. Congress should refuse to endorse Obamas tepid strategy in Iraq or to impose it on the next president, who will inherit the mess created by Obamas Iraq withdrawal. As Jack Keane, a retired Army general, has pointed out, the threat of Islamic radicalism has increased fourfold on Obamas watch. Iraq and Syria are on fire, Yemen has collapsed, Libya is controlled by Islamic radicals and the Taliban is eagerly waiting on Obama to fulfill his promise to remove all U.S. forces from Afghanistan before he leaves office so it can take advantage of the power vacuum he leaves behind. The next commander in chief will need all the authority and flexibility possible to deal with these and other crises. Some Republicans may still want to try to pass a more robust war authorization, but that would be a mistake. It is not clear that such a resolution could pass. Between efforts of the libertarian right and the antiwar left, any AUMF Congress passes could be even worse than the one Obama put forward by the time it reaches his desk. And even if GOP leaders manage to pass a robust war authorization, it is not clear Obama would sign it. His objective is to restrict presidential authority, not enhance it. If the GOP wants to show anti-Islamic State resolve, the best way to do it is to say no to Obamas self-defeating war resolution. If Obama wants to tie his own hands in the fight against terror, Congress can do little to stop him. But Congress should not codify his disastrous withdrawal from Iraq or allow him to force his successor to fight the terrorists with one hand tied behind his or her back. Washington Post, Marc A. Thiessen, a fellow at the American Enterprise Institute and former Bush administration speechwriter, writes a column for The Washington Post on foreign and domestic policy.]", "Date": "20150217", "Author": "[ Marc A. Thiessen]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-obama-islamic-state-war-authorization-20150217-story.html", "Title": "[ Obama has all the authority he needs]"}