{"Content": "[ How panicked were investors last week about Chinas stock market plunge? Enough to treat the Korean peninsula, a place that was teetering on the brink of war, as a safe haven. Even as policy makers braced for renewed military confrontation between North and South Korea, the won staged a rally. Thats made South Korean assets one of the few bright spots in a dark time for emerging markets. On Aug. 24 alone, investors yanked $2.7 trillion out of developing nations, with Indonesia, Malaysia and Thailand especially hard hit. It matched the violent September 2008 selloff after Lehman Brothers collapsed. Back then, Korea was battered so hard that pundits were calling it the \"next Iceland\" and the \"Bear Stearns economy.\" Now, together with the Philippines, its one of Asias only refuges from chaos. Its not hard to explain why many Asian economies are suffering from Chinas slowdown. Exporters of commodities, who depended on a humming Chinese market, have especially suffered. But why are there such big outliers among battered emerging markets?, The answer is that investors are finally basing their decisions less on herd mentality than nuanced, case-by-case analyses. \"Emerging market investors have become a lot savvier,\" says economist Frederic Neumann of HSBC in Hong Kong. \"Gone are the days where emerging markets were all lumped into one bucket. Today, countries with stronger fundamentals are able to resist the spread of contagion washing over global financial markets.\" Along with South Korea and the Philippines, Neumann notes that even some frontier economies, like Vietnam, \"have weathered global financial turmoil with apparent ease.\", The common link among the success stories is theyve gotten the basics right since Asias 1997 financial meltdown: They have healthier financial systems, greater transparency, stronger banks, sober national balance sheets, and reasonable current- account deficits. Malaysias reckoning, by contrast, is long overdue. The ringgit is trading near 17-year lows because scandal-plagued Prime Minister Najib Razak cares more about staying in power than modernizing the countrys unproductive economy. Meanwhile, Thailands military junta is undoing much of the progress Bangkok made since the late 1990s in strengthening the rule of law. And for all its gripes that Indonesia is being unfairly lumped in with Asias laggards, President Joko Widodos administration is rapidly losing the trust of investors. While theres still time to win it back, Widodos first 315 days in office have been a case study in timidity, drift and lost opportunities. Korea, by contrast, is on the \"more credible side of the spectrum,\" says economist Marc Chandler of Brown Brothers Harriman. Even though Chinas downshift and U.S. interest rate hikes will eventually make a dent, the won was Asias top performer last week. Its 2.7 percent gain almost matched the drop in the Chinese yuan since Aug. 11. Meanwhile, Korean bond yields are falling. It turns out that the worlds central banks had it right last year when they boosted their Korean debt holdings. In 2014, they made up 45.4 percent of the foreign-held portion of Korea Treasury bonds, up from 41.8 percent a year earlier. It may be time to start counting Korea as a developed nation, rather than an emerging market. Korea still faces many challenges, not least of which are its rogue family-run conglomerates. But its macroeconomic performance deserves the recognition its receiving from investors. The same goes for the Philippines. Since 2010, President Benigno Aquino has steadily improved his nations debt position (winning investment-grade ratings in the process), attacked graft and drawn in waves of foreign-direct investment. Last month, reporters asked Philippine central bank governor Amando Tetangco if hes worried about the specter of economic crisis haunting Asia at the moment. \"Theres a herd mentality,\" he said, \"but therell be differentiation.\" So far, hes been proven right. The country formerly derided as the \"sick man of Asia\" has been standing its ground amid market chaos. Risks abound, of course. While South Koreas economic fundamentals are stable -- its growing at a rate of 2.2 percent with a 3.7 percent jobless rate -- its high household debt of $458 billion is a concern. Manila, for its part, faces an uncertain 2016 election, in which Ferdinand Marcos Jr. son of the dictator who ravaged the nation in the 1970s and 1980s, may make a bid for the presidency. History has shown that emerging markets are often just one bad leader away from relapsing into chaos.  , For now, the relative stability washing over Korea and the Philippines underscores that steady leadership and long-term thinking matter. It also shows that global investors are getting better at identifying those factors in Asia. , *****, , Bloomberg View columnist William Pesek is based in Tokyo and writes on economics, markets and politics throughout the Asia-Pacific region. For more columns from Bloomberg View, visit http://www.bloomberg.com/view]", "Date": "20150831", "Author": "[ William Pesek, Bloomberg View]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-pesek31-20150831-story.html", "Title": "[ The two big winners from China's big slowdown]"}