{"Content": "[ The good news for Republicans: They have a path to victory in 2016. The bad news for Republicans: They are not on that path. At the moment, they have wandered into a dense thicket and are picking nettles from their skin while being bitten by mosquitoes. The latest instance of self-defeating bushwhacking comes courtesy of the Indiana legislature and Gov. Mike Pence, who this week moved to quell a national conflagration by promising to fix a new state law that allows anti-gay discrimination. But the Hoosier Republicans had already diverted the partys presidential contenders onto a collision course with the American electorate. \"There is simply no way that Republicans can seem like a modern political party with widespread appeal in the New America unless they adjust to the new reality on at least a few of their long-standing policy positions. ... Foremost in this area are gay rights,\" Whit Ayres, the veteran Republican pollster, writes in his new self-published book, \"2016 and Beyond: How Republicans Can Elect a President in the New America.\", Expanding on this point at a breakfast with reporters Tuesday hosted by the Christian Science Monitor, Ayres, an adviser to presidential contender Marco Rubio, said \"we are headed to the point where a political candidate who is perceived as anti-gay at the presidential level will never connect with people under 30 years old.\", After years of fighting with fellow Democrats to improve public school funding in Illinois, former state Sen. James Meeks has switched sides. Hes now chairman of the Illinois State Board of Education, appointed by Republican Gov. Bruce Rauner, whom he endorsed last year over Gov. Pat Quinn. Rev.... After years of fighting with fellow Democrats to improve public school funding in Illinois, former state Sen. James Meeks has switched sides. Hes now chairman of the Illinois State Board of Education, appointed by Republican Gov. Bruce Rauner, whom he endorsed last year over Gov. Pat Quinn. Rev.... Hes right, of course, and the numbers prove it. The problem is that virtually all the GOP presidential candidates, including his client, just put themselves on the wrong side of the issue. As word of Indianas new \"religious freedom\" law began to spread, businesses howled and the state House speaker and Senate president pro tem promised to fix the bill and have proposed an amendment that prohibits service providers from using the law as a legal defense to decline to provide services, goods, facilities or accommodations. Pence supported the amendment to make it clear that \"this law does not give businesses a right to deny services to anyone.\", Alas for Republican 2016 hopes, the leading presidential candidates had already backed the original, discriminatory version of the law. Jeb Bush said people ultimately \"arent going to see this as discriminatory at all.\" Ted Cruz praised Indiana for \"giving voice to millions of courageous conservatives.\" Rubio said \"people have a right to live out their religious faith in their own lives.\" Bobby Jindal, Ben Carson, Rick Santorum and Scott Walker chimed in with supportive statements. U.S. Rep. Aaron Schocks resignation is not only a blow to national Republicans, for whom Schock raised millions, but also to Illinois Republicans. Just eight weeks ago, Schock was widely believed to be next in line to chair the National Republican Congressional Committee. But his rapid fall from... U.S. Rep. Aaron Schocks resignation is not only a blow to national Republicans, for whom Schock raised millions, but also to Illinois Republicans. Just eight weeks ago, Schock was widely believed to be next in line to chair the National Republican Congressional Committee. But his rapid fall from... Ayres had come to breakfast to make the overall case that Republicans need to improve their standing among racial minorities if they are to win the White House in 2016 and beyond. If the GOP nominee doesnt do better than the 17 percent of the nonwhite vote that Mitt Romney got in 2012, he will need 65 percent of the white vote  a feat accomplished only once in modern history, in Ronald Reagans 1984 landslide. Ayres sees the Cuban-American Rubio as a \"transformational\" figure who can fix the problem, but this theme was quickly buried by a series of questions from the reporters about Indiana. They asked Ayres what he thought of the GOP presidential candidates supporting the law. The pollster attempted to argue that \"what you saw ... was support for a man,\" Pence, and confidence in his ability \"to work this out.\", I pointed out that the statements supported the discriminatory law itself. \"I think there are a lot of statements that are going to be made in the course of a long campaign,\" Ayres said. I can see why he would demur. His book acknowledges the nations astonishing shift on gay rights. Support for same-sex marriage is now 55 percent, a doubling over 18 years. As Ayres notes, the shift is \"remarkably similar\" to the change on interracial marriage. The candidates rush to endorse the now-doomed law doesnt even make much political sense  GOP voters place gay issues at the bottom of their list of concerns. Pence, at a news conference late Tuesday morning, repeated earlier claims that the Indiana law was similar to a federal law signed by Bill Clinton in 1993. But even if the laws were the same (Indianas goes further), views of homosexuality in 1993 were the inverse of what they are today. As Ayres writes, \"Public opinion has rendered its verdict on the morality of gay and lesbian relationships. That opinion will not be reversed. The only question is whether the Republican Party will acknowledge and adapt to this new reality.\", Presented with this path to reality, the partys presidential candidates still wander. Dana Milbank is a Washington Post columnist.]", "Date": "20150402", "Author": "[ Dana Milbank]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/opinion/ct-sta-milbank-republicans-st-0403-20150402-story.html", "Title": "[ Republicans are on the wrong side of history]"}