{"Content": "[ When Chicago Mayor Rahm Emanuel led a delegation to Beijing in late 2013, he sealed economic partnerships with eight major Chinese cities  pacts the citys private economic development arm, World Business Chicago, envisioned would position Chicago \"as the location of choice for Chinese companies seeking a North American presence.\", But as Chicago officials jet off to China this week for a four-day trade mission led by Deputy Mayor Steven Koch, it has become clear those pledges of economic cooperation have yet to coalesce into a steady pipeline of large-scale cross-border projects. While the city has snagged some significant Chinese investment in the last year and a half, those transactions appear to have been driven more by market forces than by direct city efforts to lure the investments. Meanwhile, Chinese tourism to Chicago grew by only 4 percent last year, significantly behind the 21 percent growth pace seen in the U.S. as a whole. The Chicago regions exports of goods to China fell 4.4 percent in 2014. And Chinese investment in real estate here pales next to levels on either coast. \"The fact that 18 months has passed and nothing much has happened except by accident is not very impressive,\" said Richard Longworth, author of \"On Global Cities,\" a book published this spring by the Chicago Council on Global Affairs. Chicagos push for greater business ties and tourism are hurt, experts say, by pervasive gun violence in poor neighborhoods and deep-seated financial woes. On Fourth of July weekend, 65 people were shot in Chicago  10 fatally, including a 7-year-old boy. And the city and its public school system have seen their credit ratings slashed to junk status due to massive unfunded pension liabilities. \"I think the city of Chicago needs to be able to portray itself as fiscally sound  I think that is very important to the Chinese government,\" said Steven McClure, president of Opportunity Alliance, a corporate site-selection firm. McClure was the states economic development chief during Gov. Jim Thompsons administration. \"Thats probably the one Chicago is going to have to work on the most.\", Koch, who focuses on business development, will lead the China trade mission. \"These trips are about nurturing and furthering the opportunity for direct investment and job creation here in the city of Chicago and economic opportunities for our companies to sell over in China,\" Emanuel said. This trip comes as Chinas economic rise is cooling and its stock market is sliding downward. Some observers question whether trade missions and cooperation pacts amount to much more than public posturing. \"Yes, they can create new partnerships ... but the potential upside tends to be rather small,\" said Allen Sanderson, an economist at the University of Chicago. In picking where to invest, he said, companies tend to be more influenced by factors such as a citys transportation network, the quality of its labor force, and the level of corporate or personal income taxes. \"In terms of relocation here, weather and crime are tough for Chicago,\" he said. \"One we cant do anything about and the other we dont seem able to do much about.\", Chinese investors also want a good deal of government assistance from cities. \"Government plays a large role in their operations ... so they expect a lot of government hand-holding,\" said Brent Pollina, president of a corporate site selection firm in Park Ridge. Other experts with close ties to Chinese executives think cross-border visits are potentially beneficial. In Chinese culture, developing guanxi, or personal connections, is a crucial first step toward conducting business, said Tracy Xu, co-founder of the China Executive Club, an organization of top executives from Chinese-owned companies with a presence in the U.S. \"So going to China to wine, dine and develop personal relationships, that is a really important first step.\", The outcomes should be measured over a period of years, not months, say experts at the Brookings Institution, a think tank that assists Chicago and other regions with efforts to build global ties as a path to economic growth. \"The culture of the place  how different the systems are  you cant expect immediate results,\" said Marek Gootman, director of strategic partnerships and global initiatives for the Brookings Metropolitan Policy Program. The economic partnerships signed during the December 2013 trip to China already have drawn new Chinese operations to Chicago, Emanuel said, citing eight such projects headed this way, compared with four in the previous year. Many of the projects are modest in scale, including economic development offices for two Chinese provinces. The roster also includes an 11-screen dine-in movie theater planned for the State Street mall in 2016, as well as a North American headquarters for a cloud computing firm slated to employ 150 people. The mayor said it is important to look beyond the existing pipeline. Its also critical to lay the groundwork for future investment, he said, citing the recent visit to Chicago by Jack Ma, co-founder of Chinese e-commerce giant Alibaba. Ma is urging U.S. firms to use Alibaba as a conduit for bringing their products to the Chinese market. \"If youre only looking for things in the channel, thats one thing ... but theres a lot of stuff that provides opportunities for the Chicago area,\" Emanuel said, adding that he has not encountered any resistance from potential Chinese investors due to the citys issues with finances or crime. The trip to China is the latest in a flurry of cross-border visits and meetings hosted during Emanuels tenure and the prior administration of Richard M. Daley, including U.S.-China trade talks held here late last year. World Business Chicago, the publicly supported not-for-profit that serves as the citys business attraction agency, is organizing the trip. Its CEO, Jeff Malehorn, will co-lead the delegation of business executives to meetings in Beijing, Shenyang and Shanghai. The organization declined to disclose the cost of the trip, but said it would be financed by private donations. Chicago officials will make presentations to potential investors and will host a breakfast for alumni of Chicago universities. World Business Chicago and the mayors office declined to share the full roster of events and announcements ahead of the trip. In the 18 months since Chicago signed economic partnership agreements with the eight cities, it saw several significant Chinese investments, including: the Wanda Groups nearly $1 billion project to build a hotel/condo complex downtown, Lenovos $2.9 billion purchase of Motorola Mobility and Chinese participation in the $300 million purchase of the 311 S. Wacker office tower. The companies behind those investments are based in Beijing, according to Rhodium Group, a company that tracks major Chinese investments in the U.S. Only one, the Wanda project, will establish a new business here. Rhodium found no investments coming to Chicago from the other partner cities  Shanghai, Tianjin, Qingdao, Shenyang, Hangzhou, Wuhan and Chengdu. Its database does not include smaller deals. Lenovos early 2014 decision to purchase smartphone maker Motorola Mobility from Google was driven by the tech firms desire for the brand and products, not by its location, a spokesman said at the time. \"Frankly, where Motorola was located was irrelevant,\" Lenovo spokesman Ray Gorman said shortly after the deal was announced. \"If it was in Tennessee, wed still have acquired it.\", Looking to the future, however, Lenovo liked the fact that Chicago has reputable universities and research institutions, and a wellspring of tech talent, Gorman said. World Business had discussions with Lenovo about Chicagos attributes, Malehorn said. World Business Chicago was not involved, however, in Cindat Capital Managements decision to partner with Chicago-based Zeller Realty Group on the purchase of the 65-story office tower at 311 S. Wacker. The Chinese partner invested $50 million. Those two deals involved ownership changes. As such, they dont necessarily signal increases in employment or local investment. In contrast, the planned Wanda Vista hotel/condo tower along the riverfront should create 2,000 construction jobs and 500 permanent jobs, Emanuels office projected. On the upcoming trip, the Chicago delegation is expected to meet with Wanda Group Chairman Wang Jianlin, one of Chinas richest and most influential business people. Chicago landed that project through a combination of happenstance and sales efforts by Emanuel and World Business Chicago, though it is difficult to discern how big a role the city played. Sean Muellers, chief U.S. representative for Wanda, declined comment for this story. Speaking at a recent real estate conference this spring, he said there was no particular significance to the fact that Wanda announced its first U.S. hotel/condo project in Chicago. \"We are looking for opportunities to introduce our Wanda Vista hotel brand to the international and U.S. markets,\" he said. \"We didnt want to limit ourselves as to say, this city first and that city next. It just so happens that this was the first one we executed on, though it was quickly followed by Beverly Hills.\", The company found its Chicago site, and local partner, while here in the fall of 2013 to talk up a stock offering for its AMC movie theater holdings. A broker here told Wanda executives that Chicago-based Magellan Development Group was looking for a high-profile anchor for its Lakeshore East development north of Millennium Park, according to David Carlins, president of Magellan. Wanda checked out the site, vetted Magellan and talked with city officials about the business climate and whether Chicago would be \"Chinese-friendly,\" Carlins said. Wanda will have a 90 percent stake in the building, which has a completion goal of 2019. \"The Wanda thing wasnt a walk-in,\" said Emanuel. \"I object to that characterization. I spent a lot of time on it.\", Aside of the Cindat and Wanda deals, Chicago has attracted very little of the Chinese investment in U.S. commercial real estate, according to Real Capital Analytics, which tracks deals. Investment has been concentrated in New York and major West Coast markets, said Josh Gelormini, vice president in the Americas research group of real estate firm JLL. \"Weve yet to see evidence of true needle-moving purchase activity\" in most other major U.S. markets,\" he said. Meanwhile, Choose Chicago, the tax-supported not-for-profit that markets the city as a tourism destination, is seeing subpar growth in tourism levels from China, in spite of spending about $2 million on the effort since 2012. \"Its not something where you flick the switch and turn it on,\" said Choose CEO Don Welsh, adding that the city has laid the groundwork for growth and he expects to see strong results this year or next. \"If we are not equal or outperforming the national average, we need to clearly look at our strategy and what were doing,\" he said. Finding effective ways to deepen ties with China is critical, said global cities expert Longworth. \"Its a way to get more jobs in Chicago and to build the economy, which presumably will lead to more tax revenue and a happier budget.\", kbergen@tribpub.com, Twitter @kathy_bergen]", "Date": "20150713", "Author": "[ Kathy Bergen]", "Link": "http://www.chicagotribune.com/news/globalcity/ct-china-trip-met-20150713-story.html", "Title": "[ Chicago delegation heads back to China in continued pursuit of economic ties]"}