{"Content": "[ Senate President John Cullerton stepped to the microphone Wednesday at the Thompson Center in the Loop and tried to play statesman in the Springfield stalemate, calling for a do-over on negotiations and suggesting that approving a budget is the most important task at the Capitol. Before Cullerton had even finished, Republican Gov. Bruce Rauners aides had fired off an email to reporters ripping the Northwest Side Democrat as a politician who wants to raise taxes and take Illinois backward. A visibly frustrated Cullerton, in turn, blasted Rauner, saying the first-year governor has missed the \"nuanced\" nature of governing and is stuck on campaign talking points. \"This is a supermajority of Democrats and a bunch of pro-union Republicans in this state,\" Cullerton said. \"This isnt, you know, Oklahoma or Kansas. And so hes got to understand, he ran for governor of Illinois.\", The back and forth illustrates the charged, partisan atmosphere as state government is in its fourth week without full spending authority. Both sides are content to try to win daily news cycles and one-up each other instead of finding common ground. Illinois is more than $4 billion short of the revenues it would need to keep spending at the same level as last year, and Rauner has said he wont negotiate on ways to find the money unless lawmakers first take up his agenda to enact pro-business limits on civil lawsuits and worker injury claims, put term limits on lawmakers, and weaken union influence on municipal hiring and contracting, among other things. Cullerton and Democratic House Speaker Michael Madigan largely ignored those items and instead passed a budget that was billions of dollars short. Rauner, whose own budget blueprint was billions short, last month vetoed most of what lawmakers sent him. The budget battle continues. Need we say more? July 22, 2015. (WGN-TV), The budget battle continues. Need we say more? July 22, 2015. (WGN-TV), Still, as Cullerton noted Wednesday, more than half of what the state spent last year continues to go out the door as usual because many budget items are required to be paid, either by law or by court order. Left on the outside for now are state universities, social service providers and poor people who rely on government health care. Without a spending plan in place, there is no authority to make those payments. On Wednesday, Cullerton said Rauner should put forward a new spending plan. \"His plan is dead, our plan is dead,\" Cullerton said. \"Lets acknowledge that. Lets start moving forward.  The most important thing to do is pass a budget, and hes got to understand that.\", But as Cullerton was making his case at a news conference in Chicago, a Rauner spokesman was busy rebutting the idea. \"President Cullerton made clear today that his view of a balanced budget is a budget that makes no spending reforms, no pension reform and only raises taxes,\" Rauner spokesman Lance Trover wrote in a statement that landed in reporters inboxes midway through the Cullerton news conference. \"Rather than moving our state backward to the failed tax-and-spend policies of the past, we urge President Cullerton to work with us to pass meaningful structural reforms to change the fiscal trajectory of our state.\", The war of words continued at the Capitol on Tuesday, with Republican Gov. Bruce Rauner accusing Democratic House Speaker Michael Madigan of purposely standing in the way of a budget deal in order to create enough chaos to force a tax increase. The comments represent the first-year governors latest... The war of words continued at the Capitol on Tuesday, with Republican Gov. Bruce Rauner accusing Democratic House Speaker Michael Madigan of purposely standing in the way of a budget deal in order to create enough chaos to force a tax increase. The comments represent the first-year governors latest... Senate Republican Leader Christine Radogno dismissed the idea of a reset on the budget, saying the problem is Democrats refusal to take Rauners legislative agenda seriously. \"I really dont think we need another document to get this discussion rolling again,\" Radogno said. \"The budget piece of this is the easy part of the problem. Thats a math problem.  We need engagement on the reforms.\", The continued bickering is another sign of how far apart Rauner and Democrats are, even as the new governor has tried to isolate Madigan as the only person standing in the way of a compromise. On Tuesday, Rauner told reporters that if he and Cullerton could negotiate a deal on their own, \"we would have this done.\", Asked about that Wednesday, Cullerton said: \"I dont know what hes talking about.\", kgeiger@tribpub.com, Twitter @kimgeiger]", "Date": "20150722", "Author": "[ Kim Geiger]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-cullerton-state-budget-met-20150722-story.html", "Title": "[ Cullerton tries to play statesman, ends up in budget muck]"}