{"Content": "[ Republican U.S. Sen. Mark Kirk on Friday acknowledged he got \"carried away\" earlier this week when he accused President Barack Obama of wanting Iran to get nuclear weapons as part of a multinational agreement with the Middle Eastern nation. Appearing at an unrelated event, Kirk said his remarks to Boston radio station WRKO were simply an outgrowth of his attempts to keep the U.S. from getting entangled in a nuclear conflict in the Middle East. \"Actually, (Obama) doesnt want to get nukes,\" Kirk said when asked about the Tuesday radio interview. \"That was me being too carried away with, Ive been pretty angry about the Iran deal.\", During that radio interview, Kirk said Obama wants \"to get nukes to Iran.\" The senator also referred to the president as \"Barack Hussein Obama,\" a characterization some detractors use. Kirk, a leading critic of the Obama administrations efforts to reach a nuclear deal with the Islamic Republic, faces a difficult re-election fight in 2016. Democrats were quick to pounce on the latest in a string of controversial remarks from the first-term Republican. U.S. Rep. Tammy Duckworth, whos running for the Democratic nomination to challenge Kirk, sent out an email to supporters calling Kirks comments \"over-the-top\" and saying \"Kirks repeated inflammatory comments prove hes no moderate.\" The Duckworth campaign also has sent out fundraising emails centered on Kirks comments. Republican U.S. Sen. Mark Kirk, a chief critic of efforts by the White House to strike a nuclear agreement with Iran, condemned the Obama administration-led deal announced Tuesday as an approach that will \"enrich and empower\" a country that is \"the worlds foremost sponsor of terrorism.\", But the... Republican U.S. Sen. Mark Kirk, a chief critic of efforts by the White House to strike a nuclear agreement with Iran, condemned the Obama administration-led deal announced Tuesday as an approach that will \"enrich and empower\" a country that is \"the worlds foremost sponsor of terrorism.\", But the... Democratic Senate candidate Andrea Zopp, the former head of the Chicago Urban League, also criticized Kirks remarks in a fundraising email. \"Reasonable people can disagree about the merits of this agreement. But to suggest that President Obama actually wants Iran to have nuclear weapons? Thats just inappropriate and wrong.\", The Iran flap is the latest in a string of Kirk comments that have generated blowback. Last month, a live microphone at a Senate committee meeting caught Kirk telling a colleague that South Carolina Republican Sen. Lindsey Graham, a bachelor, is \"a bro with no ho. Thats what wed say on the South Side.\", In an April interview with the Peoria Journal Star, Kirk called for the state to help African-American entrepreneurs to help spur \"a class of African-American billionaires.\" Kirk said that \"would really adjust income differentials and make the diversity and outcome of the state much better so that the black community is not the one we drive faster through.\", Days after President Obama announced a milestone nuclear agreement with Iran, the administration seems to be winning Round One against Republican congressional opponents. Not only are Republicans having difficulty securing the half-dozen Democratic Senate votes they need in a resolution of disapproval,... Days after President Obama announced a milestone nuclear agreement with Iran, the administration seems to be winning Round One against Republican congressional opponents. Not only are Republicans having difficulty securing the half-dozen Democratic Senate votes they need in a resolution of disapproval,... Kirks Iran comments came during a news conference at Chicago police headquarters. The senator appeared with police Superintendent Garry McCarthy and Cook County States Attorney Anita Alvarez to tout the work of a fugitive task force funded by federal money and to talk about a piece of legislation hes sponsoring to toughen laws against gun trafficking. Kirk noted that the gun trafficking proposal will have a difficult time getting passed in the Senate because the National Rifle Association opposes it. jebyrne@tribpub.com, Twitter @_johnbyrne]", "Date": "20150717", "Author": "[ John Byrne]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-mark-kirk-obama-iran-comments-met-0718-20150717-story.html", "Title": "[ Kirk says he got 'carried away' in Obama Iran 'nukes' comments]"}