{"Content": "[ Donald Trumps self-destruction will soon manifest itself in a drop in the polls. The problem remains for those GOP voters still seeking a candidate who is a viable alternative to Jeb Bush. It is not likely to be Sen. Ted Cruz, R-Texas, who has been outshone by more credible candidates and again showed bad judgment in trying to ingratiate himself with Trump. Sen. Rand Paul, R-Ky. seems practically irrelevant to the race, and his preference to let the Obama administration negotiate with Iran rather than press for sanctions may be the death knell of his effort. Who then stands to benefit from the end of the Trump boomlet?, Rubio, Sen. Marco Rubio, R-Fla. is one of several. In his recent trip to Iowa, he continued to demonstrate mastery and common sense on foreign affairs. On the National Security Agency, he is sober: This country has lost access to valuable intelligence at a time when we can least afford it, and (the massacre in Chattanooga, Tenn.) is an example of it. ... Radical jihadists have reached our own country, and they are reaching it online and they are radicalizing people here. And we need to know as much about them as possible to prevent future attacks, or were going to have more of them. His best argument for his candidacy may be that the mess President Barack Obama leaves behind will take tremendous skill, knowledge and nerve to undo. (The next president of the United States has to be committed to intelligence programs, to cyber defense capabilities, someone thats committed to a strong foreign policy in which our allies trust us.) In the debates, Rubio will have a chance to show he can throw a punch and take one. His encyclopedic knowledge of policy will serve him well. He wont need to cram for the debates, only sharpen his answers to fit in tight time limits. Perry, In the aftermath of the Trump train wreck, former Texas Gov. Rick Perry may also grab a large share of disaffected Republicans. He has avoided pandering on the Confederate battle flag, has been critical but sober on the gay marriage decision and has stood up to Trump well before the latter attacked a war hero. He smacked him down when he called Mexican immigrants rapists, and on Meet the Press he gave no quarter: I dont think he has the character or the temperament to hold the highest position in this country. He went on to say, echoing his much-praised speech on race, (T)he Republican Party needs to be reaching out to people of different cultures and races and ethnicities, what weve done in the state of Texas. He will need excellent debate performances (in part to replace the memories of 2012), but if conservative GOP alternatives to Bush keep self-destructing, Perry may be the last one standing. Key to his campaign will be showing how his long and successful governorship make him a better contestant than younger, less experienced and less accomplished contenders. Somehow, Donald Trump has a reputation as a \"straight shooter.\" There are any number of examples of people offering this accolade, but my favorite is probably the praise offered by KISS Gene Simmons. \"His children are terrific,\" Simmons said. \"Hes anti-drug, anti-booze. The guy is a straight... Somehow, Donald Trump has a reputation as a \"straight shooter.\" There are any number of examples of people offering this accolade, but my favorite is probably the praise offered by KISS Gene Simmons. \"His children are terrific,\" Simmons said. \"Hes anti-drug, anti-booze. The guy is a straight... Walker, There is also Wisconsin Gov. Scott Walker, who had the quickest start of any candidate and has struggled since, confounding conservatives otherwise receptive to his candidacy by zigzagging on issues such as ethanol, a constitutional amendment on gay marriage and even the Boy Scouts. (Reihan Salam speaks for many who worry that instead of offering a serious and substantive reform agenda, Walker will simply tell the most vocal pressure groups within the Republican coalition what they want to hear.) Through no fault of his own, Walkers announcement week was partially overshadowed by Trump (whom Walker would not criticize until Trump imploded). The first debate offers the best chance for Walker to turn the corner on these problems, show he can withstand scrutiny and come through as ready for the national stage. If he can stanch the flow of clarifications of his remarks and pair his pugnacious tone with smart policy, he will be a threat. The good news is that no one candidate will have to talk for very long; the bad news is that a gaffe will be hard to conceal. Bush, And finally, there is Bush himself. He benefits so long as a pack of opponents carve up the vote, with no single standout. He benefits if candidates cede him the moderate, mainstream voters and fight one another just for the most conservative part of the base. He still has to show he can rev up his party, connect emotionally with voters and convince voters that being inclusive does not mean being a squish on the issues. His wonkishness is an asset but cant get in the way of sharply enunciated positions. The debates will test him insofar as he may be the target of a pile-on as competitors vie to show how conservative they are by attacking Bush. He will need to be specific and non-defensive  no easy task in a crowded debate with multiple candidates gunning for him. We may go through this cycle for many months: One newcomer or lesser-known figure rises, gets attention, stumbles and loses support that shifts to one or more other candidates. The trick for Bush is to hold and expand his support, and for one opponent to consolidate the not-Bush vote. We are a long way from either happening. Washington Post, Jennifer Rubin writes the Right Turn blog for The Post, offering reported opinion from a conservative perspective.]", "Date": "20150720", "Author": "[ Jennifer Rubin]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-trump-popularity-rubio-walker-bush-perry-20150720-story.html", "Title": "[ Who will flourish after Donald Trump self-destructs?]"}