{"Content": "[ Was I alone in having my heart jump when, this past Sunday, I read in Maureen Dowds column in The New York Times that Vice President Joe Biden is seriously contemplating getting into the presidential race? According to Dowd, Bidens son Beau, shortly before his death, told his father he must do so. \"He tried to make his father promise to run,\" Dowd writes, \"arguing that the White House should not revert to the Clintons and that the country would be better off with Biden values.\" Another of the Biden sons, Hunter, is supposed to have added, \"Dad, its who you are.\", Although I have a fairly good idea of who Joe Biden is, I havent the least notion what \"Biden values\" might be. But the thought of a presidential race between Joe Biden and Donald Trump, currently the leading Republican candidate in all the major polls, gets my pulse racing. Is it possible? Might it be that Hillary Clinton will win yet another Miss Uncongeniality contest with voters and give way to Biden as the Democratic Party candidate, and Trump will emerge from the rugby scrum of Republican candidates to represent the Grand Old Party? What a thought, the two men going, so to say, hair to hair, the worlds most preposterous comb-over (Trumps) going up against the worlds most egregious hair plugs (Bidens), two of the most patently vain and blatant men in the country fighting it out for that goldenest of gold rings, the presidency of the United States!, \"A national political campaign,\" wrote H.L. Mencken, \"is better than the best circus ever heard of, with a mass baptism and a couple of hangings thrown in.\", A Biden-Trump campaign, though, would have been beyond Menckens wildest imaginings. The thought of Donald Trump, for whom, as the Jews say, whats on his lung is on his tongue, and Joe Biden, whose most memorable political utterances have been made with his foot in his mouth, in debate surpasses any possible reality show. One can hear it now: On the subject of Vladimir Putin, Biden would offer to arm-wrestle him, Trump to buy him out. On the Islamic State, Biden would offer to continue President Barack Obamas policy, once he was informed what it is; Trump would put up a wall around the whole of the Mediterranean. The presidential debates would of course be moderated by Barbara Walters, who could be counted on to ask lots of personal questions. This Thursday, Republicans will stage their first presidential debate, with Fox News picking the top 10 of the 17 announced candidates on the basis of their standing in the polls. By todays count, Donald Trump, the current poll leader, will stand center stage, flanked by Jeb Bush and Scott Walker... This Thursday, Republicans will stage their first presidential debate, with Fox News picking the top 10 of the 17 announced candidates on the basis of their standing in the polls. By todays count, Donald Trump, the current poll leader, will stand center stage, flanked by Jeb Bush and Scott Walker... The names the two men would be likely to call each other! Nothing would be out of bounds. Bare knuckles would be the order of the day. Trump would point out that Dr. Jill Bidens doctorate is in education, which, as everyone knows, is a joke. Shes no doctor, he might likely point out, as John McCain is no hero. Biden would make breast-pump jokes, capped teeth flashing. Trump would accuse Biden of never having met a payroll. Biden would accuse Trump of never having met a woman who wasnt a bimbo. The political cartoonists would be put to work overtime, which has to be good for the economy. A fine time would be had by all. The campaign itself would set a new low, which might not be a bad thing. Vladimir Lenin, when informed that they were killing workers in Germany, is said to have remarked, \"Good. Worse is better.\" By which he meant the worse conditions were, the sooner the revolution would come about. So, too, with a Biden-Trump campaign  so vulgar, vile and horrendous would it be that the sad circus of American political campaigns would soon have to be drastically revised. Worse  make that \"worst\"  which a Biden-Trump presidential race would obviously be, could only result in a radical reform of American electoral practices, which would mean better days down the line. Debating Donald Trump is like boxing with smoke. You may have the facts on your side, but for this Republican presidential candidate, facts are mostly beside the point. Take, for example, his recent slap at President Barack Obamas legacy. Americans wont elect another black president for a long... Debating Donald Trump is like boxing with smoke. You may have the facts on your side, but for this Republican presidential candidate, facts are mostly beside the point. Take, for example, his recent slap at President Barack Obamas legacy. Americans wont elect another black president for a long... The question, though, is how far does the line run. The delightful prospect of a Biden-Trump presidential campaign does, true enough, overlook one important item: the fact that, whoever won, the country would be likely to go a long way down the tubes. With one or another of these clownish men at the helm of the ship of state, civil discourse would be the first item thrown overboard. Sharks round the world would lick their chops. The United States would become an international laughingstock. Even old Henry Mencken, were he alive, would be embarrassed. Joseph Epstein is an essayist, short-story writer and a former lecturer at Northwestern University. \"Essays in Biography\" is his latest book.]", "Date": "20150804", "Author": "[ Joseph Epstein]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-biden-trump-president-campaign-2016-hillary-clinton-perspec-0805-jm-20150804-story.html", "Title": "[ A Biden-Trump campaign would set a new low  which might be good]"}