{"Content": "[ \"No free man shall be seized or imprisoned, or stripped of his rights or possessions, or outlawed or exiled, or deprived of his standing in any way, nor will we proceed with force against him, or send others to do so, except by the lawful judgment of his equals or by the law of the land.\",  Magna Carta, Clause 39, June 15, 1215, , King John was a bully, the barons rebellious. Recall from World History that they met along the River Thames at a meadow called Runnymede. Their creation, Latin for Great Charter, likely drew its name from its sheer size: It was a peace treaty of 63 often wordy clauses enshrining the notion that law controls the power of government, not the other way around. Since that moment 800 years ago Monday  arguably the birth date of our freedoms  Magna Carta has inspired many constitutions, and one revolutionary Declaration of Independence, across the worlds democracies. This Carta is so Magna that well-schooled admirers dont use \"the\" in front of its name. Like Plato and Beyonce, Magna Carta has the juice to command its own nomenclature. Yet smart historians dont exaggerate; they use squishy verbs such as \"influenced\" and \"shaped\" to describe Magna Cartas clout over subsequent documents it inspired: Architects of liberty in later centuries didnt copy many principles of Magna Carta verbatim into their own writings. Rather, Magna Carta set a lasting tone: You may be king, or prime minister, or president. But you cant run roughshod over your people. An earthly power outranks you. This power  the spirit and fact of individual freedoms  gives Magna Carta its uniqueness, its long shadow and its superiority to the often phony guarantees in many authoritarian nations constitutions. By the year 1215 democracy was an ancient concept, and several lands  England included  had codes by which rulers supposedly granted liberties to their subjects. Yet these codes often were mere eyewash; monarchs could treat subjects as they pleased. Magna Carta unified concepts of personal liberty but, crucially, added the notion that these rights didnt come from the king: Instead, each nobleman at Runnymede had rights more fundamental than any ruler could provide or override. (King John struck his bargain with aristocrats he wanted to pacify because he couldnt defeat them militarily; the modern notion that all men and women are created equal, et cetera, is a weak theme in this seminal document.), Writing in The Wall Street Journal, Daniel Hannan, a British author and member of the European Parliament, synthesizes Magna Cartas radical gift to Western civilization: \"It takes a real act of imagination to see how transformative this concept must have been. The law was no longer just an expression of the will of the biggest guy in the tribe. Above the king brooded something more powerful yet  something you couldnt see or hear or touch or taste but that bound the sovereign as surely as it bound the poorest wretch in the kingdom. That something was what Magna Carta called the law of the land.\", Theres a distrusting, thou-shalt-not demeanor to Magna Carta  flat-out restrictions to what the king or his government can do. The barons wouldnt risk expressing their freedoms in platitudes that King John could interpret as he wished. Imprecision had helped render earlier assurances of rights meaningless. Medieval historian David Carpenter of Kings College London writes that, \"Essentially, what happened in 1215 was that the kingdom turned around and told the king to obey his own rules.\", As Americans we should care deeply about that, even if we give Magna Carta little thought after we leave our last classroom. That bottom-up idea of the people controlling their government, ahem, \"influenced\" or \"shaped\" provisions of our U.S. Constitution and Bill of Rights  property rights, habeas corpus, church rights, limits to taxation. The temptation is to over-read Magna Cartas literal impact. It inspired more freedoms than it enumerated. Example: Yes, the clause atop this editorial evoked trial by jury ... even though, in King Johns day, there was no such thing as a criminal court jury. Read the document, at chicagotribune.com/magna, and youll find many freedoms we enjoy today  in some cases explicit, but in other cases only written between these lines of ink on parchment. If Magna Carta doesnt specify all our freedoms, it symbolizes and suffuses our rights as individuals confronting the often capricious authority of the state. Some of its clauses codified soaring liberties; others addressed prosaic but crucial topics: The British Library notes provisions that standardized weights and measures  and that protected widows from being forced to remarry against their will. Eight hundred years ago Monday, then, the concept that the rule of law rises upward from the people, and that each of us has rights that a majority of our fellow citizens cannot take from us, became a certifiable part of Englands  and thus Americas  heritage. In a November speech, U.S. Supreme Court Justice Antonin Scalia marveled at Magna Cartas long reach: \"It is with us every day.\", That its tenets survive owes less to a bully king and rebellious nobles than to the diligence of many generations. Those of us who value liberty owe an incalculable debt to thinkers, leaders and common citizens who made Magna Carta a model for modern guarantees of freedom. We repay our forebears by keeping the powers of government from overwhelming the rights we have inherited. Only if we, too, do so will Magna Carta extend its reign for untold centuries to come.]", "Date": "20150612", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-magna-carta-800-runnymede-freedom-liberty-constitution-edit-20150612-story.html", "Title": "[ Freedom's birth certificate: 800 years of Magna Carta]"}