{"Content": "[ Iraqs prime minister, Haider al-Abadi, is taking severe steps to rid himself of his troublesome predecessor, Nouri al-Maliki. On the heels of government shakeup, the latest move is a parliamentary report blaming al-Maliki and many of his political and military leaders for the fall of Mosul to Islamic State last summer. The report is going to be referred to a public prosecutor which means al-Abadi may be plotting to bring a criminal prosecution. Al-Maliki is fighting back, issuing a public statement repudiating the report. Given that al-Maliki had more domestic support than al-Abadi when the U.S. with grudging Iranian acquiescence, forced al-Maliki out of office, its no surprise that al-Abadi would like to consolidate his authority by purging al-Maliki completely. But beyond an interest in the Byzantine manipulations of Iraqi politics, why should the rest of the world care about al-Abadis move or al-Malikis displacement?, The answer lies in the effects of the U.S.-Iran deal, which is now before Congress but is being treated by regional actors as a fait accompli. Abadis move on al-Maliki reflects, through a glass darkly, the realignment of regional politics in light of the Iran deal. Where once al-Maliki was perceived as pro-Iran by Iraqi Sunnis and the U.S. today al-Abadi is pursuing a new approach in which,he is betting, U.S. and Iranian interests will be closely aligned, and maintaining a multi-sectarian, unified Iraq is no longer an inviolable goal. And the Iranians, having abandoned al-Maliki to his fate, seem to be on board. To see whats going on, consider the challenge that al-Maliki faced, and failed at, in dealing with Islamic State. The fall of Mosul is emblematic. The Iraqi army, a mixed Shiite-Sunni force, collapsed disastrously, as the parliamentary report emphasizes. The reason for that failure was more than technical. Shiites in the army might have been loyal to al-Maliki, but they didnt relish the idea of dying in defense of the mostly Sunni city. As for Sunnis in the army, theyd become so disillusioned by the impression that al-Maliki was running Iraq on Irans behalf that they were unwilling to stand and fight against Sunni attackers from Islamic State. In the end, the failure to defend Mosul was a failure of al-Malikis leadership, and of his plan to keep Iraq unified under Shiite control. While you might think the Iraq war would be the last thing Jeb Bush would want to talk about, given the fact that his brothers war was probably the single greatest foreign policy catastrophe in U.S. history, and that Jeb Bush himself spent weeks trying to figure out whether he should say it was... While you might think the Iraq war would be the last thing Jeb Bush would want to talk about, given the fact that his brothers war was probably the single greatest foreign policy catastrophe in U.S. history, and that Jeb Bush himself spent weeks trying to figure out whether he should say it was... To be sure, al-Abadi hasnt yet done any better than al-Maliki in resisting the jihadists. In May, under al-Abadis prime ministership, Ramadi fell, just as ignominiously and easily as Mosul the previous year. But al-Abadi seems to be contemplating a different way of addressing the problem than that adopted by al-Maliki. His strategy appears to have two prongs, both of them premised on growing U.S.-Iran cooperation. First, al-Abadi embraces the deployment of Iranian-trained and -led Shiite militias supported by U.S. air strikes against Islamic State. Its been a slow process getting the Americans and the Iranians on the same page, given the mutual distrust. But al-Abadi seems to think, with some reason, that the U.S.-Iran nuclear deal makes cooperation more likely. In June, al-Abadi went to Iran to urge Supreme Leader Ali Khamenei to continue supporting the fight against Islamic State and he also went to the G-7 meetings in Austria to lobby Barack Obama for more support. Hes urged the U.S. to do more to train Iraqi army units, and welcomed the deployment of U.S. advisors, who might do even coordinate with Iranian-led forces. By passing the Iran Nuclear Agreement Review Act with enough votes to overcome a veto, Congress ensured that it would have the opportunity to review and vote on the nuclear agreement with Iran. Now that the Obama administration has reached what it believes to be an acceptable agreement, it is Congresss... By passing the Iran Nuclear Agreement Review Act with enough votes to overcome a veto, Congress ensured that it would have the opportunity to review and vote on the nuclear agreement with Iran. Now that the Obama administration has reached what it believes to be an acceptable agreement, it is Congresss... Its optimistic to think that combined U.S. and Iranian efforts would actually defeat Islamic State in Iraq. That cant be done without Sunni Arab ground troops, and al-Abadi has no clear way to create such a force. But al-Abadi, unlike al-Maliki, plans to avoid taking the blame if the fight against the jihadists falters because he is striving to show both sides, the U.S. and Iran, that hes trying to get them all to help him in the war. In other words, al-Abadi, hedging against continuing failure to beat Islamic State, is relying on a deepening alignment of U.S.-Iranian interests. Al-Abadi has another thing al-Maliki lacked: a fallback strategy for what to do if Islamic State is here to stay in the medium-term in Iraq. Al-Abadi is signaling to Iraqi Shiites, as well as to Iran and the U.S. that he can govern a rump state of Iraq, one that effectively excludes the jihadist-controlled Sunni areas and recognizes the de facto autonomy of Iraqi Kurdistan. Al-Abadis reform efforts of the last few weeks, in which senior Sunni politicians lost their positions, signaled as much. The position of vice-president of which there were three including al-Maliki himself was eliminated. The parliamentary report assigning blame for the fall of Mosul named two more prominent Sunni politicians, Saadoun al-Dulaimi, the acting defense minister under al-Maliki, and Atheel al-Nujaifi, the former governor of the Nineveh province and brother of Osama al- Nujaifi, one of the fired vice-presidents. The message is that al-Abadi is done with al-Malikis strategy, adopted under intense U.S. pressure, of incorporating Sunni leaders into the central Iraqi government. This change may anger the U.S. since its hard to see how else to placate Sunnis and keep them committed to holding the country together. But it makes sense if Iraq is acknowledged as divided already by the presence of Islamic State in the Sunni-majority areas of the country. In the past, an Iraqi prime minister might have worried about how the U.S. would feel about a Shiite-dominated rump Iraq, which would be something close to an adjunct of Iran. Al-Abadi must be calculating that, having made its own deal with Iran, the U.S. can live with this result as the least-bad outcome because its less threatened by Iran after the nuclear deal. The U.S. would like to defeat Islamic State, and we assume Iran would, too. The big change, however, is that the U.S. may no longer be as committed to a multi-denominational, unified Iraq as a buffer against Iran. Thats the result of a regional changebrought about by the nuclear deal between the U.S. and Iran. Bloomberg, Noah Feldman, a Bloomberg View columnist, is a professor of constitutional and international law at Harvard and the author of six books, most recently \"Cool War: The Future of Global Competition.\", ]", "Date": "20150820", "Author": "[ Noah Feldman]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-iran-nuclear-deal-iraq-war-20150820-story.html", "Title": "[ How the Iran nuclear deal is shaping the Iraq war]"}