{"Content": "[ I am not normal. This, I learned from a news story 35 years ago. The details have faded with the passage of time, but the gist of it remains clear. Some expert had crunched a bunch of numbers in search of the average human being, the planetary norm, and found that she was an 8-year-old Japanese girl, living in Tokyo. I dont fit that profile; Im willing to bet you dont, either. So as a matter of statistical fact, Im not normal and neither are you. Ive always found that story a useful corrective whenever I am tempted to declaim too haughtily on what is or isnt normal. I offer it now to Rush Limbaugh in the vain hope it will help him rethink his assault last week on the woman who used to be Bruce Jenner. Granted, the story was about planetary norms and Limbaugh was ranting about American social norms, but the principle still applies. As you doubtless know, Jenners transformation into a woman named Caitlyn has been quite controversial. She has been praised for her courage by President Barack Obama and called brave by Ellen DeGeneres. At the other extreme, one David French, blogging for the National Review, dismissed her as a surgically damaged man, while a Matt Walsh on Glenn Becks website, The Blaze, called her a mentally disordered man. And we have recently learned that, back in February, Mike Huckabee cracked about wishing he could have identified as female when he was in school so he could have showered with the girls. As inadvertently revealing as that joke feels, it is Limbaughs response that really helps us understand why those who are threatened by, and viscerally angry about, Jenners transformation, feel as they do. As Caitlyn made her debut on the cover of Vanity Fair, the talk show host fumed that Republicans should reject her, even though she identifies with the, ahem, big tent party. Liberals, he complained, are trying to redefine normalcy. He went on to say that nowadays, conservatives and Republicans are the new weirdos, the new kooks, and that is part of the political objective here, in normalizing all of this really marginal behavior. I mean, if less than 1 percent of the population is engaging in it, its marginalized behavior; it isnt normal. It wasnt quite Call me Ishmael, but Call me Caitlyn made a whale of a splash. One could hardly find a news channel the past couple of days that wasnt touting the former Bruce Jenner for her courageous transgender metamorphosis or admiring her gorgeous new look. Within moments of the release... It wasnt quite Call me Ishmael, but Call me Caitlyn made a whale of a splash. One could hardly find a news channel the past couple of days that wasnt touting the former Bruce Jenner for her courageous transgender metamorphosis or admiring her gorgeous new look. Within moments of the release... One might argue, citing Miles Davis, Steve Jobs, Rosa Parks, Stan Lee, Sally Ride, Muhammad Ali, Elvis Presley, and a thousand other rule-breakers and innovators, that normal is overrated. But put that aside, take Limbaugh at his word, and the fear undergirding his complaint becomes plain. He and those like him look at Caitlyn Jenner and wonder: If this is normal, what does that make me?, Its worth noting, in light of Limbaughs fears, that the countrys opinions on social issues like this are shifting, and not in his direction. Gallup recently reported that America is moving sharply left on the moral acceptability of everything from gay rights to stem cell research. Im aware of no polling on Jenners transformation, but who would be surprised to find that there is widespread approval?, Not that freedom should be a popularity contest (most of us agree now that Jim Crow is wrong, but it was also wrong back when much of the country thought it was right), but it is better to have the wind behind you than against you. Ask Limbaugh, who now finds himself pushing against that wind and finding that the only marginal behavior here is his. That must be chilling to a man so obsessed with defining and defending normalcy. He should get used to it. Im all for Caitlyn Jenner living her truth, as I believe the saying goes. Not only for her sake but for the sake of those whove been, perhaps, too slow to get their minds around transgenderism. Its real, not a whim or fetish, and those who experience it deserve understanding, compassion and,... Im all for Caitlyn Jenner living her truth, as I believe the saying goes. Not only for her sake but for the sake of those whove been, perhaps, too slow to get their minds around transgenderism. Its real, not a whim or fetish, and those who experience it deserve understanding, compassion and,... Because these days, what isnt normal is the small-minded need to stigmatize those who walk a different path through life. What isnt normal is the bigots siren call to our basest and most baseless fears. What isnt normal is hatred and terror of the new. Poor Rush. It turns out that what isnt normal, is him. Tribune Content Agency, Leonard Pitts is a columnist for The Miami Herald. lpitts@miamiherald.com]", "Date": "20150608", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-caitlyn-jenner-rush-limbaugh-20150608-column.html", "Title": "[ Rush Limbaugh, you are not normal]"}