{"Content": "[ This one wasnt an episode of \"The Celebrity and the 10 Dwarfs.\" Americans who invested a long Wednesday evening in the Republicans prime-time debate saw several grown-ups challenge an act thats wearing thin. Three conclusions:, Rise of the Not-Trumps. CNNs usually able interviewers had us yearning for Megyn Kelly: With so many questions calculated merely to pit other candidates against Donald Trump, they couldnt help but have trouble emerging from the pack. But several did. We applauded John Kasichs rebellion against the internecine format; if he was at home watching the bickering, Kasich said, hed be tempted to turn off the TV. The American people, he said, were more interested in our enormous national debt and a host of other crucial issues. Nobody eclipsed Carly Fiorina, who somehow managed to give the nights single best answer  twice: In one breath she spoke to the character and defense of this nation, daring Hillary Clinton and President Barack Obama to watch the video of abortion workers preparing to harvest a brain, and discussing the security threat posed by Iran. Her succinct retort to an earlier insult from Trump (\"Look at that face! Would anyone vote for that?\"): \"I think women all over this country heard very clearly what Mr. Trump said.\" Trump was so thrown he offered a ... compliment. Marco Rubios proposal that our legal immigration system should admit people based on economic promise rather than on having relatives here added a nuance to that national debate. Fiorina again: \"Democrats dont want this issue to be solved. They want it to be an issue.\", Despite CNNs inept questions, several candidates got off sharp, substantive answers. None of them came from Donald Trump. His churlish dismissals of Republican rivals Rand Paul, Scott Walker and George Pataki were cheap shots, nothing more. But as Fiorina, Rubio and Kasich performed ably, Walker, Ted Cruz and Mike Huckabee didnt step out from the crowd. Ben Carson? Nice guy, but it didnt happen. Challenges abroad. As a group the Republicans pounded on the theme that America is a militarily weakened and often friendless player overseas. Amid the calls for increased defense spending came demands for shrewder diplomacy  and not only with the Iranians. Rubio struck a nerve when he recalled warning more than three years ago that the U.S. had to support moderate opposition forces in Syria. Stronger American leadership, he suggested, could have prevented the warfare and humanitarian crisis in that country today. GOP presidential hopefuls participate in the CNN Republican debate at the Ronald Reagan Presidential Library and Museum on Sept. 16, 2015. Fiorina crisply articulated an agenda for hemming in the expansionism of Vladimir Putins Russia with modest deployments of soldiers and missile defenses. She also reiterated her promise to make two phone calls on her first day as president: one to assure Prime Minister Benjamin Netanyahu that America stands with Israel, and one to warn Ayatollah Ali Khamenei that until he agrees to nuclear inspections anytime, anywhere, the U.S. will do its best to isolate Iran from the global money system. Among the nights tart exchanges: Trump criticized President George W. Bush for invading Iraq. Jeb Bushs response: \"Theres one thing I know about my brother. He kept us safe.\", The eight-year itch. Only once since Franklin D. Roosevelts reign has one party held the presidency for three terms (the GOP, 1981-1993). One reason: Defeat makes parties hungry for victory. Fresh voices emerge. More than the Aug. 6 debate  it was the best-rated primary debate in TV history  Wednesdays marathon showcased plenty of candidates who clearly enjoy running hard. Democrats, by contrast, have scheduled fewer debates  with only one joust slated for weekday prime-time. With the 2016 election cycle so compactly front-loaded  24 states (Illinois included) will have completed their primaries or caucuses by March 15  swing voters across America are getting many more opportunities to see the Republican outsiders jockeying for a chance at the White House. Or maybe Democratic candidates, eager to hold the presidency, will out-energize these hungry outsiders. Calendar entry: Democrats debate Oct. 13, on CNN. (Please, better questions.)]", "Date": "20150916", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-opinion-republican-gop-debate-trump-bush-rubio-fiorina-edit-0916-20150916-story.html", "Title": "[ Getting beyond Trump: Rise of the Not-Donalds]"}