{"Content": "[ On Aug. 29, 2005, Hurricane Katrina made landfall over southern Louisiana, causing unprecedented destruction along the Gulf Coast and in New Orleans. Ten years later, what can we say we learned?, The Gulf Coast survived. New Orleans survived. Yet the scars run deep  not only for the million people who were displaced by the storm or the families of the 1,833 people who died, but for a nation still struggling with what Katrina says about all of us. About poverty. About our sense of place. About our relationship with nature. About so much more. As a nation we have become good at marking anniversaries as part of our collective healing process. At each arbitrary moment  one year, five years, 10 years  we gather for memorial ceremonies and publicly remember what we lost, expecting it to give us new perspective so we can push forward. But what have we really learned about coping with massive emergencies?, In the practical sense, quite a bit. Disaster experts (yes, sadly in the wake of 9/11, the Indian Ocean tsunami of 2004, Katrina and other catastrophes, there is now a thriving \"disaster industry\") say the U.S. has made crucial progress in disaster readiness. The Department of Homeland Security, created after 9/11 and tested by Katrina, has been refining its national disaster strategy over the years, and continues to do so as priorities and capabilities change. Its first version in 2004 focused heavily on terrorism and laid out a response plan that was too bureaucratic and cumbersome for Katrina. In 2008, the department scrapped the jargon and produced a clear, readable National Response Framework that includes lessons learned from Katrina and superstorm Sandy, which caused massive destruction along the East Coast in 2012. The current version drops the heavy emphasis on terrorism, addresses a broader range of likely disasters and incorporates the many community sectors beside the government that play a role in disaster response  from individuals and non-profits to private businesses. In 2005, the mud and the mold and the stench of Katrina  the hurricane and flood and every bit of human tragedy that the name came to represent  nearly did New Orleans in, and ultimately changed the city in ways were only beginning to understand a decade later. Its been a long recovery since... In 2005, the mud and the mold and the stench of Katrina  the hurricane and flood and every bit of human tragedy that the name came to represent  nearly did New Orleans in, and ultimately changed the city in ways were only beginning to understand a decade later. Its been a long recovery since... A year after Katrina, Congress amended the Stafford Act to address some of the bureaucratic confusion that had muddled the local, state and federal response at the time. The law, which pertains to how federal disaster aid is released to states, now makes it easier to access resources before an anticipated disaster strikes. Despite all of this, its impossible to create a one-plan-fits-all protocol for disaster management. So the challenge is for leaders at all levels to find new ways to coordinate their disaster plans  and to accept that climate change, a booming world population and other forces are causing more large-scale disasters. \"The world is a hell of a lot more complex than it used to be,\" says Thad Allen, the now-retired U.S. Coast Guard admiral who stepped in when FEMA Director Michael Brown was ousted shortly after Katrina hit. Allen advocates for a \"unity of effort,\" which is that holistic community approach spelled out in the National Response Framework. Allen  he was tapped by President Barack Obama to oversee the response to the Deepwater Horizon oil spill in the Gulf of Mexico in 2010 and led the Coast Guards response to the earthquake in Haiti the same year  is now a member of the Department of Homeland Security Advisory Council and an executive at consulting firm Booz Allen Hamilton. Allen spends most of his time consulting with local and national leaders from government, business and non-profit sectors on how to strengthen their communities before the next big disaster hits. This is what Allen and other disaster experts refer to as \"resilience\"  that squishy set of qualities that allows a person or community to bounce back. Think of it as the sociological equivalent of the human immune system. If all of our systems are healthy and working together, the theory goes, well be better able to survive and recover from whatever hits us. The concept has become so hot that, a few years after Katrina, Tulane University created the Disaster Resilience Leadership Academy, which offers a masters degree combining instruction in public health, business, law, architecture and social work. Its tempting to dismiss that idea of resilience as pop sociology, but we see merit in disciplined efforts to nurture it. To achieve \"national resilience,\" as Allen and others emphasized, communities must acknowledge at least three major challenges: their aging infrastructure, the vulnerability of the poor, and environmental issues such as eroding coastlines and rumbling fault lines. Resilience wont stop a hurricane, but strengthening those three areas will put us in better shape to survive and recover from it. Allen likes to talk about C.J. Huff, the now-retired superintendent of schools in Joplin, Mo. in 2011 when an EF5 tornado crushed the city, killed 161 people and destroyed half of its school buildings. In the years before the tornado, Huff had helped launch a successful program called Bright Futures that coordinated efforts by the school district, businesses, faith-based organizations and community members to help meet students basic needs. Those same groups jumped in to help the schools rebuild afterward. As Allen says: \"He built resilience without even realizing it.\", But what about the less-practical lessons from Katrina? Were all still learning. About a week after the storm, then-U.S. Sen. Barack Obama, D-Ill. visited the region and later made this searing observation on the Senate floor:, \"I hope we realize that the people of New Orleans werent just abandoned during the hurricane. They were abandoned long ago to murder and mayhem in the streets, to substandard schools, to dilapidated housing, to inadequate health care, to a pervasive sense of hopelessness.\", Those words echo today, and far beyond New Orleans. In Chicago, Baltimore, Detroit  every city where many citizens lack the mentors and means to build resilience  America is, yes, more ready to cope with sudden disasters. But we dont always deliver on those day-to-day imperatives that come between them: whether people are safe, whether their children have good schools, whether they sleep in decent dwellings, whether they have medical care. We have more to do.]", "Date": "20150821", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-katrina-lessons-learned-new-orleans-fema-obama-sandy-haiti-edit-0824-jm-20150821-story.html", "Title": "[ Katrina and the next crisis ]"}