{"Content": "[ This year an eccentric, famous and wealthy American declared his presidential campaign in front of a large audience, despite a complete lack of political experience. While accepting his MTV Vanguard award during Sunday nights MTV Video Music Awards, Kanye West-who had admitted \"rolled up a little something\" to take the edge off beforehand-said he made a decision to run for president in 2020. \"Its not about me. Its about ideas. New ideas. People with ideas. People who believe in truth,\" he said. \"And yes, as you probably couldve guessed by this moment, I have decided in 2020 to run for president.\" The announcement instantly turned into a meme and something partway between a joke (West is definitely not actually running for president) and a news story (but what if he did). Public Policy Polling, which recently made news for adding joke candidate Deez Nuts to its polls, said it could poll West, too. But lets say we were to take a West run seriously. Why not move the campaign up to 2016? At least at this point in the race, its clear that voters are decidedly open to political outsiders, specifically candidates who arent career politicians, but have shown a willingness to take on the establishment. A new Monmouth University poll showed that Ben Carson, who rose to fame as a neurosurgeon with an inspiring backstory, and Donald Trump, a real estate developer and brash reality TV star, are leading the Republican nomination race. A new Bloomberg/Des Moines Register poll showed Carson gaining on Trump. The same poll found that, in Iowa, only 7 percent of Republicans and 16 percent of Democrats are \"happy\" or \"satisfied\" with \"politicians in general.\" , Trumps rise in the polls alone should be an inspiration to all the outspoken and controversial rich and famous people of the world that they, too, have a shot at being president. Unlike Trump, who has stirred up anxiety about undocumented immigrants committing all sorts of crimes, Wests biggest political moment was focused on the nations treatment of black Americans in the aftermath of Hurricane Katrina: \"George Bush doesnt care about black people.\" The statement immediately sparked a nationwide debate about race in America, though West apologized to the president several years later. \"I would tell George Bush in my moment of frustration,\" he said, \"I didnt have the grounds to call him a racist.\", A more liberal example of a politician capitalizing on peoples frustration with the establishment would be Sen. Bernie Sanders, who is within seven points of Hillary Clinton in Iowa, according to the new Bloomberg/Des Moines Register poll. Both have called for raising the minimum wage and ending the for-profit prison system, an issue that West pushed on \"New Slaves,\" a song off his 2013 album Yeezus. Several people noted these lines: \"Meanwhile the DEA / Teamed up with the CCA [Correction Corporation of America] / They tryna lock ni---s up / They tryna make new slaves / See thats that private owned prison / Get your piece today.\" , The difference is that Sanders is turning outrage into policy proposals. Hes called for the minimum wage to gradually be raised to $15-an-hour then tied to inflation, and he announced last week that he plans to introduce a bill ending the for-profit prison industry. But if West does decide to move up his campaign he had some time to settle on a platform-the first Democratic presidential primary debate isnt until October. Next to him on stage would be a candidate he was hanging out with just a few weeks ago during the first Republican debate: Hillary Clinton. Thats assuming he even runs as a Democrat. While he supported the party during the midterm elections, West has the funds, social media following and disposition to seek out his own path. ]", "Date": "20150901", "Author": "[ Arit John, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-kanyewest01-20150901-story.html", "Title": "[ Why Kanye West should not wait another 4 years to run for president]"}