{"Content": "[ On the mid-July day Jeb Bush candidly told Sioux City Republicans he wants to curb federal favors to Iowas ethanol industry, he got a lucky pick-me-up from First Budget: How, asked a member of this ascendant advocacy group, would he balance federal revenue and spending?, Ethanol is but one drop in that bucket. The Sioux City Journal reports that Bush, who favors raising the age at which Americans can draw Social Security, said he also backs a federal hiring freeze and not replacing all retirees. \"You are not going to get it to balance immediately, but with high (economic) growth and a focused approach to limiting spending, including entitlements over the long haul, you can get it in balance,\" Bush said. \"Without (the economy) growing, it wont happen. And if we dont fix the entitlement system, it wont happen.\", With that frankness, a candidate for president paid his respects to First Budgets pressure over the existential threat that federal debts and entitlements pose to America as we know it. Havent heard of First Budget? You would if you attended candidates events in Iowa, New Hampshire, South Carolina or other early caucus and primary states. The nonpartisan groups respected ancestors include the Concord Coalition, Fix the Debt and the Committee for a Responsible Federal Budget, aka CRFB. Its members are pressing, politely but relentlessly, for answers about Americas perilous finances from the men and women who would be our 45th president. The time for this pressure, which all of us should apply to the candidates, is right. President Next will have a progressively dicier debacle on his or her oft-shaken, well-manicured hands:, President Barack Obama took office promising to spend political capital fixing federal finances, yet the predicament has worsened. Vast annual deficits have narrowed during his second term, but his Office of Management and Budget on July 14 projected that our debt will be just under a historically high 75 percent of our gross domestic product for a decade. Then the percentage is likely to ... rise. Add another recession, a war or some costly catastrophe and debt service would further strangle spending on other needs. How do you know when a presidential candidate is being deceptive? No, silly, not when his or her lips are moving. Candidates often tell the truth  like when they say they want your vote or your money. Moving lips are not a reliable clue. So what is? Any statement that envisions an amendment to... How do you know when a presidential candidate is being deceptive? No, silly, not when his or her lips are moving. Candidates often tell the truth  like when they say they want your vote or your money. Moving lips are not a reliable clue. So what is? Any statement that envisions an amendment to... On July 22, federal trustees of Social Security and Medicare reported that Social Security will be depleted by 2034, a year later than last years prediction. Benefits would drop by 21 percent for all recipients, a share that gradually rises to 27 percent. One component, the Social Security Disability Insurance fund, will be exhausted late next year; without a fix, benefits face an immediate 19 percent cut. The report predicts that Medicares hospital trust fund can pay full benefits through 2030, the same projection as last years report. But the program will be under enormous pressure: Its adding some 10,000 beneficiaries a day, and the ratio of workers who contribute payroll deductions to recipients who draw benefits is diving from 4-to-1 in 2000 to 2.4-to-1 in 2030. CRFB noted that between now and then, Medicare spending should stabilize \"due to lower cost growth assumptions.\" Which sounded swell until ... On Tuesday, Medicare and Medicaid actuaries projected U.S. health spending to grow at a 5.8 percent annual clip through 2024. Thats up from the 4 percent growth rate for 2007-13. The helpful slowing of health costs that politicians are bragging about? Hope you enjoyed it. As the economy rebounded from the Great Recession, the growth of health spending escalated. Imagine the possible strains on Medicare, Medicaid, Obamacare (and private insurance premiums). I spent a nice long weekend away from the news, and returned to find people talking about how Donald Trump might really win and how Joe Biden could win after all. No, they cant. Everything we know about presidential nominations screams that Trump has no chance of winning the Republicans nod and... I spent a nice long weekend away from the news, and returned to find people talking about how Donald Trump might really win and how Joe Biden could win after all. No, they cant. Everything we know about presidential nominations screams that Trump has no chance of winning the Republicans nod and... Looming over these dangers is a current federal debt  that is, a federal taxpayers debt  of $18.3 trillion. But who among us can comprehend $18.3 trillion? Time magazine recently translated our national debt into decipherable subsets:, Turns out our debt could buy everyone on Earth an Apple Watch, an iPad, an iPhone 6 and a 13-inch MacBook Air. It could buy 1,000 nuclear submarines plus 3,000 B-2 Spirit bombers. Or a kidney transplant for 54.4 million people  nearly the combined population of California and Florida. Or four years of public college for every American under age 75. Our debt could reimburse every fast-food purchase made in the past 15 years worldwide. Or pay for eight Iraq wars. Or cover cleanup and repair costs for 100 Katrina-scale disasters. It could buy 1 billion tons of Bavarian bratwurst. Remember, this debt is a number were inflating by additional hundreds of billions of dollars a year. To watch it grow (blindingly) in real time, click to usdebtclock.org. Then ponder the Congressional Budget Office projection that, by 2039, our debt burden could reach 180 percent of GDP, higher than Greeces currently calamitous 175 percent. Were putting all these projections in one editorial to explain why the next president has to do what others havent: Stop the runaway train headed at us all. As for candidates always prattling that they want to \"invest\" more in schools, or defense, or a hundred other needs: At their events or in your talks with their surrogates, ask the questions First Budget volunteers are forcing politicians to confront. As two of the groups officers wrote in a July 19 op-ed for The Cedar Rapids Gazette, \"If they promise tax cuts or more spending, how will they pay for them without increasing the debt? How do they plan to put important programs like Social Security and Medicare on a more sustainable track?\", Then let their answers guide your vote.]", "Date": "20150731", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-national-debt-medicare-bush-obama-edit-0803-20150731-story.html", "Title": "[ The next president's debts]"}