{"Content": "[ Walgreens is teaming up with a large hospital network for the first time to open a handful of new in-store clinics, as the drugstore chain looks for a more cost-effective and collaborative approach to expand its health care services. The partner is Providence Health & Services, a nonprofit Catholic health system based in suburban Seattle that operates 34 hospitals and 475 doctors offices in the Northwest and California. Providence plans to open up to 25 clinics inside Walgreens stores in Seattle and Portland over the next few years, the two companies said Thursday. Financial terms were not disclosed. Walgreens is taking a closer look at its in-store clinic business under its new management team put in place after the merger with European druggist Alliance Boots. In May, the company closed 35 clinics around the country, including two in the Chicago area, as part of a larger cost-cutting program, spokesman Jim Cohn said. The cuts represented about 8 percent of Walgreens retail clinics, leaving it with slightly more than 400 locations. Walgreens, CVS Health, Target, Wal-Mart and other retailers have opened hundreds of walk-in clinics in recent years run by nurses to treat ear infections and other routine illnesses, administer vaccines and increasingly help people with chronic diseases. But some doctor groups have bristled at the concept. They worry patients will substitute retail care for primary medical care by internists, pediatricians and family doctors. They also say the clinics further fragment the health care system because patients often dont inform their doctors of their clinic visits. Walgreens will open a store in the former Sears location on State Street in the Loop, the Deerfield-based company confirmed Wednesday. The store, set to open next spring, will occupy 15,000 square feet of space at 2 N. State. Sears closed its store there in April 2014. This is Walgreens second... Walgreens will open a store in the former Sears location on State Street in the Loop, the Deerfield-based company confirmed Wednesday. The store, set to open next spring, will occupy 15,000 square feet of space at 2 N. State. Sears closed its store there in April 2014. This is Walgreens second... Some retailers have addressed critics concerns by setting up arrangements with health systems to coordinate patient care. Walgreens partnership with Providence takes the collaboration one step further. \"This is a reflection of our efforts to develop deeper and more strategic relationships with our health system partners,\" Jeff Koziel, a Walgreens group vice president, said in a statement. \"Collaboration among providers is key in todays health care environment, to help ensure continuity of patient care and to provide greater convenience and access for patients.\", Cohn said the company is talking with other prospective partners in its desire to develop deeper relationships with other health care systems. Providence will staff the new clinics with nurse practitioners who will be available, often with no appointment, seven days a week. It plans to open six clinics early next year. asachdev@tribpub.com, Washing your hair in Chicago could help bring clean water to rural Kenya. Thats the premise behind a new charitable campaign launched by Walgreens and Unilever that is enlisting customers to buy into the cause with shampoo, deodorant and body wash. For every purchase of TRESemme, Suave and Caress... Washing your hair in Chicago could help bring clean water to rural Kenya. Thats the premise behind a new charitable campaign launched by Walgreens and Unilever that is enlisting customers to buy into the cause with shampoo, deodorant and body wash. For every purchase of TRESemme, Suave and Caress... Twitter @ameetsachdev]", "Date": "20150820", "Author": "[ Ameet Sachdev]", "Link": "http://www.chicagotribune.com/business/ct-walgreens-health-clinic-0821-biz-20150820-story.html", "Title": "[  Walgreens strives for cost-effective in-store clinics in partnership]"}