{"Content": "[ A top political aide to Vice President Joe Bidens late son joined the super PAC working to recruit the elder Biden to run for president on Sunday, lending the group newfound credibility in the midst of fresh signs the vice presidents aides are taking a close look at a 2016 campaign. Josh Alcorn, a longtime Democratic operative, had been former Delaware Attorney General Beau Bidens top political and fundraising adviser before he died of brain cancer in May. A known commodity in the Biden world, Alcorn raised money for Joe Bidens 2008 presidential campaign, and also served in the top fundraising role for Senate Democratic leader Harry Reids vast political operation. Will Pierce, who runs the Draft Biden super PAC, said he was thrilled about Alcorns move because Joe Bidens supporters throughout the U.S. \"know how close he was to Beau and his family.\", \"Josh joining the Draft Biden effort only increases the serious nature of what to date has been an enormously successful effort,\" Pierce said late Sunday. Alcorns decision to join the group marks the first clear sign that the close cadre of advisers surrounding the vice president may be taking the fledgling super PAC seriously. Until now, Bidens associates have eschewed any interaction with Draft Biden, which is staffed by volunteers and young operatives with few connections to Bidens inner circle. Yet the groups stepped-up activity comes as Bidens associates are resuming discussions about a 2016 presidential run after largely shelving such deliberations while his son was sick and dying earlier this year. Hillary Clinton is in deep, deep (I almost wrote \"yogurt\" but I really like yogurt) for her lies and pending investigations that will inevitably drag her down. Hillary can still save her fellow Democrats in 2016. But only if she quits the presidential race this minute and backs another candidate:, Hillary Clinton is in deep, deep (I almost wrote \"yogurt\" but I really like yogurt) for her lies and pending investigations that will inevitably drag her down. Hillary can still save her fellow Democrats in 2016. But only if she quits the presidential race this minute and backs another candidate:, Biden has yet to tell his staff whether he will run or personally ask them to do any planning for a potential campaign, according to several people close to the vice president. But recent conversations between Bidens associates and Democratic donors and operatives have led to speculation that Biden will challenge front-runner Hillary Rodham Clinton for the partys nomination. Individuals close to Biden have started looking into the options that might be available to him if he were to run, such as potential staff in Iowa and the filing deadlines for entering the Democratic field. Still, people close to the vice president say his launching a White House run remains uncertain. Biden is expected to make a final decision as soon as early September, according to those familiar with his plans. The individuals spoke to The Associated Press on the condition of anonymity because they were not authorized to discuss the deliberations publicly. The renewed focus on Biden comes amid some signs of weakness for Clinton, including declines in her favorability ratings among voters in recent polling. Vermont Sen. Bernie Sanders, who is challenging Clinton for the Democratic nomination, has been attracting large crowds with his liberal economic message, evidence of a hunger within the party for an alternative to Clintons candidacy. A series of verbal gaffes by U.S. Sen. Mark Kirk have left top Illinois Republicans privately fretting over his re-election bid, but they also concede theres little chance hell be pressured into leaving next years ticket. \"Not going to happen,\" said one prominent Republican close to Gov. Bruce... A series of verbal gaffes by U.S. Sen. Mark Kirk have left top Illinois Republicans privately fretting over his re-election bid, but they also concede theres little chance hell be pressured into leaving next years ticket. \"Not going to happen,\" said one prominent Republican close to Gov. Bruce... Kendra Barkoff, the vice presidents press secretary, said Biden was spending his time working on President Barack Obamas agenda, not on planning his own potential presidential campaign. \"As the Biden family continues to go through this difficult time, the vice president is focused on his family and immersed in his work,\" Barkoff said. The death of Bidens son prompted an outpouring of support for the vice president, who also lost a daughter and his first wife in a car accident in 1972. Associated Press, ]", "Date": "20150803", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-biden-2016-20150801-story.html", "Title": "[ President Biden? V.P.'s advisers resume discussion about 2016 run]"}