{"Content": "[ A series of verbal gaffes by U.S. Sen. Mark Kirk have left top Illinois Republicans privately fretting over his re-election bid, but they also concede theres little chance hell be pressured into leaving next years ticket. \"Not going to happen,\" said one prominent Republican close to Gov. Bruce Rauner, a major Kirk ally. Several factors contribute to the Kirk-or-bust GOP outlook: Hes got the support of Rauner and the Washington GOP establishment. The first-term senator has no intention of leaving. And its too late to recruit and fund a major candidate to keep a seat thats viewed as essential for Republicans to retain their Senate majority in 2016. Kirks camp found itself on the defensive Wednesday, a day after veteran Republican fundraiser and businessman Ron Gidwitz initially called for Kirk to step down because he was hurting the partys prospects. Gidwitz quickly recanted and endorsed Kirk, but the damage had been done. The Kirk campaign supplied supportive statements from Senate Majority Leader Mitch McConnell of Kentucky and the National Republican Senatorial Committee, backing that provides significant protection for Illinois junior senator against any primary challenge or effort to dump him. Asked Wednesday on Capitol Hill if Illinois voters should be concerned about some of his recent statements, Kirk said only, \"Let me get to vote\" before heading into the Senate for a roll call. Kirk and his Senate staff denied a request for an interview. Hours after reportedly calling on U.S. Sen. Mark Kirk to halt his re-election bid, a major Republican fundraiser backtracked Tuesday and hailed Kirk as the partys best candidate for one of the nations most hotly contested Senate seats. Republican businessman and fundraiser Ron Gidwitztold Crains... Hours after reportedly calling on U.S. Sen. Mark Kirk to halt his re-election bid, a major Republican fundraiser backtracked Tuesday and hailed Kirk as the partys best candidate for one of the nations most hotly contested Senate seats. Republican businessman and fundraiser Ron Gidwitztold Crains... Steve Schmidt, the veteran political operative behind Sen. John McCains two GOP presidential bids and a senior adviser to Kirks campaign, said the Republican shouldnt be underestimated  even facing a grueling campaign in a presidential election year, which traditionally favors Democrats in Illinois. \"A U.S. Senate campaign or governors race or presidential campaign isnt so different than an NFL playoff game. You can turn the ball over a couple of times, maybe three times. You cant turn the ball over seven times to win the game, and Mark Kirk understands that,\" Schmidt said. After a nearly yearlong absence from the Senate following a severe stroke in January 2012, Kirk marked the opening of the 113th Congress by climbing the Capitol steps, using a cane and accompanied by two Democrats  Vice President Joe Biden and West Virginia Sen. Joe Manchin, a close friend. On that day, senators and House members applauded him every step of the way, but now a downward spiral of controversial statements this year has created what Democrats view as a prime opportunity to recapture President Barack Obamas old Senate seat. Republican U.S. Sen. Mark Kirk on Friday acknowledged he got \"carried away\" earlier this week when he accused President Barack Obama of wanting Iran to get nuclear weapons as part of a multinational agreement with the Middle Eastern nation. Appearing at an unrelated event, Kirk said his remarks... Republican U.S. Sen. Mark Kirk on Friday acknowledged he got \"carried away\" earlier this week when he accused President Barack Obama of wanting Iran to get nuclear weapons as part of a multinational agreement with the Middle Eastern nation. Appearing at an unrelated event, Kirk said his remarks... Even before Gidwitzs concerns became public, Republicans said they knew they had to find ways to move the Kirk campaign forward against the inevitable attacks from Democrats using the GOP senators own words against him. At the national level, officials with the NRSC have offered Kirk one bit of advice: Stay out of the media so much. \"Its got to be a more controlled setting when he speaks publicly,\" said one Republican political operative familiar with Kirk and the NRSCs strategy who was not authorized to speak publicly. \"I dont think it takes away from anything that hes trying to do. But hes got to be less in the media. Everything should be about making your point and thats that.\", In a precursor to what is expected to be one of the most expensive and contentious Senate campaign battles in the nation next year, potential Democratic challenger Rep. Tammy Duckworth posted a two-minute Web video this month titled \"Mark Kirks outrageous statements, outlandish lies.\", The ad highlights some  but not all  of Kirks more controversial statements from this year, including likening the multinational Iran nuclear deal led by the White House to \"the greatest appeasement since Chamberlain gave Czechoslovakia to Hitler\" and referring to the president by his full name of \"Barack Hussein Obama,\" something usually used by right-wing detractors. A leading opponent of the Iran deal, Kirk in May said any agreement reached by the United States should be on similar terms with \"the agreement that Nelson Mandela signed\" in South Africa. But international efforts to remove nuclear weapons in South Africa began under Mandelas predecessor, F.W. de Klerk. Mandela merely followed de Klerks policies. In April, Kirk told the Peoria Journal Star of his support for efforts to help African-American entrepreneurs \"so that the black community is not the one we drive faster through.\", In March, Kirk criticized Democrats for refusing to approve a bill against human trafficking because it contained anti-abortion language. \"They are making the same mistake that Democrats made in the 1850s when they defended slavery,\" Kirk said. A month earlier, in the midst of a budget debate over homeland security, Kirk warned, \"If we have a successful terrorist attack  all the dead Americans from that should be laid at the feet of the Democratic caucus.\" That same month, Kirk said House Republicans shouldnt amend the bill. \"Hopefully were going to end the attaching of bulls---- to essential items of the government,\" he told reporters. Its not the first time Kirk has faced scrutiny and controversy over his public statements. In his successful bid for the Senate five years ago, Kirk was found by the Tribune to have embellished parts of his resume. The former Navy Reserve officer apologized for inflating parts of his military record, including claims he came under enemy fire in Iraq, that he ran the Pentagon war room and that he was the Navys intelligence officer of the year. \"Its not like his mouth wasnt a problem five years ago  the exaggeration factor,\" said the prominent Republican close to Rauner. The source was not authorized to speak publicly about the Kirk situation. \"The reality is, its late to try to find someone to replace him. The people who could talk to him, they all say that its got to be his decision if he were to get out. Rauner is really the only one that could tell him to get out, and hes got nothing to offer him. Besides, the Senate truly is his life,\" the Republican source said of Kirk. Schmidt said that despite the gaffes, Kirk should not be discounted, particularly as an against-the-odds Republican who fits Illinois and is able to get crossover votes as a social moderate and fiscal conservative despite the states Democratic leanings. He added that at this early stage of the campaign, voters have yet to be presented with a choice between Kirk and his challenger, be it Duckworth or another Democrat, former Chicago Urban League head Andrea Zopp. \"By the time we move to Election Day in 2016, none of these issues were talking about here with the context, or Ron Gidwitz comments, are going to be at the front of the minds of the voters. They wont be on the mind of the voters at all,\" he said. \"I suspect what you will see, moving ahead in the campaign, is the chapter of some of these mistakes is behind him,\" Schmidt said. Chicago Tribunes Katherine Skiba contributed from Washington, D.C. rap30@aol.com, Twitter @rap30]", "Date": "20150729", "Author": "[ Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-mark-kirk-us-senate-seat-met-0730-20150729-story.html", "Title": "[ Despite gaffes, it's Kirk or bust for Republicans]"}