{"Content": "[ Nearly a million people signed up for health insurance under President Barack Obamas law even after the official enrollment season ended, helping push the share of uninsured Americans below 10 percent and underscoring how hard it could be for Republicans to dismantle the program. The Health and Human Services Department said Thursday that 943,934 new customers have signed up since open enrollment ended on Feb. 22, benefiting from \"special enrollment periods\" keyed to life changes and other circumstances. Its a flexible feature also common to the coverage people get through work. Sign-up opportunities for those experiencing changes such as having a baby or losing a job that came with health insurance are available year-round through HealthCare.gov and its state-run counterparts. The steadily growing number of Americans with coverage under the five-year-old law could make it more difficult for Republicans to repeal \"Obamacare\" even if they win the White House and keep control of Congress in next years elections. Several of the GOP presidential candidates have insisted they would scrap the law, but they would face the prospect of stripping millions of their insurance. Republican lawmakers also talk of replacing the Affordable Care Act, but the GOP has yet to rally behind an alternative. Thursdays latest numbers are the first since the Supreme Court upheld health insurance subsidies in all 50 states, turning back a challenge from the laws opponents that would have undermined coverage across much of the country. The new figures, through June 30, are preliminary and come with a couple of caveats. The final tally could be higher, because HHS counted only the 37 states using the HealthCare.gov website. Or it could dip lower, because the initial numbers did not winnow out customers who failed to seal the deal by paying their first months premium. That final count takes longer. Nonetheless, HealthCare.gov CEO Kevin Counihan said the results are \"further evidence that the health insurance marketplace is working for Americas families.\", Earlier this week, two separate reports documented progress on increasing insurance coverage in 2015, as the health care laws second year of expanded coverage coincided with a steadily improving economy. However, a third study raised questions about future affordability. Two surveys documented the growing number of Americans with insurance:,  The governments National Health Interview Survey found that 7 million fewer people were uninsured in the first three months of this year, when compared to the average for all of 2014. The uninsured rate stood at 9.2 percent.  A large independent survey called the Gallup-Healthways Well-Being Index found a statistically significant drop in the uninsured rate for most states since the laws big coverage push began at the end of 2013. States that embraced the Medicaid expansion saw bigger declines. Texas, a bastion of political opposition to the law, was the only state with more than 20 percent of its residents uninsured the first six months of this year. The health care law takes a two-track approach to coverage. HealthCare.gov and state health insurance markets offer subsidized private plans for low-income to middle-class households who lack access to job-based insurance. About 10 million people had such coverage through the end of March. Expanded Medicaid, optional for states, provides coverage for the near-poor, mainly adults with no children at home. The 6-3 Supreme Court decision this summer has buoyed the administration and its supporters. A Gallup survey after the ruling found that approval of the law had risen to 47 percent, the highest level since 2012, almost even with the 48 percent disapproving. However, a third report released this week, from the Urban Institute, warned that progress could stagnate or even reverse. The nonpartisan research organization is broadly in accord with the goals of the law. While pointing to accomplishments of the law, the report said that even with taxpayer subsidies the private coverage provided remains a financial stretch for many families. \"As a result, many consumers could become disillusioned, and disenrollment rates could increase over time,\" the report said. It recommended changes including more generous subsidies, reduced out-of-pocket costs such as annual deductibles and copayments, and improvements to HealthCare.govs technology infrastructure. The estimated cost  $450 billion to $560 billion over 10 years  probably makes that list a nonstarter for Congress. In the recent Supreme Court case, King v. Burwell, the laws opponents argued that a precise reading only allows the government to subsidize premiums in states that have set up their own insurance markets. Most have not done so. The administration countered that when the law is read in context, it clearly allows subsidies in all 50 states. The court agreed with Obama. Associated Press]", "Date": "20150813", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-obamacare-uninsured-rate-declines-20150813-story.html", "Title": "[  Health law sign-ups keep growing; uninsured rate declines ]"}