{"Content": "[ At this stage, the 2016 presidential campaign is looking a lot like high school. New Jersey Gov. Chris Christie, for example, sounds like the locker-room bully who would torture Louisiana Gov. Bobby Jindal with wedgies. And Donald Trump? Hes the class clown. Hes the student government candidate who sells fake ID cards on the side  which he assures you are the greatest, finest, artistically crafted and most convincing fake ID cards in the world. The real estate magnate and reality TV showman will do anything to get attention. He appears to fear nothing except the slim possibility that he might actually win the office that he claims to be pursuing. Many of us media workers play along with this charade because we like to pay attention to nonsense that lots of other people are paying attention to. This helps to explain the rise of the Kardashians. It also explains why Trump soared to second place in the Republican presidential sweepstakes, right behind former Florida Gov. Jeb Bush, immediately after announcing his candidacy. Dont sell him short, say the political news analysts. Trump will make himself matter. Right. Even without offering much in the way of serious proposals to improve jobs, health care, the economy, education, foreign policy and all that other serious stuff that presidents are expected to do, Trump shows how far you can get with high name recognition, bombastic rhetoric and inflammatory claims about immigrants in the country illegally and other easily bullied minorities. NBC said Monday that it is ending its business relationship with mogul and GOP presidential candidate Donald Trump because of comments he made about immigrants during the announcement of his campaign. June 29, 2015. (WGN TV), NBC said Monday that it is ending its business relationship with mogul and GOP presidential candidate Donald Trump because of comments he made about immigrants during the announcement of his campaign. June 29, 2015. (WGN TV), In his long-winded and rambling announcement of his candidacy, the billionaire businessman declared that those who cross the Southern border illegally are \"bringing drugs ... bringing crime. Theyre rapists\" and \"criminals.\", That flies in the face of crime statistics that show a lower violent crime rate for immigrants in the U.S. illegally, but Trump doesnt care. The \"immigrants are coming\" red meat plays well with some, especially those who have an appetite for bigoted stereotypes. So Trump refused to retract his remarks even as uncomfortable partner NBC, protesting sponsors and celebrity participants in his Miss USA pageant fell away like autumn leaves. Nor was he likely to budge after Reince Priebus, chairman of the Republican National Committee, denounced Trumps remarks as \"not helpful\" to the national partys efforts to expand its racial and ethnic diversity. In fact, Trumps xenophobic remarks already have at least one fan among his fellow contenders. \"I like Donald Trump,\" chirped U.S. Sen. Ted Cruz of Texas. \"I think hes terrific, I think hes brash, I think he speaks the truth.\", Donald Trump sees himself as a martyr to the truth. All he did was point out that among the foreigners who have come to this country are some who do not scrupulously abide by all our criminal laws  only to be pilloried for his honesty. \"When Mexico sends its people, theyre not sending their best,\"... Donald Trump sees himself as a martyr to the truth. All he did was point out that among the foreigners who have come to this country are some who do not scrupulously abide by all our criminal laws  only to be pilloried for his honesty. \"When Mexico sends its people, theyre not sending their best,\"... I think Cruz is desperate to move up in the polls, even if he has to tap into the same paranoid wing that feeds Trumps ego and poll numbers. Announcements by Fox News and CNN that they will limit the first two major debates to candidates who rank in the Top 10 in national polls has changed the feel of the Republican contest from a collegial \"American Idol\" to a cutthroat \"Hunger Games.\", Frankly, in a crowded field like the one currently jamming its way onto next years Republican primary ballots, I am struck not so much that Trump is so high on the charts but that he is so low. Trump only needed 12 percent in the latest CNN/ORC poll to come in second, behind Bush, who held the lead with 19. That means 88 percent werent sold on Trump. That only sounds impressive in comparison to the rest of the crowded fields failure to break out of single digits. A Suffolk University poll in New Hampshire shortly after their announcements also had Bush in first with 14 percent and Trump in second with 11 percent. In Iowa, a CNN poll among likely caucus-goers also showed Trump in second place with 10 percent. That ties with Dr. Ben Carson, but lags 8 points behind the early front-runner, Wisconsin Gov. Scott Walker. In other words, its early. The big questions that remain to be answered include how much and how many of the Grand Old Partys candidates are willing to follow the Trump route by pandering to the partys angry paranoid extremes. Or who on the debate stage will be the first to tell Trump in Chris Christie-style to \"Sit down and shut up!\", Clarence Page, a member of the Tribune Editorial Board, blogs at http://www.chicagotribune.com/pagespage, cpage@tribpub.com, Twitter @cptime]", "Date": "20150702", "Author": "[ Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-donald-trump-gop-jeb-bush-perspec-0702-20150702-column.html", "Title": "[ Which GOP rival will fire Trump?]"}