{"Content": "[ Shortly after pleading not guilty Tuesday to charges related to sensational allegations of hush money payments and lying to federal agents, former U.S. House Speaker Dennis Hastert stood in a packed federal courtroom in downtown Chicago looking extremely uncomfortable. As the judge left the bench and Hasterts high-powered attorneys conferred with prosecutors, Hastert, once one of Illinois most prominent politicians, remained by himself near the lectern, his shoulders hunched, arms hanging limp at his sides. After a moment, he turned toward the gallery where dozens of reporters and spectators were filing out and pursed his lips. Minutes later, a wild scene unfolded as Hastert and his attorneys were whisked through the lobby of the Dirksen U.S. Courthouse amid a crush of television news cameras and photographers. Escorted by about a dozen federal Homeland Security agents, Hastert didnt say a word to the media, ducking into a black Lincoln Town Car that sped north on Dearborn Street as passersby stopped to stare. His lawyers had no comment either. The frenzy surrounding the 73-year-old Republican powerhouses first court appearance since his stunning indictment nearly two weeks ago stood in stark contrast to the routine proceedings in court, where Hastert formally acknowledged the charges and entered a not guilty plea through his attorneys. Standing at the lectern in a dark gray suit and blue tie, Hastert answered, \"Yes, sir,\" several times in a barely audible voice as U.S. District Judge Thomas Durkin asked him if he understood the charges and the terms and conditions of his bail. The answers marked Hasterts first public words since the indictment was unsealed May 28 alleging he had agreed to pay $3.5 million to a longtime acquaintance to conceal wrongdoing from Hasterts days as a high school teacher and wrestling coach in Yorkville. According to the charges, Hastert had already paid $1.7 million to the acquaintance, identified only as Individual A, then lied about it when the FBI questioned him in December. Former U.S. House Speaker Dennis Hastert is accused of agreeing to pay $3.5 million in apparent hush money to a longtime acquaintance, then lyingto the FBI when asked about suspicious cash withdrawals from several banks. His withdrawals from banks caught the attention of authorities. The indictment alleges that Hastert made 15 withdrawals of $50,000 apiece over nearly two years but then began illegally structuring the withdrawals in increments of less than $10,000 to avoid federal reporting requirements. While the carefully worded, seven-page indictment only hinted at Hasterts dark past, federal law enforcement sources have said Hastert was making the payments to conceal sexual abuse of a Yorkville High School student. The FBI also interviewed a second person who raised similar allegations of sexual abuse against Hastert, corroborating the account of Individual A, sources said. Since the charges were filed, a onetime Yorkville resident took to national television to allege Hastert sexually abused her now-deceased brother while he was a student. None of those allegations are part of the indictment. As the details have trickled out, Hastert remained silent and away from public view for 12 days. Even the identity of his attorney wasnt confirmed until Monday afternoon when Thomas Green and John Gallo of the law firm of Sidley Austin LLC filed their official appearances with the court. Dennis Hastert arrives at Sidley Austin in Chicago on Tuesday morning. (Jeff Coen, Chicago Tribune), Dennis Hastert arrives at Sidley Austin in Chicago on Tuesday morning. (Jeff Coen, Chicago Tribune), Hasterts long-awaited day in court began about 9:30 a.m. Tuesday, when he was spotted by reporters leaving his sprawling estate in far west suburban Plano in the hired black Lincoln. About an hour later, he arrived at Sidley Austins Loop offices two blocks north of the courthouse, ignoring reporters who shouted questions through the vehicles closed window. Shortly before 1 p.m. the Town Car pulled up in front of the courthouse and Hastert emerged amid a scrum of cameramen and reporters, with Gallo clearing the way with a forearm. Several Homeland Security officers escorted Hastert through the revolving doors and the line for the metal detector. The former speaker did not respond to shouts for comment, including one person who yelled, \"Who is Individual A?\", As Hastert neared the elevator bank, a national television news reporter stopped one of his lawyers to talk, leaving Hastert standing by himself. After briefly getting in an elevator car with a Tribune and Sun-Times reporter, Hastert exited the car when another attorney motioned to him that they needed to go to the 11th floor to meet with the pretrial services department. Outside Durkins 14th-floor courtroom, meanwhile, a long line of people stretched down the hall hoping to attend the arraignment. A nearby courtroom was set up to handle the overflow crowd. Shortly after members of the media had been ushered in, filling up the jury box and at least one half of the gallery, Hastert walked into the courtroom about 1:45 p.m. For 15 awkward minutes before the hearing began, Hastert sat at the defense table, his eyes darting to the ceiling and then down to his hands as reporters observed him and scribbled notes. Later, as the attorneys conferred with each other, Hastert sat by himself, staring straight ahead. The 20-minute arraignment hearing was highlighted by Durkin addressing head-on some potential conflict-of-interest issues that arose after he was randomly selected as the judge to hear the high-profile case. The judge noted  as reported by the Tribune last week  that he had made two donations totaling $1,500 to Hasterts campaign more than a decade ago while he was a private attorney at the Mayer Brown law firm in Chicago. He also said he had written an email in the mid-1990s to a Hastert staffer as part of his effort at the time to be appointed to the federal bench. \"But nothing came of it,\" said Durkin, who was appointed to the bench by President Barack Obama only a few years ago. Durkin acknowledged his brother is Jim Durkin, the current Republican leader of the Illinois House, but he said Hastert \"is not a personal friend of my brother\" and the relationship would have no bearing on him overseeing the case. In addition, the judge said he had worked at the same law firm as Hasterts son, Ethan, including working closely on one matter together in 2011. \"We were friendly business colleagues, but I do not consider him a personal friend,\" Durkin said. The judge said he had \"no doubt\" he could be impartial in the case. Still, federal statute calls for him to step aside if his impartiality \"might reasonably be questioned,\" he noted. By that standard, Durkin said he would recuse himself from the case unless both sides agree to keep him on as judge. He asked the parties to make that decision by Thursday afternoon. \"I will not be offended whatever the result, I assure you,\" the judge said. If Durkin was disqualified  a rare step in federal court  another judge would then be randomly assigned to the case. Neither prosecutors nor Hasterts attorneys indicated in court what their decision might be, but there could be good reasons for each side to want to keep Durkin, a former federal prosecutor who helped win several key convictions in the Operation Gambat public corruption probe in the 1990s. Hastert, meanwhile, will remain free on a recognizance bond. He surrendered his passport and agreed to turn over firearms that his two adult sons keep in safes at the Plano home. He faces up to five years in prison on each of the two counts if convicted. Chicago Tribunes Jeff Coen and freelance reporter Gary Gibula contributed. jmeisner@tribpub.com, sschmadeke@tribpub.com, Twitter @jmetr22b, Twitter @SteveSchmadeke]", "Date": "20150609", "Author": "[ Jason Meisner, Steve Schmadeke]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-dennis-hastert-arraignment-20150609-story.html", "Title": "[ Dennis Hastert pleads not guilty amid claims of hush money, lying to FBI]"}