{"Content": "[ In his first public address in a year, embattled Syrian President Bashar Assad vowed Sunday to win his countrys long-running civil war while acknowledging his troops had lost territory to rebel forces and were running short on manpower. Assads speech, while confident, came in the fifth year of a conflict pitting his forces against rebels, Islamist insurgents and the extremist Islamic State group. Turkey, which has long backed the rebels, has begun striking the IS group and Kurdish fighters battling the extremists, adding a new layer of complexity to a brutal war with no end in sight. Assads televised speech Sunday morning, given to local dignitaries in the Syrian capital, Damascus, was his first public address since he was sworn in for a third, seven-year term in July last year. Assad has given interviews to several Arab and international media outlets in the meantime. Assad acknowledged that his generals have had to move forces from one front to another in order to protect areas that are militarily, politically or economically more important. He added that the loss of some areas to insurgents has led to \"frustration\" among Syrians. Syrian forces have suffered several setbacks since March, including the loss of the northwestern city of Idlib, the capital of a province that borders Turkey. In May, the government lost the historic central town of Palmyra to IS extremists, who also captured parts of the northeastern city of Hassakeh. Those losses could be partially offset by greater support from the governments key ally, Iran, now that Tehran has agreed to a nuclear deal with world powers that would see international sanctions lifted. \"We are not collapsing. We are steadfast and will achieve victory,\" said Assad, who was interrupted several times by applause. \"Defeat does not exist in the dictionary of the Syrian Arab army.\", Assad tried to justify the loss of some areas, including Idlib. Assad-allied forces, including fighters from the Lebanese militant group Hezbollah and Iranian advisers, control a little less than half of Syrias 185,000 square kilometers (71,400 square miles). \"It was necessary to specify critical areas for our armed forces to hang on to,\" Assad said. \"Concern for our soldiers forces us to let go of some areas.\", \"When we concentrate our forces in an important area, what happens is that we bring reinforcements but this is usually at the expense of other areas,\" Assad said. \"Sometimes we have to abandon some areas in order to transfer these forces to the area that we want to hold.\", \"There is a shortage of manpower,\" Assad said, adding that \"I dont want to give a dark image that hostile media will use to say that the president is saying that people are not joining the army.\", Assad said that in recent months, mostly in April and May, the number of people joining the army has increased. He added: \"Every inch of Syria is precious.\", Hours after Assad spoke, activists and Hezbollahs Al-Manar TV said government forces were advancing on Palmyra and had captured several mountains overlooking the town, known for its UNESCO world heritage site marked by 2,000-year-old Roman colonnades. \"Regime forces are on the outskirts of the city of Palmyra,\" said activist Bebars al-Talawy, who is based in the central province of Homs that includes the historic town. Rami Abdurrahman, who heads the Britain-based Syrian Observatory for Human Rights, said troops and pro-government fighters are getting close to the town. Al-Manar reported that troops captured several mountains southwest of the Palmyra, adding that IS fighters are fleeing the area. It aired footage said to be taken in the desert outside the town with troops moving forward. Since IS captured Palmyra, many feared that the group would damage the archaeological site as the extremists did in Iraq earlier this year. Regaining control of it will be a major victory for Assad. Assads government announced a general amnesty for army deserters and draft dodgers Saturday. There are thousands of army deserters in and outside Syria, many of whom have gone on to fight with rebels. Many young men have fled the country to avoid compulsory military conscription. Assad has issued similar amnesties for criminals, but has not released any of the thousands of political prisoners believed to be in Syrias prisons. The Observatory recently reported that at least 49,100 troops and 32,500 pro-government gunmen have been killed since the uprising began in March 2011. The group, which gathers information from a network of activists inside Syria, says there are some 70,000 draft dodgers in government-controlled areas alone. Last month, Syrias prime minister called on young men to fulfill their mandatory military service obligation, promising better pay for troops on the front lines as well as one hot meal a day. Assad said his government did not want war, \"but when it was imposed on us, the Syrian Arab army repelled the terrorists everywhere.\" Assad refers to all those fighting against his rule as terrorists. The U.S. has begun training some moderate rebels who oppose Assad, but Islamic extremist groups have had the most success against his forces. The Islamic State group holds about a third of Syria and neighboring Iraq in its self-declared \"caliphate.\", Speaking about political dialogue, Assad said any initiative that is not based on fighting \"terrorism\" will be \"hollow\" and \"meaningless.\", Associated Press]", "Date": "20150726", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-syria-president-20150726-story.html", "Title": "[ Syria's embattled president admits manpower shortage ]"}