{"Content": "[ After signing two bills that loosen Wisconsins gun laws, Gov. Scott Walker defended the timing of his public event Wednesday, saying it had been scheduled before nine people were shot and killed last week in a South Carolina church. With his signature, the all-but-certain Republican presidential candidate eliminated the states 48-hour waiting period for handgun purchases and allowed off-duty, retired and out-of-state police officers to carry firearms on school grounds. Both measures passed earlier this month in the GOP-majority Legislature with bipartisan support. The timing of the bill signing comes amid a renewed debate over gun control and race relations after the fatal shootings at a Charleston, South Carolina, black church on June 17; a white man faces multiple murder charges. Walker said the bill-signing event was scheduled on June 11. After June 30, the measures would have become law without his signature. \"If we had pulled back on this, I think it would have given people the erroneous opinion that what we signed into law today had anything to do with what happened in Charleston,\" Walker said at the ceremony, held at the Milwaukee County Sheriffs office. The governor said the countrys focus should be on the families affected by the shooting and on condemning the shooter. \"We need to denounce not just the acts, but to denounce the beliefs that he had. This was a racist, evil man who needs to be called out ... this should be unacceptable in America,\" Walker said. More than two dozen awards worth more than $124 million were made to companies without a formal staff review by the underwriting department of Gov. Scott Walkers economic development agency, it reported Friday. Documents detailing the awards were made public late Friday afternoon in advance of... More than two dozen awards worth more than $124 million were made to companies without a formal staff review by the underwriting department of Gov. Scott Walkers economic development agency, it reported Friday. Documents detailing the awards were made public late Friday afternoon in advance of... The governor, who was joined Wednesday by Republican lawmakers and families who supported the measures, has been an outspoken supporter of gun rights. Walker previously made Wisconsin the 49th state to legalize concealed carry  even in state buildings  and signed a \"castle doctrine\" bill giving homeowners more legal protections if they shoot an intruder. He also has a 100 percent rating from the National Rifle Association and spoke at the NRAs annual meeting in April. The NRA in a statement Wednesday called the bills signing a \"victory for gun rights in Wisconsin.\", Ten states and the District of Columbia impose some form of waiting period for buying handguns, according to the Law Center to Prevent Gun Violence. Wisconsins 48-hour period has been in effect since 1976. Supporters of eliminating the waiting period said itll better allow people to protect themselves, while opponents said it would lead to people caught up in fits of rage or depression to obtain weapons quickly. First, Gov. Scott Walker defeated public-sector labor unions. Then, he declawed their private-sector counterparts. Now, just weeks beforehis expected entry into the presidential race, the Wisconsin Republican is staring down another conservative target: college professors. The trifecta could cement... First, Gov. Scott Walker defeated public-sector labor unions. Then, he declawed their private-sector counterparts. Now, just weeks beforehis expected entry into the presidential race, the Wisconsin Republican is staring down another conservative target: college professors. The trifecta could cement... Supporters also say it inconveniences law-abiding citizens, that background checks can be completed in hours and women would be able to get guns faster to protect themselves and their families from abusers. Backers of allowing off-duty and retired police officers to carry concealed weapons at schools said it would create another line of defense for students and teachers if a shooter attacks. Opponents said allowing non-uniformed officers to carry guns at schools could scare students. The new laws will take effect Friday.]", "Date": "20150624", "Author": "[ Dana Ferguson]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-gov-walker-to-end-decadesold-waiting-period-for-handguns-in-wisconsin-20150624-story.html", "Title": "[ Gov. Walker ends decades-old waiting period for handguns in Wisconsin]"}