{"Content": "[ The resignation of U.S. Rep. Aaron \"Abs of Steel\" Schock should come as no surprise. The Illinois Republican from Peoria was once a rising GOP establishment star. And now his career is in shambles after weeks of questions over spending. At least Schock has two things going for him:, Hes got great abs. And those of us who are challenged in the great abs department  I protect mine by wrapping them in fat  can appreciate perfection. And the other thing is what Schock said himself: Hes not some old crusty white guy. Some think Schocks troubles started with the ridiculous and costly \"Downton Abbey\" makeover of his Washington office and that devastating interview with ABC News Jeff Zeleny, a former Tribune reporter who is now with CNN. Others figure it was Schocks ostentatious reading of style and gossip magazines, with photographs showing him thumb through them as if he were some kind of star-struck teenage girl. Others say its the lavish spending trips, dinners and Katy Perry concerts. Or those exotic vacations with the Instagram shots of Schock doing adventuresome stunts. But at least hes not some old crusty white guy. He said as much in that famous ABC News interview with Zeleny. Schock: \"Ive never been an old crusty white guy.\", Zeleny: \"What does that mean?\", Schock: \"Im different. I came to Congress at 27,\" Schock said. \"When I go take a personal vacation I dont sit on the beach, I go do active things. And so, Im also not going to live in a cave. So when I post an Instagram photo with me and my friends, as Taylor Swift said, Haters gonna hate. \", Haters are going to hate, but what did old crusty white guys do to Aaron Schock, anyway?, Now Im wondering if Schock doesnt wish he were an old crusty white guy, or an old crusty black guy. Or an old crusty Latino, or crusty old Asian guy for that matter. Old crusty politicians are smart enough not to decorate their offices to resemble a hit TV show. And theres another thing old crusty guys dont do:, They dont model their abs of steel in Mens Health magazine like some office boy-toy. Republican state Sen. Darin LaHood said hes interested in running in the special election to succeed U.S. Rep. Aaron Schock and could decide as soon as Wednesday. The son of Ray LaHood, a former Peoria congressman and U.S. transportation secretary, said its a sad day for the Peoria-area congressional... Republican state Sen. Darin LaHood said hes interested in running in the special election to succeed U.S. Rep. Aaron Schock and could decide as soon as Wednesday. The son of Ray LaHood, a former Peoria congressman and U.S. transportation secretary, said its a sad day for the Peoria-area congressional... \"I was walking through Reagan airport and I saw it from 50 feet away at the newsstand and I said holy (Bleep),\" a prominent Midwestern Republican said Tuesday. What did you see?, \"That magazine cover with Schock flexing his abs, and like every other Republican with a brain, I was like Bleep me. \", Thats why I asked editors to attach that famous Schock abs cover to this column, to remind us of the dangers of narcissism in politicians. In the photo, Schock also has his shirt unbuttoned. And hes unloosened his tie. Lets put it this way: He doesnt look like hes about to study ISIS-related cables or ask about corn and wheat subsidies. From the article:, \"And model he does. When he strolls into a New York City studio for his photo shoot, Schock isnt sporting the typical boxy clothes that Beltway insiders wear in order to hide whats stretching their belts. Instead, hes decked out in a form-fitting Zegna suit and tapered shirt that show off both his musculature and his fashion savvy. He looks more like a hit man from a European spy thriller than a boring politician.  In other words, Aaron Schock is pretty fly for a Republican from Peoria.\", Fly for a Peoria Republican?, The Republican Ray LaHood, who served for years as the congressman from Peoria before serving as U.S. transportation secretary, didnt display his abs that way. Come to think of it, Ive never seen Ray LaHoods abs. I wouldnt think of asking to see LaHoods abs. And I dont think any voters in that district wondered about them either. And former House Speaker Dennis Hastert, the Republican who was once quite chunky, never once showed off his abs. Liberal editorial boards never whined, \"If only we might see Dennys abs, wed feel better about the GOP.\", The late Republican Sen. Everett Dirksen never showed his abs. If you dared ask him, I bet hed flick a lit cigarette in your eye. And among Democrats, the late Mayor Richard J. Daley never took off his suit coat, let alone displayed his belly. I dont think he ever saw his own abs. Current Mayor Rahm Emanuel is a fitness nut, but hed never pose that way. Neither would his opponent, Cook County Commissioner Jesus \"Chuy\" Garcia. Clearly, they are not fly enough. Unfortunately, President Barack Obama displayed his abs on a Hawaiian beach with his family. But he wasnt in an office. I do remember political figure and former Near North Insurance boss Michael Segal displaying his abs in federal court in 2004. He told U.S. District Judge Ruben Castillo that federal prison had caused a bad skin rash. \"I was told maybe I wasnt taking enough showers and to buy a bar of soap,\" Segal said, unbuttoning his federal orange jumpsuit. \"I was in immense pain. When the rash goes to your private parts and the rest of your body, its not comfortable.\", Whats the moral of this story? Aaron Schock says haters gonna hate. But what about prosecutors? Are prosecutors gonna prosecute?, I guess well have to wait. Just keep your shirts on. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150317", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-schock-resigns-met-0318-20150318-column.html", "Title": "[ Rep. Aaron Schock should have kept his shirt on]"}