{"Content": "[ The walls in the new therapeutic home are made of abuse-resistant drywall. Zack Schrantz thumped a fist against the fresh gray paint. \"When youre in your 10th placement,\" he said, \"youre going to take it out on the walls.\", It was Tuesday morning, and Schrantz, 48, the president of the UCAN social service agency, was showing me around the new \"therapeutic youth home\" the agency is about to open in North Lawndale. He thumped the wall again. \"You cant put a fist or a foot or a chair through this easily,\" he said. By the end of August, 65 young people will be living on this seven-and-a-half acre West Side campus that Tuesday was still rumbling with bulldozers. Theyre kids who became wards of the state because their parents couldnt, or simply didnt, take care of them. Some have had almost as many homes  placements  as theyve had birthdays, and in each new place theyve encountered a new set of rules, a new set of people, new reasons to punch a wall. Anita Heath walked home Thursday onWest 16th Street, acrossfrom the only building standing. Red, white and blue balloons tied to a Coca-Cola crate marked a memorialfor a 50-year-old store employeenamed Edgar. Co-workers said he was on a smoke break Wednesday night when he was killed, an apparent... Anita Heath walked home Thursday onWest 16th Street, acrossfrom the only building standing. Red, white and blue balloons tied to a Coca-Cola crate marked a memorialfor a 50-year-old store employeenamed Edgar. Co-workers said he was on a smoke break Wednesday night when he was killed, an apparent... \"When they come to us,\" Schrantz said, \"they have no reason to trust this will be any different.\", But everything about this new home is designed with the idea that it will be different, and not just because the AC works and the floors are stylish laminate planks instead of the battered carpet in the old North Side building UCAN sold to help finance the new enterprise. This home is designed to provide three things that Schrantz repeats like a mantra: \"Security, privacy and healing.\", Schrantz, who began working as a foster care case manager at 22, uses the word \"heal\" a lot. Not reform. Not fix. Not change. Heal. Its the language of the physician, not the jailer, an important distinction. This is not a juvenile detention center. Some of the kids who will live here may have broken a law, but thats not why theyre in a group home. Theyre there to recover from the traumas theyve endured in their short lives. \"Security, privacy and healing,\" Schrantz repeated as we walked around. We peeked into the giant gym, where a worker was tidying up the stripes on the shiny floor. We passed living rooms and therapy rooms and a nook for washer-dryers, twice as many here as at the old place. \"For teenagers, very important,\" Schrantz said. We rode an elevator to a residential floor. The small bedrooms, each for one occupant, flank short hallways, all of the doors visible from a small glass-walled office where staff members can sit when theyre not out mingling. The beds, made of hard plastic, are bolted to the floor, so theyre hard to disassemble. The big windows allow a lot of light but dont open. The exterior doors have a \"delayed egress,\" meaning that a 10-second alarm will sound when someone tries to leave without permission. Healing comes with certain practical restraints. \"No breakable light fixtures,\" Schrantz said, pointing to a light fastened high on a bedroom wall. \"Or anywhere you could hide something to harm yourself.\", UCANs big new campus on West Fillmore Street was once part of the Sears, Roebuck & Co. empire. The land sat empty for 40 or so years, occupied by weeds and trash, or, for a while, a community garden, while much of the neighborhood around it withered. But even in a neighborhood desperate for investment, the agencys arrival wasnt immediately welcomed. Schrantz recalls an early community meeting at the nearby Sunrise Baptist Church. A woman stood up. \"Let me be clear,\" he remembers her saying. \"We love the work you do. But we dont want you here.\", The UCAN staff, however, thought it was an ideal spot. One reason was that many of the kids who come into the foster care system come from the vicinity of North Lawndale, and this was a chance to keep them connected to their families. It was also a way of investing in the neighborhood. Schrantz says that half the spending on the project  a mix of public and private financing  has gone to minority- and female-owned firms. Sixty or so people from the area have been hired to work jobs that will remain when construction is done. A few days ago, some of the young people who will move in attended a nearby block party and helped collect trash. It was a way for them to meet the neighbors and the neighbors to see who they are. \"Its not kiddie jail,\" said Fred Long, UCANs director of government affairs. Long, who was taking the tour with us, knows how \"UCAN kids\" are sometimes perceived. He knows because he was one. He spent much of his childhood in foster care then lived for a while in a UCAN apartment in Rogers Park. A few years ago, he and four other \"UCAN guys\" recorded a CD that included such songs as \"Group Home Felon,\" which played on the misperception. Still, he and Schrantz know that healing is hard work, slow work. The new kitchenettes, the playing fields and the healing garden come with no guarantees. If putting this home in North Lawndale makes it easier for some kids to stay connected to their families, it could also make them prey to old dangers. Making it work will take trust. It will take time. It takes hope. \"This is risky business,\" said Schrantz. \"We are working with very vulnerable young people, very vulnerable families. There are no easy answers. But if we dont try to do our part, whos going to?\", mschmich@tribpub.com, Twitter @MarySchmich]", "Date": "20150804", "Author": "[ Mary Schmich]", "Link": "http://www.chicagotribune.com/news/columnists/schmich/ct-north-lawndale-youth-home-mary-schmich-met-0805-20150804-column.html", "Title": "[ North Lawndale home for youth an exercise in healing]"}