{"Content": "[ Seven years ago, the Rev. James Meeks, then a state senator, persuaded 1,000 Chicago parents to keep their children out of class on the first day of school. Instead, the students rode buses to New Trier High Schools Northfield campus to protest Illinois unjust school funding formula. Meeks was frustrated with the Illinois General Assemblys laziness in fixing the way this state pays for schools. He took dramatic action  controversial action  to bring attention to the inequities in the funding formula. His protest ended in a North Shore forest preserve where Chicago Public Schools kids mingled with about a dozen New Trier kids whose parents let them participate in Meeks act of civil disobedience. \"Does it help for us to come here?\" one New Trier student asked the crowd that September afternoon. \"Yes, it helps a lot,\" a CPS student answered. \"It shows someone cares.\", Yet nothing has changed since that day in 2008. Meeks introduced legislation to try to close the inequity gap, reduce the reliance on property taxes and infuse accountability into school performance. His bill failed. Not many elected officials or teachers unions or social service groups during the past 20 years have cared about the way Illinois pays for its schools. No one fights for the Illinois Constitutions language that the state take on the \"primary\" responsibility for funding public schools. We continue to rely heavily on local property taxes. Illinois Senate President John Cullerton spent an hour with the Tribune Editorial Board on Wednesday. There were no injuries. Cullerton came with an agenda  more on that in a minute  and endured our questions on other matters. Not once did he use the word \"extreme\" to describe Gov. Bruce Rauner.... Illinois Senate President John Cullerton spent an hour with the Tribune Editorial Board on Wednesday. There were no injuries. Cullerton came with an agenda  more on that in a minute  and endured our questions on other matters. Not once did he use the word \"extreme\" to describe Gov. Bruce Rauner.... If you live in an area with property wealth, you might grumble about your high tax bill. But you probably have a well-resourced public school system as a result. If you live in an area without property wealth, youre paying more out of your own pocket for your schools. And your schools probably have far fewer resources and mediocre outcomes for the students. Just as school-choice advocates say: A childs education should not be determined by his or her ZIP code. The way we fund schools perpetuates that immorality. And if were not going to make progress on school choice  Illinois continues to move backward in that area  the next best alternative is correcting a dysfunctional school aid formula. Legislation that will be reintroduced in the Illinois Senate next week would tackle a number of issues, including freezing property taxes and throwing a lifeline to Chicago Public Schools pension obligations. But the most important thing the bill would do is sunset the current school state aid formula. Sponsored by Senate President John Cullerton, D-Chicago, the bill would create a committee to come up with a better formula, and this time the clock would be ticking. Sunsetting the formula would force action. This week has brought more grim news for Chicago taxpayers. Fitch Ratings on Monday downgraded the debt of Chicago Public Schools to junk status. It was not a surprise. Moodys Investors Service dropped CPS into the junk category in May. It seems only a matter of time before Standard & Poors does... This week has brought more grim news for Chicago taxpayers. Fitch Ratings on Monday downgraded the debt of Chicago Public Schools to junk status. It was not a surprise. Moodys Investors Service dropped CPS into the junk category in May. It seems only a matter of time before Standard & Poors does... Republicans in the Senate voted \"present\" on the bill when it came up for a vote earlier this month. Answering to Republican Gov. Bruce Rauner, they wanted restrictions on teachers unions and prevailing wage limitations included. Last year, they wouldnt talk about the funding formula unless the state addressed pension costs. Its time for Republicans to show some courage and vote for a bill that will have greater impact statewide, particularly for south suburban, downstate and rural school districts suffering from dwindling property wealth. Those districts stand to gain through reworking education funding. While money isnt the most important factor toward improving educational outcomes, its a big factor. You can be an engaged parent devoted to your kids schooling and still get undercut by the system. Why? Because basing education funding on property wealth means the wealthier districts get the best teachers, more teacher aides, more speech pathologists, more special education experts, more counselors, more social workers, wider curriculum choices, deeper athletic programs and on and on. The schools with lower property wealth and more challenges get fewer resources. Less help. Less opportunity  even with involved, loving parents. Look, there will always be a resource gap in what wealthy and poor communities can offer their kids. But that gap has become an absolute embarrassment in this state. It needs to be narrowed. Cullertons bill takes a much-needed step in that direction. Kristen McQueary is a member of the Tribune Editorial Board. kmcqueary@tribpub.com, Twitter @statehousechick]", "Date": "20150730", "Author": "[ Kristen McQueary]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-illinois-school-funding-rauner-cullerton-meeks-perspec-0731-jm-20150730-column.html", "Title": "[ Rauner, GOP should say 'yes' to fixing school funding]"}