{"Content": "[ Former President Jimmy Carter, who at age 90 still travels the world supporting the humanitarian endeavors that have consumed his time in the decades since he left office, announced Wednesday he has cancer that has spread to other parts of his body. \"Recent liver surgery revealed that I have cancer that now is in other parts of my body,\" Carter said in the statement released by the Carter Center. \"I will be rearranging my schedule as necessary so I can undergo treatment by physicians at Emory Healthcare.\", The statement makes clear that Carters cancer is widely spread but not where it originated, or even if that is known at this point. The liver is often a place where cancer spreads and less commonly is the primary source of it. The statement said further information will be provided when more facts are known, \"possibly next week.\", Carter announced on Aug. 3 that he had surgery to remove a small mass from his liver. Good wishes poured in on social media after Carters announcement, while President Barack Obama said he and first lady Michelle Obama wish Carter a fast and full recovery. \"Jimmy, youre as resilient as they come, and along with the rest of America, we are rooting for you,\" Obama said in a statement. Carter was the nations 39th president, defeating Gerald Ford in 1976 with a pledge to always be honest. Before his career in politics, Carter graduated from the U.S. Naval Academy and served seven years in the Navy submarine force. Former President Jimmy Carter announced he has been diagnosed with cancer on August 12, 2015. (WGN-TV), Former President Jimmy Carter announced he has been diagnosed with cancer on August 12, 2015. (WGN-TV), A Georgia peanut farmer who had been a state senator and governor of Georgia for a single term before running for president, Carter ended up seeing his second term for president doomed by a number of foreign policy conflicts, most especially the Iran hostage crisis  losing in a landslide to Ronald Reagan in 1980. He spent the decades since carving out a reputation for promoting such global issues as health care and democracy, often with his wife Rosalynn by his side. He joined the staff of Emory University and in 1982 established the Carter Center to promote those issues. His new role as global statesman took him into places often shunned by other diplomats. Carter helped defuse nuclear tensions between the Koreas and monitored the first Palestinian elections. In 2002, he won the Nobel Peace Prize. According to the Carter Center, he and Rosalynn volunteer one week a year for Habitat for Humanity, a nonprofit that helps build and renovate homes for people in need. Jimmy Carter let me down. Not with his book \"A Full Life: Reflections at 90\"  a warm and detailed memoir of his youth followed by a clear-eyed assessment of the issues he tackled as president and afterward  but with his response to the question \"Does the arc of history bend toward justice?\", \"Im... Jimmy Carter let me down. Not with his book \"A Full Life: Reflections at 90\"  a warm and detailed memoir of his youth followed by a clear-eyed assessment of the issues he tackled as president and afterward  but with his response to the question \"Does the arc of history bend toward justice?\", \"Im... Despite remaining active through the years, Carters health has recently become the subject of speculation. In May, he was forced to cut short an election observation visit to Guyana when he developed a bad cold. Carter also completed a book tour this summer to promote his latest work, \"A Full Life.\", Carter included his familys history of pancreatic cancer in that memoir, writing that his father, brother and two sisters all died of the disease and said the trend \"concerned\" the former presidents doctors at Emory. \"The National Institutes of Health began to check all members of our family regularly, and my last remaining sibling, Gloria, sixty-four, was diagnosed with pancreatic cancer and died in 1990,\" Carter wrote. \"There was no record of another American family having lost four members to this disease, and since that time I have had regular X-rays, CAT scans, or blood analyses, with hope of early detection if I develop the same symptoms.\", Carter wrote that being the only nonsmoker in his family \"may have been what led to my longer life.\", \"Our thoughts and prayers go out to President Carter,\" said Dr. Len Lichtenfeld, deputy chief medical officer of the American Cancer Society. \"Theres a lot we dont know,\" but the first task likely will be determining where the cancer originated, as that can help determine what treatment he may be eligible for, Lichtenfeld said. Sometimes the primary site cant be determined, so genetic analysis of the tumor might be done to see what mutations are driving it and what drugs might target those mutations. \"Given the presidents age, any treatments, their potential and their impacts, will undoubtedly be discussed carefully with him and his family,\" he added. Age by itself does not preclude successful cancer treatment, said Dr. Lodovico Balducci, a specialist on treating cancer in the elderly at the Moffitt Cancer Center in Tampa. Much depends on the patients \"biological\" age versus his actual years, he said. \"A man 90 years old normally would have a life expectancy of two or three years, but Jimmy Carter is probably much younger than that\" in terms of his function, Balducci said. \"If he tolerated liver surgery I imagine he has a relatively good tolerance\" to other treatments that might be tried. For example, Moffitt has developed a scoring system to estimate how well an older person would tolerate chemotherapy, and the risk of serious side effects. The first task is to determine if the cancer is curable, \"which is unlikely with metastatic cancer,\" or if it is possible to meaningfully prolong the life through further surgery or other treatments, Balducci said. \"Cancer in a 90-year-old is a serious problem, but that does not mean a 90-year-old cannot benefit from treatment.\", Carter Center spokeswoman Deanna Congileo earlier this month called the liver surgery \"elective\" and said Carters \"prognosis is excellent for a full recovery.\", An Emory spokesman declined comment Wednesday. The health care systems Winship Cancer Institute in Atlanta touts its designation as a National Cancer Institute center and a recent U.S. News and World Report ranking among the top 25 cancer programs in the U.S. on its website. Associated Press]", "Date": "20150813", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/ct-jimmy-carter-cancer-20150812-story.html", "Title": "[ Former President Jimmy Carter says he has cancer, revealed by recent surgery ]"}