{"Content": "[ Anyone who is unaware that we face a massive problem involving college student debt, contact Earth at your first convenience. The troubling facts are almost universally known: After tripling in 10 years, this debt totals more than $1.3 trillion, which is more than the debt for credit cards, auto loans and any other category except home mortgages. Default rates parallel those for the subprime housing loans of the financial crisis, and the debt numbers show no signs of decelerating, growing again this year by an estimated 8 percent. The damage to young peoples individual futures is compounded, we now know, by harm to the broader economy and society. Home ownership, marriage, childbearing and new-business formation rates are all down among todays younger cohorts, and causal relationships to student debt have been established. No one knows all this more pressingly than the 43 million indebted students, and former students and their families, who owe the federal government (or, in a declining number of cases, a private lender) an average of $27,000. Not dischargeable even in most bankruptcies, these obligations are a modern form of indentured servitude. Into this dismal picture a glimmer of a better idea has appeared. Income-share agreements, under which a student contracts to pay investors a fixed percentage of his or her earnings for an agreed number of years after graduation, offer a constructive addition to todays government loan programs and perhaps the only option for students and families who have low credit ratings and extra financial need. ISAs are neither a new nor untried idea. Milton Friedman proposed them more than a half-century ago, and there is a market for them today in Colombia, Mexico, Chile and other Latin American countries. From the students standpoint, ISAs assure a manageable payback amount, never more than the agreed portion of their incomes. Although every provider is different, terms tend to range from 5 percent to 10 percent of income for 10 to 15 years, or somewhat higher (10 percent to 15 percent for shorter contracts such as five to seven years). Best of all, they shift the risk of career shortcomings from student to investor: If the graduate earns less than expected, it is the investors who are disappointed; if the student decides to go off to find himself in Nepal instead of working, the loss is entirely on the funding providers, who will presumably price that risk accordingly when offering their terms. This is true \"debt-free\" college. Ask many college presidents why tuition costs keep rising and youll hear a litany of excuses: We have to pay superstar profs. Build comfortable facilities to attract hedonistic students. Keep up a sprawling, aging infrastructure. Offer more scholarships to low-income students. Meet federal and... Ask many college presidents why tuition costs keep rising and youll hear a litany of excuses: We have to pay superstar profs. Build comfortable facilities to attract hedonistic students. Keep up a sprawling, aging infrastructure. Offer more scholarships to low-income students. Meet federal and... As an ISA market develops, students will benefit further from the market signaling that tells them which fields are most likely to be rewarded economically. A chemical engineer, for instance, is likely to negotiate a much lower repayment rate or shorter repayment term than her art history roommate. Because of these student-friendly advantages, ISAs have gained support from an unusually broad spectrum of experts. Beth Akers of the Brookings Institution wrote, \"[ ISAs] should have a place in the landscape of services available in the heterogeneous market for higher education.\" An analyst at the New America Foundation said, \"Its only a matter of time before people start skipping private student loans altogether and jump straight to ISAs.\" Scholars at the American Enterprise Institute concluded, \"ISAs are better suited for student financing than traditional student loans.\" This growing consensus adds credence to the concepts viability and fosters hope that the few legal uncertainties and ambiguities that cloud the ISA picture might be clarified by Congress through bipartisan legislation introduced three weeks ago. A number of companies and funds have already organized to serve this new market, eagerly awaiting college partners prepared to add ISAs to their menu of student-aid choices. More Illinois students have gulped hard at the rocketing cost of a University of Illinois diploma, which is up 71 percent in a decade. The number of accepted in-state applicants who decide to enroll at the university has declined. Theyre going elsewhere, including other Midwest colleges that offer... More Illinois students have gulped hard at the rocketing cost of a University of Illinois diploma, which is up 71 percent in a decade. The number of accepted in-state applicants who decide to enroll at the university has declined. Theyre going elsewhere, including other Midwest colleges that offer... The Purdue Research Foundation recently commenced a formal solicitation to help us find a partner for our ISA program. We are seeking business acumen, administrative capabilities to run the program efficiently and transparently, and strong consumer protections for any interested students. Betting on a Boilermaker will be a highly promising investment. Our graduates become promptly employed at high levels and with high average starting salaries. As one of the worlds premier STEM institutions (Purdue is third among public research universities in the percentage of students earning degrees in science, technology, engineering and mathematics), we confer degrees in 11 of the top 12 disciplines ranked by career earnings. We will likely manifest our pride and confidence in our students by participating as an institutional investor in the partner fund, as no doubt will many of our alumni  though Purdue, and some of those alums, will choose not to take the earnings the ISAs generate but to leave them in the fund for the benefit of future Boilermakers. Even after four years of zero tuition increases (including the next two academic years), and reductions to board and textbook costs, a Purdue education remains a big expense. Our commitment to keeping access to our land-grant school within the financial reach of all qualified students is one reason we seek to add this no-debt, low-risk option to our catalog of financial assistance. In contrast to the innovative ISA proposal, the student debt run-up has spawned a number of truly bad ideas. The most specious and counterproductive of these are suggestions to simply hand out even more public funds  a \"hair of the dog\" policy if ever there was one. It is fallacious to term such an approach \"debt-free\"; borrowed by an already bankrupt federal government, the money will be all debt, merely shifted to taxpayers, including these very same students as they enter their working years. Already facing $57,000 per person in federal debt, incurred not for their future but almost entirely for the current consumption of their elders, the last thing todays young people need is another massive federal entitlement program. Its time for a new approach that can allow ambitious young people to work their way through college once they have completed college, free of the burden that todays student debt imposes on them and on our whole country. Washington Post, Mitchell E. Daniels Jr. governor of Indiana from 2005 to 2013, is president of Purdue University.]", "Date": "20150821", "Author": "[ Mitchell E. Daniels Jr.]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-student-loan-debt-mitch-daniels-purdue-20150821-story.html", "Title": "[ Mitch Daniels op-ed: A fix for student loan debt]"}