{"Content": "[ For lifelong Chicagoan Ron Hall, a bite into a Maurice Lenell cookie brings flashbacks to his younger days  from grade school field trips to the former cookie factory on Harlem Avenue in Norridge to walking his beat as a police officer while snacking on the sweets. But soon, Hall and other Maurice Lenell fans will have to find other ways to satisfy their nostalgic cookie cravings. The company that has been producing a limited supply of the cookies since the Maurice Lenell Cooky Company went bankrupt in 2008 has pulled the plug on pinwheels, jelly stars and other sentimental favorites. \"We dont want to be the bad guy that discontinued the tradition and legacy,\" said Roy Jasper, vice president of sales and marketing for private labels at Ohio-based Consolidated Biscuit, which took over production seven years ago. \"It just didnt make sense for us anymore.\", The company, which produced about 275,000 packages of Maurice Lenell cookies annually, discontinued the line shortly after the new year, when it also took down its website offering holiday gift tins. Antiquated equipment, slow sales and recipes that included controversial trans fats all led to the decision to stop making the cookies, Jasper said. Today, all that remains of the old-fashioned treats are whats left in stores, including The Cookie Store and More, which opened in 2010 blocks away from the shuttered factory to serve as the unofficial local outlet for the brand. The store now has a \"Last Chance for Maurice Lenell\" countdown sign hanging in the front window. As of Thursday, the sign said 18 days until supply runs out, said Jeff Bach, the stores owner. \"People drive an hour or more to get these cookies,\" said Bach, who plans to close his nostalgic Chicago snack business after the Maurice Lenell cookies  his most popular item  run out. \"I have a whole bunch of people that I need to disappoint.\", In the 1920s, three Swedish immigrants  brothers Hans and Gunnar Lenell and their friend Aagard Billing  launched Lenells, a Swedish bakery offering cakes, breads and cookies, said Jill Bocskay-Cartalucca, granddaughter of Hans Lenell. Using butter, cardamom, saffron, nutmeg, almond and other ingredients for recipes from their homeland, their bakery quickly grew and, after a few years, was reorganized to focus on its popular cookies. Renamed Lenells Cookies, and later Maurice Lenells Cooky Company, the business remained family-run through the 1980s as the founders children took over production of Spritz, Powder Puffs, Almonettes and other popular treats, Bocskay-Cartalucca said. Maurice was the middle name of one of the founders sons, she said. \"We have wonderful, wistful memories of playing hide-and-seek in the warehouses, playing with new recipes in the lab with Daddy, bringing our Scout troops through on tours of the bakery and excitedly bringing bags of cookies to school for our class treats,\" Bocskay-Cartalucca said. But in 1985, the family sold the business. In 2008, the Maurice Lenell Cooky Company went bankrupt and its Harlem Avenue factory closed. Christina Cork, a mail carrier at the post office thats blocks away from the former factory, said the neighborhood felt the loss when the bakery closed and the aroma of cookies no longer wafted over surrounding streets. Devoted cookie customers were relieved, however, that Consolidated Biscuit had purchased the factorys equipment and trademarks with a promise to continue the tradition. Bach, who had worked as a food distributor for years, knew that if he opened a retail outlet offering the sentimental favorites near the factorys former location, cookie lovers would bite. \"This was a nice thing, that you can come get cookies and take them to work,\" said Cork, who has stopped to buy Maurice Lenell cookies  first from the factory and later from The Cookie Store  for the last 30 years. Seven days a week, Bach greets 40 to 50 customers looking to buy $2.99 packages of Maurice Lenell cookies. He also has a thriving website to fill orders of Maurice Lenell cookies for out-of-town customers. At Christmastime, Bach sold enough Maurice Lenell holiday tins to cover his expenses for the entire year, he said. When Consolidated Biscuit officials hinted that production was coming to an end late last year, Bach ordered as many cookies as he could. Only a few hundred of those 32,000 packages remain for sale in the store and online. \"I have customers from all over the U.S.,\" said Bach, who is hoping another company might swoop in to rescue the brand. \"I just think its a part of Chicago history.\", Jasper, at Consolidated Biscuit, said that as the equipment used to make the old-fashioned cookies aged, the undertaking became hard to justify. Engineers estimated it would cost more than $150,000 to rebuild the two machines needed to continue production of the pinwheels and jelly stars, Jasper said. And the company was also feeling pressure  from both Food and Drug Administration guidelines and customer feedback  to revise the recipe to remove partially hydrogenated oils, Jasper said. \"Looking at the formula, it changes the whole cookie,\" he said. The company maintains one contract with OfficeMax and Office Depot stores, which offer one-pound boxes of Maurice Lenell cookies to certain corporate customers. But production of the rest of the line has ceased, and no more cookies will be available to consumers, Jasper said. Bocskay-Cartalucca, who saved a roll of parchment paper from the old factory before it closed and still uses it when she bakes, says she has noticed packages of Maurice Lenell cookies becoming harder to find at grocery stores in recent months. She planned to contact the company to discuss getting back the legal rights. \"I would simply like to bring the name back to my family,\" she said. \"Sentimental to a fault.\", Bach is expecting emotional patrons  many of whom can still sing the companys famous jingle  in the next several weeks as he continues to break the news to customers that the Maurice Lenell tradition is ending. When Hall, the retired police officer, recently stopped by to pick up a four-pack of cookies to give as a gift, the pinwheels were all gone, as were the jelly stars. There were still packages of chocolate chip and English toffee available. \"Its going to be very, very sad when theyre gone,\" Hall said. \"Its just sad that this is over.\", vortiz@tribpub.com, Twitter @vikkiortiz]", "Date": "20150813", "Author": "[ Vikki Ortiz Healy]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-maurice-lenell-cookies-met-20150811-story.html", "Title": "[ Chicago cookie tradition ends as Maurice Lenell production stops]"}