{"Content": "[ With only days to go before a deadline to reach agreement, Irans supreme leader, Ayatollah Ali Khamenei, is playing his hand to the hilt. He sounds like a veteran negotiator who is confident of winning because he knows the other side is more eager for a deal than he is. In a televised speech this week, Khamenei outlined his terms for a nuclear deal with the West, including:, -Economic sanctions must be lifted once Iran signs the deal. The U.S. and its allies insist that Iran has agreed that sanctions will be eased in stages, as Iran fulfills its part of the bargain. -No international inspections of Irans military sites. The U.S. and its allies have long suspected that Iran carried out nuclear weapons research at those sites. Thats why anywhere anytime inspections are a key Western demand to ensure that Iran cant quickly develop a nuclear weapon. -No freeze on Irans nuclear enrichment program for a decade or more. Preventing Iran from operating advanced centrifuges or building significant stockpiles of higher-enriched uranium are key parts of the preliminary deal to curb Irans rogue nuclear program. The ayatollah sounded as if he hadnt been briefed  or maybe he conveniently forgot  that Tehran had already agreed to a freeze in the preliminary deal announced earlier this year. Could Khamenei be bluffing, posturing for hard-liners in his country but prepared to compromise to win an end to crippling Western-imposed economic sanctions? Sure. But we wouldnt bet on that  and neither should Western negotiators. For years, the U.S. and its allies have accused Iran of violating U.N.-imposed nuclear sanctions. A special panel of experts set up by the U.N. has investigated a steady torrent of those complaints. Now the panel has a complaint of its own: Where are all the complaints?, The panel said in a recently... For years, the U.S. and its allies have accused Iran of violating U.N.-imposed nuclear sanctions. A special panel of experts set up by the U.N. has investigated a steady torrent of those complaints. Now the panel has a complaint of its own: Where are all the complaints?, The panel said in a recently... Back in April, Tehran and the West celebrated a preliminary deal with promises to fill in the blanks  a lot of technical detail  by June 30. With the deadline near, however, many of those blanks seem to be ... still blank. All the evidence suggests that Tehran wants a deal, but only on its terms. And the only backpedaling we detect is from the Western side. Case in point: The key Western demand that Iran come clean about its past nuclear weapons development work, as it has promised for years. Irans response to this has been the same as its response to most International Atomic Energy Agency questions: A firmly upraised middle digit. Inspectors need to know about Irans past research to set a baseline that could be used to determine later whether Iran has violated nuclear research limits imposed by a deal. Just as important: Without that information, inspectors wont be able to accurately calculate how much time Iran would need to break out and build a nuclear weapon. Will the U.S. and its allies stick to this critical demand? Dont count on it. Recently Secretary of State John Kerry said that the U.S. was not fixated on Iran specifically accounting for what they did at one point in time or another. We know what they did. We have no doubt. ... What were concerned about is going forward. That sounds like the U.S. and its allies could be folding to the poker-faced ayatollah. We hope not. Iran cant be rewarded for flouting inspectors for a decade. Nor can its past nuclear work be shuffled off as irrelevant to the future. Iran has to come clean to the IAEA. Officials now hint that negotiations could slip beyond next weeks deadline. The ayatollah doesnt look like hes sweating. Neither should the U.S. and its allies. In March, President Barack Obama said that if a strong agreement that restrains Iran from breaking out or cheating its way to a nuclear weapon isnt reached, then we walk away. We hope he means that. Some of his former top aides dont sound so sure. In a recent open letter, they expressed fears that the developing deal may fall short of meeting the administrations own standard of a good agreement. Again, those arent political opponents sniping. Those are former high-ranking members of Obamas team, including former CIA Director David Petraeus; Dennis Ross, who oversaw Iran policy at the White House; and Robert Einhorn, a former State Department expert who helped create and enforce economic sanctions against Iran. Assuming theres a deal, Congress will have a chance to weigh in. Heres a sure bet: A deal that gives away too much for too little has no chance to survive U.S. lawmakers scrutiny.]", "Date": "20150625", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-iran-nuclear-deadline-kerry-obama-editorial-20150624-story.html", "Title": "[ The ayatollah's poker face]"}