{"Content": "[ Texas Attorney General Ken Paxton had an investment opportunity: a tech startup making data servers. He told people he had put his own money into Servergy Inc. according to prosecutors, and helped persuade a state lawmaker and another wealthy businessman to buy more than $100,000 in shares. All the while, Paxton was actually being compensated by Servergy, according to an indictment unsealed Monday, the same day the states top law enforcement officer turned himself into jail on securities fraud charges. The alleged deception took place before Paxton took office in January. If convicted, the rising Republican star could face five to 99 years in prison. It was a low moment for a tea-party favorite who is barely seven months on the job, and whom GOP presidential candidate Ted Cruz candidate called a \"tireless conservative warrior\" when Paxton ran for office last year. Attorneys for Paxton, 52, said he will plead not guilty to two counts of first-degree securities fraud and a lesser charge of failing to register with state securities regulators. \"He is looking forward to the opportunity to tell his side of the story in the courtroom,\" said Dallas attorney Joe Kendall, adding that a judge instructed Paxtons lawyers not to comment further. A frenzy of media outside the Collin County jail in Paxtons hometown was reminiscent of a year ago, when then-Texas Gov. Rick Perry was booked after being indicted on charges of abusing his power with a 2013 veto. But whereas Perry defiantly welcomed the cameras at jail, Paxton ducked reporters after his booking, driving away in a black SUV. A grand jury has indicted Texas Attorney General Ken Paxton on felony securities fraud charges that accuse the Republican of misleading investors before he took over as the states top law enforcement officer, a special prosecutor said Saturday. Kent Schaffer, a Houston defense attorney appointed... A grand jury has indicted Texas Attorney General Ken Paxton on felony securities fraud charges that accuse the Republican of misleading investors before he took over as the states top law enforcement officer, a special prosecutor said Saturday. Kent Schaffer, a Houston defense attorney appointed... Nor did top Texas Republicans rush to Paxtons side with the same outrage as they did with Perry, whose case has not yet gone to trial. Republican Gov. Greg Abbott, who last held the attorney general job, issued only a brief statement that urged the justice system to play out. \"I recognize this is the first step in a lengthy process and will respect that process as it moves forward,\" Abbott said. The Collin County normally jail makes suspects wear a towel around their neck before taking their mug shot. Paxton was allowed to be photographed without one, allowing his suit and red tie to be part of his booking photo. Just as Perry was allowed to finish his term after his indictment, Paxton can stay on the job while his criminal case proceeds. However, some are already calling for him to resign, including several Democratic Party officials. In the middle of a heated Republican primary last year, Paxton admitted to violating state securities law by not telling regulators that he got commissions for referring law clients to a financial planner. He paid a $1,000 fine and chalked it up as an administrative oversight. Texas Democratic Party Chairman Gilberto Hinojosa issued a statement Monday calling Paxton \"an admitted lawbreaker\" who \"needs to spare Texas the embarrassment of a drawn out legal fight in the public eye, take responsibility, and accept the consequences.\", Questions about Paxtons financial dealings shadowed him during his first seven months on the job. His aides have denied any wrongdoing by Paxton and described the criminal investigation led by two special prosecutors as a political smear campaign. According to prosecutors, Republican state Rep. Byron Cook was among those duped. While serving in the Legislature In 2011, Paxton told Cook that he personally invested in Servergy and offered Cook a chance to buy more than $100,000 of stock in the company, according to the indictment. Unbeknownst to Cook, Paxton had been given more than 100,000 shares of Servergy stock, according to the indictment. Cooks lawyer, Terry Jacobson, declined to comment Monday. The Associated Press reported last month that Paxton listed himself as a shareholder in Servergy and that his name was among search terms that Servergy attorneys used to satisfy a federal subpoena. The company is under investigation by the U.S. Securities and Exchange Commission over allegations of deceiving investors. While top Republican leaders were cautious in their remarks about Paxton, the Texas GOP struck a defiant tone, calling the grand jury process \"sloppy\" and praising Paxtons performance in office. Paxton joins other current or recent state attorneys general facing criminal charges. In Pennsylvania, a grand jury in January recommended that state Attorney General Kathleen Kane face charges over allegations of engaging in a cover-up and lying about her role in a grand jury leak to a newspaper. Kane, a Democrat who took office in 2013, has not been charged and has denied breaking any laws. Utahs previous two attorneys generals were also arrested last summer on charges of running pay-to-play schemes during their combined 13 years in office. Associated Press]", "Date": "20150803", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-texas-attorney-general-investigation-20150803-story.html", "Title": "[ Texas attorney general accused of lying to investors]"}