{"Content": "[ Hillary Clinton says she has never smoked pot, not even as a bell-bottom-wearing undergraduate in the 1960s. Her husbands administration went nuclear in the War on Drugs. During the 2008 campaign, she publicly opposed marijuana legalization. But its now seven years later, and the marijuana industry isnt selling baggies and answering beepers. Its a $2.7 billion business-the fastest-growing in the United States-and one that operates without any legal sanction in four states, is decriminalized in 16 others, and is permitted for medical use in a few more. And now people that are selling, growing, and, in some cases, using marijuana have money to burn. They want to give some of that green (not that, the other green) to politicians hungry for donations. But they want some answers first. At an August fundraiser at the home of Democratic consultant Win McCormick and Carol Butler in the exclusive Dunthorpe neighborhood of Portland, Oregon-a state that legalized marijuana in 2014-nearly a dozen cannabis industry professionals paid $2,700 a head to get an audience with the Democratic front-runner and former secretary of state. There, she mentioned working with Portland Rep. Earl Blumenauer, one of Capitol Hills loudest advocates of pot legalization, on, among other items, \"cannabis reform.\", \"We all cheered. We were all just so happy to even hear her mention the word cannabis,\" said Leah Maurer, a pro-pot activist whose Portland-based Moms for YES on Measure 91 organized around the legalization battle in Oregon last year. When Clinton made her way through a line of donors, Maurer grabbed her hand and said, \"Thank you for all the work you have done. I really need you to consider coming out in favor of reclassifying marijuana. Its an issue that no Republican is going to touch and it would be hugely significant to your campaign.\", \"I spoke to Earl Blumenauer about that,\" Clinton responded, according to Maurer. \"I am thinking about it.\", Behind Maurer stood half a dozen other industry professionals and advocates, waiting to capitalize on their own $2,700 moment with the candidate and push the pot industrys pet issues. \"We have to figure out how to thread the needle between the states and the federal government,\" Clinton told another donor during their grip-and-grin, according to a person who was there.The pot industrys cravings, What did these pot industry professionals want? Some clarity, for one thing. The Obama administration has willfully turned its head away from the legalization experiment and the thorny interstate issues it has raised. And even though the industry has boomed since marijuana was legalized in Colorado, Washington, Alaska, and Oregon over the last three years, the growing crop of pot entrepreneurs faces serious problems. For one thing, marijuana remains a Schedule 1 drug, on par with heroin, quaaludes, and bath salts, a classification which limits the ability of researchers to study it, and forbids its use. (A Schedule 2 drug, like codeine, is acknowledged to have some medical uses, and is available for research.), Plus, they want access to the banking system. For now, even legal marijuana businesses remain all-cash, since many banks wont accept their money for fear of violating federal laws, and sellers and grow operations are unable to deduct their businesses expenses like other entities. Few advocates want the federal government to impose legalization by diktat, but want states to continue to be able to pass new liberties as they see fit. And so at a bare minimum, what the pot lobby wants from politicians this year and beyond is a commitment to let this state-by-state experiment that the Obama administration tacitly condones to continue to play itself out. The thinking goes that, much like the gay marriage debate, once enough states legalize it, the federal government will have to adapt. The presidential candidates have largely been reluctant to discuss pot out on the campaign trail. On both sides of the aisle, everyone from former Florida Governor Jeb Bush to Texas Sen. Ted Cruz to former Maryland Gov. Martin OMalley and even to socialist Vermont Sen. Bernie Sanders have been cautious, saying they would have voted \"no\" if they lived in a state with a pot question on the ballot, but are willing to let the experiment continue. The exception to this has been Kentucky Sen. Rand Paul, who has introduced a bill to end the federal ban on medical marijuana. Staking out an opposite position are Florida Sen. Marco Rubio and New Jersey Gov. Chris Christie, who told a town hall audience earlier this year that residents of the legal-weed states better smoke em while they got em, because \"as of January 2017, I will enforce the federal laws.\", If anything, Clinton is a laggard, if a slight one. She has said that she wants to \"wait and see\" how legalization plays out in the states, but has also told a television interviewer that she doubts the efficacy of medical marijuana. \"She is basically Ted Cruz-lite on the issue,\" said Dan Riffle, the Marijuana Policy Projects director of government relations. Pro-legalization industry types, though, are sticking with Clinton anyway, for the same reason other voters are: They like her well enough, and they think that she has the best chance of being president.Legitimize it, If in industries like law, finance, or energy, corporate chieftains or their lobbying arms are weary of playing the political game, with its constant demands for more and more fundraising and a seemingly endless series of obligatory rubber chicken dinners just to remain in the good graces of whatever pol is doing the ask, cannabis industry types stand ready to fill in the void. They not only have a wealth of major regulatory issues before the federal government, but also sound thrilled to be invited inside the gate for the first time. \"Feeling engaged like this is something that is completely new to our members,\" said Amy Margolis, a Portland-area lawyer who runs the Oregon Cannabis Political Action Committee. \"Twenty years ago, to go out and meet Hillary Clinton and tell her you are a cannabis business owner? Are you kidding me? People realize that they can be a part of the political machine in a meaningful way, and that moves us forward.\", Her PAC raised over $160,000 in the last election cycle, mostly during a swank fundraiser at the Left Bank Annex in Portland, and sent two dozen lobbyists to Capitol Hill earlier this year to buttonhole lawmakers on their regulatory issues. \"We are not the free cannabis for all activists of 20 years ago. We are business owners, investors, lab cultivators, showing up in professional-looking suits and with the exact same talking points, saying we want to own a business in a state where that is allowed to happen,\" said Margolis. The lobbying might of the industry remains small. It spent just $80,000 on lobbying in 2014, compared to $24 million the alcohol industry spent. A trade association spent just $40,000 on its political action committee in the 2014 midterms. But the business is booming-up to perhaps $4 billion by 2016, according to the ArcView group, a cannabis investment and research firm-and Margolis, for one, said she could easily raise $200,000 from the Oregon pot business alone if Clinton committed to a fundraiser. But if the pot industry is prepared to wrap its arms around Clinton, she has been far more chilly in response. A congenitally cautious pol whose current platform differs not one iota from the standard Democratic playbook, Clinton seems unmoved even by a poll commissioned earlier this year by her own pollster, Joel Benenson, which showed that 61 percent of Americans favored legalization, with even larger majorities among exactly the kind of voters Clinton needs to excite in 2016-young people, African-Americans, and Hispanics. The Clinton campaign declined a donation from the National Cannabis Industry Association earlier this year, according to NCIA executive director Aaron Smith. And so at the industrys annual trade show in June, it was Rand Paul, and not Clinton, who was invited to hold a fundraiser on the sidelines, where 40 industry professionals maxed out to his campaign. \"Obviously, she is not against raising cannabis industry money,\" said Smith. \"We have already seen some evolution on this issue, and I think we will see further evolution between now and the general election.You wont find any other sector of  the economy that is as excited about being taxed and regulated as we are.\", And so without a warm embrace, industry professionals and advocates are forced to look for any green glimmer of hope that Clinton is on their side, like her mentioning the word \"cannabis\" in a fundraising speech. \"We felt like she was teetering on the edge of taking a side on the issue,\" said Margolis, hopefully, about the Portland fundraiser. \"Like she was at least willing to have a further conversation about it.\", Privately, however, others are hoping to move the needle further. When John Morgan, a major Democratic donor who has been partially bankrolling the medical marijuana movement in his native Florida, hosted Clinton for a fundraiser at his home, he pulled her aside beforehand in his kitchen. \"I dont want to bog you down,\" he said as he prepared to launch into his pot legalization pitch. \"I expected that we would talk about this,\" Clinton replied, according to Morgan, and the two hashed it out for 10 minutes before the event. \"I will let her speak for herself,\" Morgan told Bloomberg. \"But I made sure what her position was, and I left very satisfied.\", Blumenauer, the Portland-area congressman, said he has has discussed the issue with Clinton over a private dinner and in a subsequent follow-up phone call, and has traveled to Brooklyn to meet with her campaign staff. \"She understands. She is sympathetic. Obama has moved the needle both in terms of his personal acknowledgment that he smoked in his youth, and his statement that it is no more dangerous than alcohol, and by saying that he has bigger fish to fry than what is happening in Colorado and Washington.\", But, Blumenauer added, he was personally assured that Clinton \"would be at least as good, if not better\" than Obama on the issue. But without a clear, public signal, some industry insiders say they are getting antsy. Chris Woods, the owner of Terrapin Care Station, a pot dispensary in Boulder, Colorado, ponied up the $2,700 to attend a Clinton fundraiser in Denver with a half- dozen or so other industry professionals. There, Woods says, Clinton \"at least acknowledged\" the legalization experiment playing out in Colorado and elsewhere, without saying whether or not she supported or opposed it. Asked why he and his colleagues support Clinton, Woods responded, \"We dont support her. We would if she were more supportive of our issues, but we thought to show that the marijuana industry is present in Colorado, that we exist and are part of the economy and are creating jobs.\", By the time the campaign season was over, he expected to max out to Bernie Sanders and Rand Paul as well. Even Morgan, a diehard Clintonista of some decades, said that if another Democrat like Martin OMalley promised to decriminalize marijuana, \"I would write him a big check.\", And it would be good politics, too. \"If he did that, he would pass Donald Trumps numbers over night,\" Morgan said. \"It is the sleeping issue out there, and nobody has the balls to say it.\"Pot on the ballot in 2016-in swing states, The candidates are unlikely to be able to duck the matter for much longer, however. Legalization is set to be on the ballot in a handful of states in 2016, including the swing states of Nevada, Ohio, Maine, and Arizona, and a medical marijuana bill is likely to be on the ballot in Florida. For reformers, polls are encouraging nearly everywhere. Throw in Colorado, where a definitive majority wants the federal government to keep away from their experiment, and its hard to see a path to the White House that doesnt involve spending some serious time in the groves of the legalization movement. So why, then, are politicians, known for jumping to the front of the parade and acting as if they have been there are along, so cautious?, \"Political consultants are trained to only play in the spaces they are comfortable in,\" said Blumenauer. \"This is an emerging industry. Its not top-line, but if you care about inequalities in the criminal justice system, if you care about the economy, if you care about personal liberty, it is one you can not ignore.\", Blumenauer said he has been a Clinton backer of long- standing, but he echoed many reformers by saying that she should \"acknowledge that we are in the middle of a dramatic reassessment of the policy of prohibition, and that that policy has failed.\", \"In places that have legalized, the industry is an embedded part of the economy,\" said Smith, of the cannabis industry trade group. \"Voters rely on the industry to maintain public schools, and the exposure to the industry has shown voters not only that revenue is being generated, but that that it is good for the community as well. Tourism is up. Crime is down. Everyone in these states knows someone who would lose their job if legalization ended, and they wouldnt want to see that happen just because of some politicians backward sense of morality.\"]", "Date": "20150910", "Author": "[ David Freedlander, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-clinton-pot10-20150910-story.html", "Title": "[ Will Hillary Clinton smoke the peace pipe with the marijuana lobby?]"}