{"Content": "[ Several candidates for the three at-large positions on the Gary Common Council up for election on May 5 said theyd like to bolster the police and fire departments in Gary as a way of helping to improve the local quality of life. Those improvements went so far as some candidates suggesting pay raises for police officers and firefighters. Although there was a split during a debate Saturday at Indiana Universitys Northwest as to whether those public safety employees ought to be required to live within the Gary city limits. Six of the 10 Democratic candidates and the two Republicans who will be on the primary ballot appeared at the debate, with a crowd of about 50 spectators submitting written questions that were then asked of the candidates by debate moderator Jeffery Smith of WLTH-AM radio. When it came to pay raises for public safety personnel, candidate Richard Ligon  a parole officer who served for 36 years in the U.S. Army and Army reserve and rose to the rank of colonel  said city officials ought to seek more grants to help raise money to provide higher salaries. He said Gary loses officers to surrounding communities that can afford to pay as much as $20,000 more in annual salary. While council President Kyle Allen, who is seeking re-election, said city officials need to focus on bolstering Garys tax base so that the city can afford to pay higher salaries to public service employees. \"They deserve a raise,\" he said. Expressing a similar thought was Calumet Township official Alter Jean Moss, who cited a new police station being built in nearby communities while Gary officials work in aging facilities. \"Dont we deserve better,\" she said, adding of pay raises, \"the police officers and firefighters are paying taxes, they deserve a raise.\", Incumbent Don Spann is facing a challenge from a former councilman and a local business owner in the race for the 1st Ward town council seat in the May 5 Democratic primary. Spann, 63, has been on the council for three years, defeating one of his challengers, Andrew Sylwestrowicz, in the previous... Incumbent Don Spann is facing a challenge from a former councilman and a local business owner in the race for the 1st Ward town council seat in the May 5 Democratic primary. Spann, 63, has been on the council for three years, defeating one of his challengers, Andrew Sylwestrowicz, in the previous... Most of those partaking in Saturdays debate said they wished Indiana law would permit them to require police, fire and school teachers to live within their respective communities. Regan Hatcher, who served on the council from 2008-12 before making an unsuccessful bid for mayor in the 2011 election cycle, reminded people how she supported measures requiring Gary civil service employees to live within Gary. \"I thought we should start slow with current city workers, because then at least their dollars will turn over in our community at least once,\" Hatcher said. Jason Arndt, a 10-year resident of Gary, said he disagrees with residency requirements. Recalling classes he took when he was an Indiana University Northwest student, Arndt said he thinks Gary officials ought to focus on community quality so that police and firefighters will want to live within the city. \"We want to attract the best people for the job,\" Arndt said. \"We want to make the community more attractive for them to live in.\", On other issues, Ligon cited his own involvement in youth football programs and his wifes efforts to create basketball leagues in saying officials need to develop more activities for young people to participate in. \"We need to develop our youth into community leaders,\" he said. While Hatcher repeatedly reminded voters of how her votes while on the council often differed from her colleagues, including voting \"no\" on city budgets that came up during her term. \"Im a proud, independent thinker,\" she said. \"I was often voting alone on most ordinances.\", Saturdays debate was sponsored by a group of local activists who wanted to see forums in which candidates could answer questions. One at-large council candidate who did not participate in the event was Irene King, wife of former Mayor Scott King, who said she did not consider it legitimate because the League of Women Voters did not sponsor it. Debate coordinator Sharon Mallory disagreed. \"We have candidates, we have questions being asked and answered. This is a debate,\" she said.]", "Date": "20150418", "Author": "[ Gregory Tejeda]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-gary-debate-st-0419-20150418-story.html", "Title": "[ Council candidates focus attention on bolstering Gary police, fire services ]"}