{"Content": "[  JOINT BASE SAN ANTONIO-FORT SAM HOUSTON, Tex.  Army Pfc. Bowe Bergdahl was fed up. He was five weeks into a deployment in southeastern Afghanistan and frustrated with his mission and his leaders. He and his fellow soldiers werent going after the Taliban as aggressively as he wanted, and his sense of disillusion added to the disgust for the Army that he had begun developing while still in basic training. Looking to make a stand, Bergdahl hatched a plan: He would run away from his platoons tiny outpost in Paktika province late on June 29, 2009. He would stay away from the Army a day, maybe two, and then reappear about19 miles away at a larger installation and demand to air his grievances with a general. He knew that the region was crawling with insurgents, but he had outsize impressions of his own capabilities, according to an investigating officer, and was determined to create enough chaos to get the attention of senior commanders. Those were among the details that emerged in a preliminary hearing here late last week. The soldier, carrying just a disguise, a knife and some provisions, was captured by insurgents by 10 a.m. the following morning, beginning four years and 11 months of captivity and torture by the Haqqani network, a group affiliated with the Taliban, according to Maj. Gen. Kenneth Dahl, the senior officer who carried out an investigation of Bergdahls actions and interviewed him at length.  [Bergdahls attorneys raised mental health issues]  The case against Bergdahl, who is charged with desertion and misbehaving before the enemy, is the most closely scrutinized desertion prosecution in the military in decades  perhaps since that of Pvt. Eddie Slovik, a soldier who became the only American executed for desertion since the Civil War. The officer overseeing the Bergdahl hearing, Lt. Col. Mark A. Visger, is expected to make a recommendation in the coming days to U.S. Army Forces Command, at Fort Bragg, N.C. about whether Bergdahl should be court-martialed. Bergdahl, now 29 and a sergeant, was recovered in May 2014 in a controversial swap in which the White House approved the release of five Taliban detainees from the military prison at Guantanamo Bay, Cuba. They are now in Qatar. Emotional testimony has underscored the relentless brutality that Bergdahl had to endure, as well as the chaos caused by his disappearance and the lingering resentment of some of his comrades.  The case has also raised questions about the Obama administrations handling of it, which included inviting Bergdahls parents to speak at the White House after the soldier was recovered, with national security adviser Susan E. Rice saying he served with honor and distinction.  The White House has since concluded that it badly misplayed the optics of Bergdahls release, according to administration officials. Bergdahls parents were in Washington the day he was recovered, and a quick decision was made to include them in a Rose Garden announcement, with little thought given to the ramifications of making Bergdahl appear to be a hero, the officials said. Bergdahl joined the Army a few years after washing out of initial training for the Coast Guard. The Washington Post reported previously that it was for psychological reasons, but Bergdahls lawyer and Dahl were more specific in the hearing: The future Taliban captive was diagnosed with depression and sent home after he was found in distress in a Coast Guard barracks, sitting on a floor with blood in his hands, possibly from a bloody nose, Dahl testified. He wasnt ready for it, Dahl said of life in the Coast Guard. He was overwhelmed, found himself in the hospital and was released. Bergdahl received a waiver to enlist in the Army. He was physically fit and well regarded for his work ethic, but quickly became disenchanted with his fellow soldiers and the Armys training program. Among his gripes: He couldnt believe higher-ranking soldiers wanted him to lock his wall locker to prevent theft and saw pre-deployment training at the National Training Center at Fort Irwin, Calif. as lame, Dahl said. Bergdahl was assigned to the 25th Infantry Divisions 1st Battalion, 501st Infantry Regiment, 4th Brigade Combat Team, of Fort Richardson, Alaska. There, he took offense to a motivational speech made by the senior enlisted soldier to the entire battalion. The command sergeant major said in jest that, like other soldiers, he liked to pillage and plunder, but Bergdahl took it literally, Dahl said.  In Afghanistan, there was another misunderstanding, Dahl said. Soldiers from Bergdahls unit werent all wearing their whole uniforms one day, a violation that upset then-Lt. Col. Clinton Baker, Bergdahls battalion commander.  Baker launched into a tirade to get his point across, kicking rocks in the process. Bergdahl was convinced that Baker had disturbed an Afghan grave, a suggestion that perplexed the others present, Dahl said. The general found that Bergdahls childhood living at the edge of the grid in Idaho in relative isolation hurt his ability to relate to other people. As a result, he was an extremely harsh judge of character and unrealistically idealistic, Dahl said. I think he absolutely believed that the things he perceived were absolutely true, he added.  [Bergdahls writing reveal a fragile young man]  Bergdahl could have gone to a number of people in his chain of command with concerns about his platoon. But he thought that they were in the Army for the money, or otherwise incapable of responding, Dahl said. In some ways, the soldier did consider others before running away from Observation Post Mest, Dahl said. He told Dahl that he picked the night he disappeared in part because he knew another platoon already would be on the way in the morning to relieve Bergdahls, thus providing additional manpower to deal with his vanishing. He didnt want to take his 5.56mm squad automatic machine gun with him alone outside the wire because he figured it would draw attention, but also decided against stealing a 9mm pistol because that would have gotten a fellow soldier in trouble, Dahl said. Bergdahls disappearance was noticed around dawn, when he was due to take a guard shift. Capt. John Billings, his former platoon leader, testified that he was in shock that one of his men could have vanished, and initially thought his soldiers were pulling a joke on him. Reality eventually set in, though, and he informed his company commander, then-Capt. Silvino Silvino. I felt sick to my stomach, said Silvino, now a major. I didnt know what was going to come after that. ... I instructed him to go look high and low, and everywhere he could. Coalition forces across eastern Afghanistan altered their operations that summer looking for Bergdahl, exposing soldiers to additional and dangerous missions. That remains a sensitive point, amid allegations from Bergdahls fellow soldiers that at least six U.S. troops died because of his actions. Dahl said he examined a variety of evidence, and found nothing that connected the deaths directly to Bergdahl. But the search-and-rescue operations undoubtedly altered security in the region, military officials said, and plunged the units involved into hastily planned missions. Baker, the former battalion commander, recalled that one platoon conducted 37 consecutive days of operations  long enough that new socks and T-shirts had to be delivered to the soldiers, since theirs were rotting on their bodies. Bergdahl, meanwhile, was already in Pakistan. He was relentlessly beaten in captivity with rubber hoses and copper cables. He repeatedly tried to escape, said Terrence Russell, an official with the Pentagons Joint Personnel Recovery Agency, who interviewed Bergdahl after his return.  Bergdahl was moved to at least six different locations, including one referred to as a Taliban prison. After escaping once for nearly nine days, Bergdahl was put in a 7-foot cage, blindfolded and left there for most of his last 3 years in captivity, Russell said. Bergdahl has been accused often of cooperating with the insurgents or even seeking them out, but Russell said there is no evidence to support those claims. The Haqqani network forced him to make videos that were released online. Russell grew visibly agitated while describing the conditions Bergdahl faced, wiping tears away at one point. While the sergeant has been accused of many things, Russell said, he was an organization of one, with no fellow prisoners who could keep his spirits up. He did the best job he could do, Russell said, And I respect him for it. Bergdahls attorney, Eugene Fidell, argued during closing arguments at the preliminary hearing that his client should not be court-martialed for either of the charges he now faces. There is probable cause, Fidell acknowledged, to charge him with a lesser offense, being absent without leave for one day, but the moment he was taken captive, Fidell said, that designation should have ended. The maximum penalty for being AWOL for one day is 30 days of confinement.  An Army prosecutor, Maj. Margaret Kurz, said that Bergdahls actions hurt the Army, his fellow soldiers and the mission in Afghanistan, and he must be punished. One does not just walk away into the Afghan wilderness, she said, and then return as though nothing happened.  Karen DeYoung contributed to this report. ],  JOINT BASE SAN ANTONIO-FORT SAM HOUSTON, Tex.  Army Pfc. Bowe Bergdahl was fed up. He was five weeks into a deployment in southeastern Afghanistan and frustrated with his mission and his leaders. He and his fellow soldiers werent going after the Taliban as aggressively as he wanted, and his sense of disillusion added to the disgust for the Army that he had begun developing while still in basic training. Looking to make a stand, Bergdahl hatched a plan: He would run away from his platoons tiny outpost in Paktika province late on June 29, 2009. He would stay away from the Army a day, maybe two, and then reappear about19 miles away at a larger installation and demand to air his grievances with a general. He knew that the region was crawling with insurgents, but he had outsize impressions of his own capabilities, according to an investigating officer, and was determined to create enough chaos to get the attention of senior commanders. Those were among the details that emerged in a preliminary hearing here late last week. The soldier, carrying just a disguise, a knife and some provisions, was captured by insurgents by 10 a.m. the following morning, beginning four years and 11 months of captivity and torture by the Haqqani network, a group affiliated with the Taliban, according to Maj. Gen. Kenneth Dahl, the senior officer who carried out an investigation of Bergdahls actions and interviewed him at length.  [Bergdahls attorneys raised mental health issues] , The case against Bergdahl, who is charged with desertion and misbehaving before the enemy, is the most closely scrutinized desertion prosecution in the military in decades  perhaps since that of Pvt. Eddie Slovik, a soldier who became the only American executed for desertion since the Civil War. The officer overseeing the Bergdahl hearing, Lt. Col. Mark A. Visger, is expected to make a recommendation in the coming days to U.S. Army Forces Command, at Fort Bragg, N.C. about whether Bergdahl should be court-martialed. Bergdahl, now 29 and a sergeant, was recovered in May 2014 in a controversial swap in which the White House approved the release of five Taliban detainees from the military prison at Guantanamo Bay, Cuba. They are now in Qatar. Emotional testimony has underscored the relentless brutality that Bergdahl had to endure, as well as the chaos caused by his disappearance and the lingering resentment of some of his comrades. The case has also raised questions about the Obama administrations handling of it, which included inviting Bergdahls parents to speak at the White House after the soldier was recovered, with national security adviser Susan E. Rice saying he served with honor and distinction. The White House has since concluded that it badly misplayed the optics of Bergdahls release, according to administration officials. Bergdahls parents were in Washington the day he was recovered, and a quick decision was made to include them in a Rose Garden announcement, with little thought given to the ramifications of making Bergdahl appear to be a hero, the officials said. Bergdahl joined the Army a few years after washing out of initial training for the Coast Guard. The Washington Post reported previously that it was for psychological reasons, but Bergdahls lawyer and Dahl were more specific in the hearing: The future Taliban captive was diagnosed with depression and sent home after he was found in distress in a Coast Guard barracks, sitting on a floor with blood in his hands, possibly from a bloody nose, Dahl testified. He wasnt ready for it, Dahl said of life in the Coast Guard. He was overwhelmed, found himself in the hospital and was released. Bergdahl received a waiver to enlist in the Army. He was physically fit and well regarded for his work ethic, but quickly became disenchanted with his fellow soldiers and the Armys training program. Among his gripes: He couldnt believe higher-ranking soldiers wanted him to lock his wall locker to prevent theft and saw pre-deployment training at the National Training Center at Fort Irwin, Calif. as lame, Dahl said. Bergdahl was assigned to the 25th Infantry Divisions 1st Battalion, 501st Infantry Regiment, 4th Brigade Combat Team, of Fort Richardson, Alaska. There, he took offense to a motivational speech made by the senior enlisted soldier to the entire battalion. The command sergeant major said in jest that, like other soldiers, he liked to pillage and plunder, but Bergdahl took it literally, Dahl said. In Afghanistan, there was another misunderstanding, Dahl said. Soldiers from Bergdahls unit werent all wearing their whole uniforms one day, a violation that upset then-Lt. Col. Clinton Baker, Bergdahls battalion commander. Baker launched into a tirade to get his point across, kicking rocks in the process. Bergdahl was convinced that Baker had disturbed an Afghan grave, a suggestion that perplexed the others present, Dahl said. The general found that Bergdahls childhood living at the edge of the grid in Idaho in relative isolation hurt his ability to relate to other people. As a result, he was an extremely harsh judge of character and unrealistically idealistic, Dahl said. I think he absolutely believed that the things he perceived were absolutely true, he added.  [Bergdahls writing reveal a fragile young man] , Bergdahl could have gone to a number of people in his chain of command with concerns about his platoon. But he thought that they were in the Army for the money, or otherwise incapable of responding, Dahl said. In some ways, the soldier did consider others before running away from Observation Post Mest, Dahl said. He told Dahl that he picked the night he disappeared in part because he knew another platoon already would be on the way in the morning to relieve Bergdahls, thus providing additional manpower to deal with his vanishing. He didnt want to take his 5.56mm squad automatic machine gun with him alone outside the wire because he figured it would draw attention, but also decided against stealing a 9mm pistol because that would have gotten a fellow soldier in trouble, Dahl said. Bergdahls disappearance was noticed around dawn, when he was due to take a guard shift. Capt. John Billings, his former platoon leader, testified that he was in shock that one of his men could have vanished, and initially thought his soldiers were pulling a joke on him. Reality eventually set in, though, and he informed his company commander, then-Capt. Silvino Silvino. I felt sick to my stomach, said Silvino, now a major. I didnt know what was going to come after that. ... I instructed him to go look high and low, and everywhere he could. Coalition forces across eastern Afghanistan altered their operations that summer looking for Bergdahl, exposing soldiers to additional and dangerous missions. That remains a sensitive point, amid allegations from Bergdahls fellow soldiers that at least six U.S. troops died because of his actions. Dahl said he examined a variety of evidence, and found nothing that connected the deaths directly to Bergdahl. But the search-and-rescue operations undoubtedly altered security in the region, military officials said, and plunged the units involved into hastily planned missions. Baker, the former battalion commander, recalled that one platoon conducted 37 consecutive days of operations  long enough that new socks and T-shirts had to be delivered to the soldiers, since theirs were rotting on their bodies. Bergdahl, meanwhile, was already in Pakistan. He was relentlessly beaten in captivity with rubber hoses and copper cables. He repeatedly tried to escape, said Terrence Russell, an official with the Pentagons Joint Personnel Recovery Agency, who interviewed Bergdahl after his return. Bergdahl was moved to at least six different locations, including one referred to as a Taliban prison. After escaping once for nearly nine days, Bergdahl was put in a 7-foot cage, blindfolded and left there for most of his last 3 years in captivity, Russell said. Bergdahl has been accused often of cooperating with the insurgents or even seeking them out, but Russell said there is no evidence to support those claims. The Haqqani network forced him to make videos that were released online. Russell grew visibly agitated while describing the conditions Bergdahl faced, wiping tears away at one point. While the sergeant has been accused of many things, Russell said, he was an organization of one, with no fellow prisoners who could keep his spirits up. He did the best job he could do, Russell said, And I respect him for it. Bergdahls attorney, Eugene Fidell, argued during closing arguments at the preliminary hearing that his client should not be court-martialed for either of the charges he now faces. There is probable cause, Fidell acknowledged, to charge him with a lesser offense, being absent without leave for one day, but the moment he was taken captive, Fidell said, that designation should have ended. The maximum penalty for being AWOL for one day is 30 days of confinement. An Army prosecutor, Maj. Margaret Kurz, said that Bergdahls actions hurt the Army, his fellow soldiers and the mission in Afghanistan, and he must be punished. One does not just walk away into the Afghan wilderness, she said, and then return as though nothing happened.  , Karen DeYoung contributed to this report.]", "Date": "20150920", "Title": "[Disillusioned and self-deluded, Bowe Bergdahl vanished into a brutal captivity]", "Link": "https://www.washingtonpost.com/world/national-security/disillusioned-and-self-deluded-bowe-bergdahl-vanished-into-a-brutal-captivity/2015/09/20/b15a8a8c-5f9b-11e5-b38e-06883aacba64_story.html", "Author": "[Dan Lamothe]"}
{"Content": "[ The pregnant Latina women who come for checkups and guidance at Marys Center in Northwest Washington say that they understand that their babies will become anchors in their lives  but not the kind of anchors that Republican presidential candidate Donald Trump disparages on the campaign trail. The newborns  who will be U.S. citizens even if their parents are in this country illegally  are a mixed blessing for their mothers: another mouth to feed, another obstacle to finding or keeping a precious low-wage job, another complication in an already complex life that, in many cases, includes providing for older children left behind in Central America. I didnt come here to have a baby. I came to have a better future and help my daughter back in my country, said Nellis Najera, 27, a kitchen worker who was attending a breast-feeding class. Babies come because it is part of life. But it makes your life harder, because you have to choose between the baby and work. The number of children born to immigrants who are in this country illegally has declined steadily in recent years, according to data from the Pew Research Center, as the undocumented population here has leveled off. After peaking at 360,000 in 2007, such births fell to 295,000 in 2013, the center said. At the same time, an Obama administration proposal to allow the parents of U.S.-born children to avoid deportation has provided new ammunition for critics like Trump, who say babies born to people here illegally should be denied citizenship and, along with their parents, forced to leave this country.   Two expectant mothers 18-year-old Tatiana Maravilla, left, and 35-year-old Maria Argueta, right, select homemade quilts for their babies. At center is Arguetas friend, Glenda Lopez. (Sarah L. Voisin/The Washington Post)  The issue has inflamed the 2016 presidential primary contest, with Trumps provocative rhetoric pushing him to the top of GOP polls even as his rivals try to sidestep the topic for fear of alienating Hispanic voters. A woman gets pregnant. Shes nine months, she walks across the border, she has the baby in the United States, and we take care of the baby for 85 years, Trump said at the GOP candidates debate Wednesday, shaking his head in apparent disgust. I dont think so. Last week, he told a cheering Dallas crowd that the United States has become a dumping ground for violent gang members and anchor babies.  [Trumps rhetoric driving immigration debate]  Although U.S. hospitals near the Mexican border have reported that they regularly deliver babies whose mothers live in Mexico, experts at several research organizations in the district said that the vast majority of undocumented immigrants who have babies here have lived in the United States for at least several years. They also said most of the women came here to work and escape lives of poverty and violence, not to raise a family. The true anchor baby problem, these experts said, is not that undocumented immigrants are giving birth in the United States in order to increase their chances of staying and accessing social programs. It is that starting a family here inevitably changes the parents long-term goals.  Over time, the arrival of children weakens family ties to the homeland and cements the parents bonds with the United States. And once their children have learned English and become used to life here, many immigrant parents said that they could not imagine bringing them back to the dirt-poor, gang-plagued countries that the parents fled.    Ezequiel Umanzor, 1, claps on his fathers lap as his parents listen to information. His mother, Erenia Umanzor, 21, right, is having her second child. She came from El Salvador two years ago. His father, Freddy Majano, 19, is also from El Salvador. (Sarah L. Voisin/The Washington Post)  This is not birth tourism, said Mark Krikorian, executive director of the Center for Immigration Studies in the District. Its not so much about inducement or enticement, but about people coming here to work, meeting someone, then the birds and the bees happen, and they have kids. And once you have kids, he said, it becomes less likely that you will leave on your own or get deported. Nobody gives me anything In the Mary Centers waiting room one day last week, Maria Canas, 35, struggled to quiet her shrieking 2-year-old son and corral her feisty 5-year-old daughter. Canas came to the United States from El Salvador in her 20s, illegal and illiterate, leaving behind a young daughter. She cleaned hotel rooms and offices, cooked burgers and fries, and sent as much money home as she could. Meanwhile, she met and married a Salvadoran construction worker. They had two children, who, as U.S. citizens, qualified for an array of public benefits and services. But juggling work shifts and child care has sapped Canass strength and strained the familys budget. If they say we come here to have children and take peoples jobs, its not true, said Canas, who never attended school. Nobody gives me anything. I have done any work I could find. I want my children to have what I couldnt. Whats wrong with that? Trump and other immigration hard-liners argue that children born to undocumented immigrants should not be rewarded with access to public schools and othertaxpayer-funded benefits, including Medicaid and social service programs for those whose incomes are low enough to qualify. Its like saying a complete stranger walks into your living room, gives birth in your house, then suddenly the child is a member of your family, and you are obligated to provide all sorts of things for that child, said Ira Mehlman, head of the conservative Federation for American Immigration Reform. Trump has proposed deporting all 11 million people who are in this country illegally  an idea most of his rivals dismiss as impossible and inappropriate. He questions whether the 14th Amendment guarantees U.S. citizenship to the children of undocumented immigrants and says that such birthright citizenship should be prohibited by law. Those who advocate for immigrants and their children counter that the right to citizenship is enshrined in the Constitution and is a core American value. They also argue that illegal immigrants contribute to the U.S. economy and social safety net more than many Americans realize. Undocumented workers sustain numerous industries, such as meatpacking and farming, often doing dirty and dangerous jobs that American-born workers shun, advocates and researchers say. They pay sales taxes, many pay income taxes and a significant number pay into Social Security  even though they, unlike their U.S.-born children, stand little chance of receiving retirement payments.  National surveys of undocumented Hispanic immigrants echo the stories told by the Latina mothers at Marys Center, almost all of whom are from Central America. Most do not become pregnant until they have been here for several years and have formed new romantic or marital relationships  often without anticipating the burdens that a new child will bring.  [Reunited, family struggles to adjust to U.S. life]  A majority of the women interviewed at the center, both legal and undocumented, were receiving services through the federal Special Supplemental Nutrition Program for Women, Infants and Children. Their older children were attending public schools. But the women said that having a U.S.-born child had not entitled them to any individual benefits  and that they had not expected that it would. Even if our children are born here, we still have no documents, said Laura Flamenco, a 33-year-old Salvadoran woman who got married after four years in the United States and was about to have her first baby. I came here to support my parents back home, but I had to stop work because of the baby. Now I have less to send them, even though they still need it, Flamenco said. The people who judge us have no human feeling. We do all the hard and heavy work. We need them, and they need us.    A fraction of U.S. births Birth tourism does exist, in small numbers, at both ends of the economic scale, immigration experts say. There is a thriving cottage industry that helps affluent, pregnant foreigners fly to the United States on visitors visas, stay at hotels until they deliver, and return home with a newborn U.S. citizen. And among the thousands of people who come to the United States on multi-year work or student visas, some become parents during their stays. In communities north of the Mexican border and cities, such as Los Angeles, with large Latino populations, hospitals often deliver babies for Mexican mothers, although some of those mothers are commuters who work on the American side of the border or have roots in both countries. But all those births make up a fraction of the babies born to illegal immigrants in the United States each year. And experts say there is little evidence that significant numbers of Latinas are deliberately crossing the border to give birth. According to Mark Lopez, the director of Hispanic research at Pew, the typical immigrant living illegally in the United States today has lived here for at least 10 years. For those with U.S.-born children, it is at least 15 years. Some U.S. citizens born to undocumented Hispanic mothers since the 1980s are now having children of their own. One was Jessica Melendez, a D.C. resident whose parents fled El Salvador years ago. Born in Texas, Melendez met her husband, an undocumented Salvadoran, in 2004; three years later, their daughter Viviana was born. But things went wrong during the delivery. The babys oxygen supply was cut off, and she suffered severe brain damage and physical disabilities. She has received extraordinary medical care ever since, including a nurse who accompanies her to school, much of it paid through the federal Supplemental Social Security program. If she had been born in El Salvador, she would be dead, said Melvin Melendez, 33, who works as a restaurant cook and now has temporary legal amnesty. Regardless of the familys legal status, Melendez said, the couple has earned the benefits that help keep their daughter alive. For nine years, my wife took the bus every morning at 4 to work at McDonalds, and as soon as she came home at night, I went to work. We lived in shifts and never took a vacation, Melendez said. We didnt plan for this to happen to our daughter. But thank God it happened here. ], The pregnant Latina women who come for checkups and guidance at Marys Center in Northwest Washington say that they understand that their babies will become anchors in their lives  but not the kind of anchors that Republican presidential candidate Donald Trump disparages on the campaign trail. The newborns  who will be U.S. citizens even if their parents are in this country illegally  are a mixed blessing for their mothers: another mouth to feed, another obstacle to finding or keeping a precious low-wage job, another complication in an already complex life that, in many cases, includes providing for older children left behind in Central America. I didnt come here to have a baby. I came to have a better future and help my daughter back in my country, said Nellis Najera, 27, a kitchen worker who was attending a breast-feeding class. Babies come because it is part of life. But it makes your life harder, because you have to choose between the baby and work. The number of children born to immigrants who are in this country illegally has declined steadily in recent years, according to data from the Pew Research Center, as the undocumented population here has leveled off. After peaking at 360,000 in 2007, such births fell to 295,000 in 2013, the center said. At the same time, an Obama administration proposal to allow the parents of U.S.-born children to avoid deportation has provided new ammunition for critics like Trump, who say babies born to people here illegally should be denied citizenship and, along with their parents, forced to leave this country. The issue has inflamed the 2016 presidential primary contest, with Trumps provocative rhetoric pushing him to the top of GOP polls even as his rivals try to sidestep the topic for fear of alienating Hispanic voters. A woman gets pregnant. Shes nine months, she walks across the border, she has the baby in the United States, and we take care of the baby for 85 years, Trump said at the GOP candidates debate Wednesday, shaking his head in apparent disgust. I dont think so. Last week, he told a cheering Dallas crowd that the United States has become a dumping ground for violent gang members and anchor babies.  [Trumps rhetoric driving immigration debate] , Although U.S. hospitals near the Mexican border have reported that they regularly deliver babies whose mothers live in Mexico, experts at several research organizations in the district said that the vast majority of undocumented immigrants who have babies here have lived in the United States for at least several years. They also said most of the women came here to work and escape lives of poverty and violence, not to raise a family. The true anchor baby problem, these experts said, is not that undocumented immigrants are giving birth in the United States in order to increase their chances of staying and accessing social programs. It is that starting a family here inevitably changes the parents long-term goals. Over time, the arrival of children weakens family ties to the homeland and cements the parents bonds with the United States. And once their children have learned English and become used to life here, many immigrant parents said that they could not imagine bringing them back to the dirt-poor, gang-plagued countries that the parents fled. This is not birth tourism, said Mark Krikorian, executive director of the Center for Immigration Studies in the District. Its not so much about inducement or enticement, but about people coming here to work, meeting someone, then the birds and the bees happen, and they have kids. And once you have kids, he said, it becomes less likely that you will leave on your own or get deported. In the Mary Centers waiting room one day last week, Maria Canas, 35, struggled to quiet her shrieking 2-year-old son and corral her feisty 5-year-old daughter. Canas came to the United States from El Salvador in her 20s, illegal and illiterate, leaving behind a young daughter. She cleaned hotel rooms and offices, cooked burgers and fries, and sent as much money home as she could. Meanwhile, she met and married a Salvadoran construction worker. They had two children, who, as U.S. citizens, qualified for an array of public benefits and services. But juggling work shifts and child care has sapped Canass strength and strained the familys budget. If they say we come here to have children and take peoples jobs, its not true, said Canas, who never attended school. Nobody gives me anything. I have done any work I could find. I want my children to have what I couldnt. Whats wrong with that?, Trump and other immigration hard-liners argue that children born to undocumented immigrants should not be rewarded with access to public schools and othertaxpayer-funded benefits, including Medicaid and social service programs for those whose incomes are low enough to qualify. Its like saying a complete stranger walks into your living room, gives birth in your house, then suddenly the child is a member of your family, and you are obligated to provide all sorts of things for that child, said Ira Mehlman, head of the conservative Federation for American Immigration Reform. Trump has proposed deporting all 11 million people who are in this country illegally  an idea most of his rivals dismiss as impossible and inappropriate. He questions whether the 14th Amendment guarantees U.S. citizenship to the children of undocumented immigrants and says that such birthright citizenship should be prohibited by law. Those who advocate for immigrants and their children counter that the right to citizenship is enshrined in the Constitution and is a core American value. They also argue that illegal immigrants contribute to the U.S. economy and social safety net more than many Americans realize. Undocumented workers sustain numerous industries, such as meatpacking and farming, often doing dirty and dangerous jobs that American-born workers shun, advocates and researchers say. They pay sales taxes, many pay income taxes and a significant number pay into Social Security  even though they, unlike their U.S.-born children, stand little chance of receiving retirement payments.  National surveys of undocumented Hispanic immigrants echo the stories told by the Latina mothers at Marys Center, almost all of whom are from Central America. Most do not become pregnant until they have been here for several years and have formed new romantic or marital relationships  often without anticipating the burdens that a new child will bring.  [Reunited, family struggles to adjust to U.S. life] , A majority of the women interviewed at the center, both legal and undocumented, were receiving services through the federal Special Supplemental Nutrition Program for Women, Infants and Children. Their older children were attending public schools. But the women said that having a U.S.-born child had not entitled them to any individual benefits  and that they had not expected that it would. Even if our children are born here, we still have no documents, said Laura Flamenco, a 33-year-old Salvadoran woman who got married after four years in the United States and was about to have her first baby. I came here to support my parents back home, but I had to stop work because of the baby. Now I have less to send them, even though they still need it, Flamenco said. The people who judge us have no human feeling. We do all the hard and heavy work. We need them, and they need us.    A fraction of U.S. births Birth tourism does exist, in small numbers, at both ends of the economic scale, immigration experts say. There is a thriving cottage industry that helps affluent, pregnant foreigners fly to the United States on visitors visas, stay at hotels until they deliver, and return home with a newborn U.S. citizen. And among the thousands of people who come to the United States on multi-year work or student visas, some become parents during their stays. In communities north of the Mexican border and cities, such as Los Angeles, with large Latino populations, hospitals often deliver babies for Mexican mothers, although some of those mothers are commuters who work on the American side of the border or have roots in both countries. But all those births make up a fraction of the babies born to illegal immigrants in the United States each year. And experts say there is little evidence that significant numbers of Latinas are deliberately crossing the border to give birth. According to Mark Lopez, the director of Hispanic research at Pew, the typical immigrant living illegally in the United States today has lived here for at least 10 years. For those with U.S.-born children, it is at least 15 years. Some U.S. citizens born to undocumented Hispanic mothers since the 1980s are now having children of their own. One was Jessica Melendez, a D.C. resident whose parents fled El Salvador years ago. Born in Texas, Melendez met her husband, an undocumented Salvadoran, in 2004; three years later, their daughter Viviana was born. But things went wrong during the delivery. The babys oxygen supply was cut off, and she suffered severe brain damage and physical disabilities. She has received extraordinary medical care ever since, including a nurse who accompanies her to school, much of it paid through the federal Supplemental Social Security program. If she had been born in El Salvador, she would be dead, said Melvin Melendez, 33, who works as a restaurant cook and now has temporary legal amnesty. Regardless of the familys legal status, Melendez said, the couple has earned the benefits that help keep their daughter alive. For nine years, my wife took the bus every morning at 4 to work at McDonalds, and as soon as she came home at night, I went to work. We lived in shifts and never took a vacation, Melendez said. We didnt plan for this to happen to our daughter. But thank God it happened here.]", "Date": "20150920", "Title": "[For illegal immigrants with babies, the anchor pulls in many directions]", "Link": "https://www.washingtonpost.com/local/social-issues/for-illegal-immigrants-with-babies-the-anchor-pulls-in-many-directions/2015/09/20/d5d7a2f0-570d-11e5-b8c9-944725fcd3b9_story.html\n", "Author": "[Pamela Constable]"}
{"Content": "[  KASSEL, Germany  Somali asylum seeker Ismail Mohamed Hassan, 22, awoke one nippy morning to an early knock at his refugee center door. It was the state police bearing two unpleasant gifts  a one-way ticket out of Germany and a car ride to Frankfurt Airport. This was it, he recalls thinking. Deportation. Unless he could find a way to stop it. Germany is ground zero in Europes migrant crisis, a nation set to receive up to 1 million asylum seekers this year, far more than any other country in the region. Yet, like Hassan, after risking their lives by land and sea to reach the continents economic powerhouse, about one in every two asylum seekers is initially rejected. It has made asylum a numbers game. In Germany, 86percent of Syrians are being granted some form of refugee status, as are 82percent of Iraqis and 80percent of Eritreans. Only 30 percent of Afghans are making the cut. For those coming from Kosovo and Albania, the acceptance rate stands at almost zero.  [A global surge in refugees leaves Europe struggling to cope]  But if Hassans story suggests the trials set to face hundreds of thousands of rejected asylum seekers  two stressful years spent in a bureaucratic nightmare trying to stay  it also offers them a ray of hope. While vast numbers of migrants like him are being rejected, far fewer are actually being deported.     The road to asylum View Graphic     The road to asylum  Saying its generous system has become an incentive for more and more migrants to rush into Europe or die trying, Germany is preparing a new crackdown on those it says should leave. That has thrust this nation of 81million to the center of the debate over perhaps the biggest question of the crisis: Of the hundreds of thousands of migrants coming, who gets to stay? Even in the United States, deportation cases of undocumented migrants can linger for years. But because the migrants coming to Europe in dramatic waves are largely applying for legal asylum, they are benefiting from a catalogue of appeals and pseudo-statuses including a precarious right to remain that is simply called toleration. If they can stall long enough, German codes potentially allow them to beat the system and win permanent residency. And even when deportation orders come through, there are ingenious ways around them. Hassan was one of the unlucky ones. A lithe construction worker with scars on his body he says came from a 2011 al-Shabab bomb blast in Mogadishu, he is one of the untold thousands being rejected without even a review of his case. Thats because, like most of the hopeful refugees arriving here, he first entered Europe in a different country. In his case, it was Bulgaria, a no mans land for migrants where he was slapped in jail. Under E.U. law, Germany does not have to listen to his claim. It can just send him back. It tried to do just that on the cold December morning last year when police hauled him to Frankfurt Airport.  But once aboard a flight, Hassan managed to block his deportation. German policies restrict the use of force during expulsions, and some deportees have taken to kicking and screaming inside plane cabins to thwart take-off. Hassan said he merely informed the crew that he was leaving involuntarily. The result: Citing a possible safety risk, the pilot allowed him to disembark. With no grounds to detain Hassan further under German law, frustrated authorities released him. Back in Kassel, his lawyer found him a shield against another deportation attempt: Church asylum. Hassan packed up and moved into a welcoming Catholic church. There are no laws offering legal sanctuary in churches. But such protection is a German tradition dating to the Middle Ages, and officials here have been loath to challenge it. For Hassan, it might be a solid plan. If he can avoid deportation for four more months, a loophole in the asylum law would compel the German government to hear the merits of his case. Because the Germans  citing logistical and safety issues  are generally not deporting Somalis to their home country, he has a good chance of being allowed to stay. I cannot go back to Somalia, Hassan said inside the tranquil rectory of St. Familia Catholic Church, a sanctuary he rarely leaves for fear of being arrested. It is too dangerous there. I wont go back.          1 of 69       Full Screen Autoplay  Close                                                                                                                                                                 Skip Ad              Migrants desperate quest to cross into Europe      View Photos   More than 332,000 people have reached the continent this year.    Caption   More than 332,000 people have reached the continent this year.  Sept. 20, 2015 Migrants desperately try to board a train heading for Zagreb from Tovarnik station in Tovarnik,Croatia. Croatia continues to send buses and trains north to its border with Hungary. Jeff J. Mitchell/Getty Images  Buy Photo          Wait 1 second to continue.   .wp-volt-gal-preroll-video{width:100%;height:100%}      (function(){var a=window.pbSsiSingle||{};a.onReady=a.onReady||function(){TWPHead.test(!!window.jQuery,\"\",\"//js.washingtonpost.com/pb/resources/js/jquery.1.8.2.js\",function(){a.serverUri=\"//www.washingtonpost.com\";a.contextPath=\"/pb\";var b=[];$(\".pb-feature-ssi-single\").each(function(a,c){var d=$(c).attr(\"data-pb-feature-config\");\"string\"==typeof d&&-1==$.inArray(d,b)&&b.push(d)});a.externals=a.externals||[];b.forEach(function(b){a.externals.push(\"//js.washingtonpost.com/pb/gr/f/ssiSingle/\"+b+\"/render.js?\\\\x26_\\\\x3d1709181625\")});window.EventController||a.externals.unshift(\"//js.washingtonpost.com/pb/resources/js/event-controller.v2.js\");TWPHead.load(a.externals)})};if(!a.loadInitialized){if(window.TWPHead)TWPHead.ready(document,a.onReady);else{window.head_conf={head:\"TWPHead\"};var c=document.getElementsByTagName(\"head\")[0],b=document.createElement(\"script\");b.src=\"//js.washingtonpost.com/pb/resources/js/head.min.js\";c.appendChild(b);var e=function(){window.TWPHead?TWPHead.ready(document,a.onReady):setTimeout(e,200)};e()}a.loadInitialized=!0}c=[\"//js.washingtonpost.com/pb/gr/c/ssiSingle/rO609L1qgAmx7p/js/ab0be8c68d.js?_\\\\x3d49be8\",\"https://js.washingtonpost.com/rw/sites/twpweb/js/plugin/plugin.jquery.wp-preroll.min.js\",\"https://jwpsrv.com/library/l33YMDXrEeKu+iIACp8kUw.js\"];a.externals=a.externals||[];for(b=0;b<c.length-1;b++)-1==a.externals.indexOf(c[b])&&a.externals.push(c[b])})();  New laws being considered In the German city of Osnabrck, local activists have started blocking deportations by forming human chains outside the houses of refugees. In a decentralized system that gives states the power to rule on deportations, the national government is also grappling with liberal German governors who at times have effectively declared moratoriums on deportations. Yet as the tolerant Germans become overwhelmed by the sheer number of arriving migrants  and as concern grows that their accepting system may be serving as a magnet  the government is starting to roll up the welcome mat.   [E.U. nations impose new restrictions on migrants]  A new draft law to be debated in the German Parliament would, for instance, take aim at the majority of migrants who, like Hassan, are traveling to Germany through transit countries such as Hungary, Bulgaria and Croatia. Part of the plan is to disincentivize staying. Rather than offering cash benefits and housing to those being ordered to leave  Hassan, for instance, received aid for 24 months as he fought deportation  such migrants would instead simply receive some food and a one-way ticket out. Germany last year managed to return only 4,700 of the 35,000 migrants who were told to go back to those nations  in part because deportations are difficult. Commercial and charter flights can be expensive. Also, many of the migrants coming now dont have passports or travel papers, making expulsion a bureaucratic and logistical mess. Elections are not won by dragging families out of bed at 6oclock in the morning, said Kay Hailbronner of the research center on immigration and asylum law at the University of Konstanz. The new law, however, would not close the important loophole being used here by Hassan and others to avoid deportation to transit countries. If an asylum seeker can manage to fend off deportation for six to 18 months, the German government has no choice but to reopen their case. Inside the hallowed halls of Trinity Lutheran Church in southwest Berlin, the makeshift beds and sounds of Farsi and Amharic in the recreation hall hint at one of the most divisive tools being used to thwart deportations in Germany. Across the nation, 297 churches are currently granting asylum to 452 people facing immediate deportation. Many churches  like St.Familia in Kassel where Hassan has lived in the rectory for the past eight months  are offering shelter to the mostly Muslim asylum seekers without spiritual strings attached. Others, like Trinity, are largely aiding only those who are or wish to become Christian. In recent years, the Rev. Gottfried Martens claims to have succeeded in converting hundreds of Muslim migrants. Either way, churches are offering a golden opportunity to those attempting to crack the code of Europes asylum system. Nariman, a 25-year-old Iranian who has pitched a tent in Trinity Lutherans back yard and asked that his last name be withheld, said he tried for three years to win asylum in Norway based on his assertions that he was being harassed by Iranian secret police for being an ethnic Kurdish activist. Rejected and facing deportation to Iran, he scrambled to Germany three months ago. But then German authorities wanted to deport him to Norway. So he asked for sanctuary at Trinity. Born Muslim, he said he was an atheist when he arrived in Germany this summer. But a friend in his refugee center, he said, convinced him that Jesus is our savior. Becoming a convert may aid his claim of persecution in Iran. And if he can delay expulsion by several more months, Nariman can use the same legal loophole as Hassan. The German government will be compelled to reexamine his case if it cant manage to deport him to Norway. If they send me back to Iran, I will be killed, said the young man with intense eyes. I have to stay here, and I think the Germans will let me. They are not as racist as the Norwegians. Somalia has problems, too At St. Familia in Kassel, the city where the Brothers Grimm crafted some of their most famous fables, Hassan and another Somali man fighting deportation  Said Musa Mudhallib  spend most of their days in the library of the rectory. Fearing arrest, they rarely leave the church grounds, and they take turns in the kitchen cooking fresh injera flatbread and Somali stews. Neither man begrudges Syrians for having such a high initial acceptance rate. But Europe needs to understand that Somalia has problems, too, Muhdallib said. Germany has already sent back thousands of rejected asylum claimants from Balkan countries. But for many rejected asylum seekers, a final ruling can, or often does, take years. If they can stretch out their cases for up to six years, a law here allows many to apply for permanent status  suggesting that Germany may be forced to absorb the majority of those seeking asylum. The new law would also target economic migrants and so-called benefit tourists. Those denied asylum would find it harder to obtain lesser protections that grant them a temporary right to remain. Strong attempts would also be made to identify opportunists  such as a host of North Africans now pretending to be Syrians. Those rejected asylum seekers who fail to voluntarily leave the country could also be subject to forced removal without advance notice. Deportation is always difficult, but maybe you have to remove 100,000 to help the other 600,000 find a way to stay, said Demetrios G. Papademetriou, president emeritus of the Migration Policy Institute, a Washington think tank. Europe needs to develop a backbone, to say that on principle, if you are an unauthorized immigrant, an economic migrant, we are going to identify you and send you back.  Stephanie Kirchner contributed to this report.  Read more:   The Arab worlds wealthiest nations are doing next to nothing for Syrias refugees   As tragedies shock Europe, a bigger refugee crisis looms in the Middle East   Read The Posts coverage on the global surge in migration   Todays coverage from Post correspondents around the world  ],  KASSEL, Germany  Somali asylum seeker Ismail Mohamed Hassan, 22, awoke one nippy morning to an early knock at his refugee center door. It was the state police bearing two unpleasant gifts  a one-way ticket out of Germany and a car ride to Frankfurt Airport. This was it, he recalls thinking. Deportation. Unless he could find a way to stop it. Germany is ground zero in Europes migrant crisis, a nation set to receive up to 1 million asylum seekers this year, far more than any other country in the region. Yet, like Hassan, after risking their lives by land and sea to reach the continents economic powerhouse, about one in every two asylum seekers is initially rejected. It has made asylum a numbers game. In Germany, 86percent of Syrians are being granted some form of refugee status, as are 82percent of Iraqis and 80percent of Eritreans. Only 30 percent of Afghans are making the cut. For those coming from Kosovo and Albania, the acceptance rate stands at almost zero.  [A global surge in refugees leaves Europe struggling to cope] , But if Hassans story suggests the trials set to face hundreds of thousands of rejected asylum seekers  two stressful years spent in a bureaucratic nightmare trying to stay  it also offers them a ray of hope. While vast numbers of migrants like him are being rejected, far fewer are actually being deported. Saying its generous system has become an incentive for more and more migrants to rush into Europe or die trying, Germany is preparing a new crackdown on those it says should leave. That has thrust this nation of 81million to the center of the debate over perhaps the biggest question of the crisis: Of the hundreds of thousands of migrants coming, who gets to stay?, Even in the United States, deportation cases of undocumented migrants can linger for years. But because the migrants coming to Europe in dramatic waves are largely applying for legal asylum, they are benefiting from a catalogue of appeals and pseudo-statuses including a precarious right to remain that is simply called toleration. If they can stall long enough, German codes potentially allow them to beat the system and win permanent residency. And even when deportation orders come through, there are ingenious ways around them. Hassan was one of the unlucky ones. A lithe construction worker with scars on his body he says came from a 2011 al-Shabab bomb blast in Mogadishu, he is one of the untold thousands being rejected without even a review of his case. Thats because, like most of the hopeful refugees arriving here, he first entered Europe in a different country. In his case, it was Bulgaria, a no mans land for migrants where he was slapped in jail. Under E.U. law, Germany does not have to listen to his claim. It can just send him back. It tried to do just that on the cold December morning last year when police hauled him to Frankfurt Airport. But once aboard a flight, Hassan managed to block his deportation. German policies restrict the use of force during expulsions, and some deportees have taken to kicking and screaming inside plane cabins to thwart take-off. Hassan said he merely informed the crew that he was leaving involuntarily. The result: Citing a possible safety risk, the pilot allowed him to disembark. With no grounds to detain Hassan further under German law, frustrated authorities released him. Back in Kassel, his lawyer found him a shield against another deportation attempt: Church asylum. Hassan packed up and moved into a welcoming Catholic church. There are no laws offering legal sanctuary in churches. But such protection is a German tradition dating to the Middle Ages, and officials here have been loath to challenge it. For Hassan, it might be a solid plan. If he can avoid deportation for four more months, a loophole in the asylum law would compel the German government to hear the merits of his case. Because the Germans  citing logistical and safety issues  are generally not deporting Somalis to their home country, he has a good chance of being allowed to stay. I cannot go back to Somalia, Hassan said inside the tranquil rectory of St. Familia Catholic Church, a sanctuary he rarely leaves for fear of being arrested. It is too dangerous there. I wont go back. In the German city of Osnabrck, local activists have started blocking deportations by forming human chains outside the houses of refugees. In a decentralized system that gives states the power to rule on deportations, the national government is also grappling with liberal German governors who at times have effectively declared moratoriums on deportations. Yet as the tolerant Germans become overwhelmed by the sheer number of arriving migrants  and as concern grows that their accepting system may be serving as a magnet  the government is starting to roll up the welcome mat.   [E.U. nations impose new restrictions on migrants] , A new draft law to be debated in the German Parliament would, for instance, take aim at the majority of migrants who, like Hassan, are traveling to Germany through transit countries such as Hungary, Bulgaria and Croatia. Part of the plan is to disincentivize staying. Rather than offering cash benefits and housing to those being ordered to leave  Hassan, for instance, received aid for 24 months as he fought deportation  such migrants would instead simply receive some food and a one-way ticket out. Germany last year managed to return only 4,700 of the 35,000 migrants who were told to go back to those nations  in part because deportations are difficult. Commercial and charter flights can be expensive. Also, many of the migrants coming now dont have passports or travel papers, making expulsion a bureaucratic and logistical mess. Elections are not won by dragging families out of bed at 6oclock in the morning, said Kay Hailbronner of the research center on immigration and asylum law at the University of Konstanz. The new law, however, would not close the important loophole being used here by Hassan and others to avoid deportation to transit countries. If an asylum seeker can manage to fend off deportation for six to 18 months, the German government has no choice but to reopen their case. Inside the hallowed halls of Trinity Lutheran Church in southwest Berlin, the makeshift beds and sounds of Farsi and Amharic in the recreation hall hint at one of the most divisive tools being used to thwart deportations in Germany. Across the nation, 297 churches are currently granting asylum to 452 people facing immediate deportation. Many churches  like St.Familia in Kassel where Hassan has lived in the rectory for the past eight months  are offering shelter to the mostly Muslim asylum seekers without spiritual strings attached. Others, like Trinity, are largely aiding only those who are or wish to become Christian. In recent years, the Rev. Gottfried Martens claims to have succeeded in converting hundreds of Muslim migrants. Either way, churches are offering a golden opportunity to those attempting to crack the code of Europes asylum system. Nariman, a 25-year-old Iranian who has pitched a tent in Trinity Lutherans back yard and asked that his last name be withheld, said he tried for three years to win asylum in Norway based on his assertions that he was being harassed by Iranian secret police for being an ethnic Kurdish activist. Rejected and facing deportation to Iran, he scrambled to Germany three months ago. But then German authorities wanted to deport him to Norway. So he asked for sanctuary at Trinity. Born Muslim, he said he was an atheist when he arrived in Germany this summer. But a friend in his refugee center, he said, convinced him that Jesus is our savior. Becoming a convert may aid his claim of persecution in Iran. And if he can delay expulsion by several more months, Nariman can use the same legal loophole as Hassan. The German government will be compelled to reexamine his case if it cant manage to deport him to Norway. If they send me back to Iran, I will be killed, said the young man with intense eyes. I have to stay here, and I think the Germans will let me. They are not as racist as the Norwegians. At St. Familia in Kassel, the city where the Brothers Grimm crafted some of their most famous fables, Hassan and another Somali man fighting deportation  Said Musa Mudhallib  spend most of their days in the library of the rectory. Fearing arrest, they rarely leave the church grounds, and they take turns in the kitchen cooking fresh injera flatbread and Somali stews. Neither man begrudges Syrians for having such a high initial acceptance rate. But Europe needs to understand that Somalia has problems, too, Muhdallib said. Germany has already sent back thousands of rejected asylum claimants from Balkan countries. But for many rejected asylum seekers, a final ruling can, or often does, take years. If they can stretch out their cases for up to six years, a law here allows many to apply for permanent status  suggesting that Germany may be forced to absorb the majority of those seeking asylum. The new law would also target economic migrants and so-called benefit tourists. Those denied asylum would find it harder to obtain lesser protections that grant them a temporary right to remain. Strong attempts would also be made to identify opportunists  such as a host of North Africans now pretending to be Syrians. Those rejected asylum seekers who fail to voluntarily leave the country could also be subject to forced removal without advance notice. Deportation is always difficult, but maybe you have to remove 100,000 to help the other 600,000 find a way to stay, said Demetrios G. Papademetriou, president emeritus of the Migration Policy Institute, a Washington think tank. Europe needs to develop a backbone, to say that on principle, if you are an unauthorized immigrant, an economic migrant, we are going to identify you and send you back.  , Stephanie Kirchner contributed to this report.  Read more: ,  The Arab worlds wealthiest nations are doing next to nothing for Syrias refugees ,  As tragedies shock Europe, a bigger refugee crisis looms in the Middle East ,  Read The Posts coverage on the global surge in migration ,  Todays coverage from Post correspondents around the world ]", "Date": "20150920", "Title": "[After hard journeys to Europe, who gets to stay?]", "Link": "https://www.washingtonpost.com/world/europe/after-hard-journeys-to-europe-who-gets-to-stay/2015/09/20/583ded9c-5aee-11e5-8475-781cc9851652_story.html\n", "Author": "[Anthony Faiola]"}
{"Content": "[  BERLIN The United States will increase its cap on the number of refugees it admits and resettles to 85,000 in the coming fiscal year and to 100,000 in 2017, Secretary of State John F. Kerry said Sunday. The additional refugees, up from 70,000 in the current fiscal year that ends Sept. 30, will come from countries around the world. But the increase largely reflects the 10,000 Syrian refugees that the White House earlier this month promised to admit. Kerry said the administration is exploring ways to admit even more, but Congress must approve enough money to cover the extra cost of resettlement. This step is in keeping with Americas best tradition as a land of second chances and a beacon of hope, Kerry said in announcing the increase during a visit to Berlin to discuss the Syrian refugee crisis with his German counterpart, Frank-Walter Steinmeier. Even before Syrian refugees began streaming into Europe in recent weeks, the State Department had been considering a modest increase of about 5,000 refugees, including more from Congo, where human rights abuses are rampant. At the end of each fiscal year, the State Department announces the new target number for refugees. Although the administration can unilaterally set a numerical goal for the refugees it wants to accept, it is up to Congress to agree to fund the resettlement. In the current fiscal year, it cost $1.1 billion to bring 70,000 refugees to the United States, put them through an orientation program run by refugee charities and have them dispersed throughout the country. It was not immediately clear how much more it will cost to bring in more Syrians.          1 of 69       Full Screen Autoplay  Close                                                                                                                                                                 Skip Ad              Migrants desperate quest to cross into Europe      View Photos   More than 332,000 people have reached the continent this year.    Caption   More than 332,000 people have reached the continent this year.  Sept. 20, 2015 Migrants desperately try to board a train heading for Zagreb from Tovarnik station in Tovarnik,Croatia. Croatia continues to send buses and trains north to its border with Hungary. Jeff J. Mitchell/Getty Images  Buy Photo          Wait 1 second to continue.   .wp-volt-gal-preroll-video{width:100%;height:100%}      (function(){var a=window.pbSsiSingle||{};a.onReady=a.onReady||function(){TWPHead.test(!!window.jQuery,\"\",\"//js.washingtonpost.com/pb/resources/js/jquery.1.8.2.js\",function(){a.serverUri=\"//www.washingtonpost.com\";a.contextPath=\"/pb\";var b=[];$(\".pb-feature-ssi-single\").each(function(a,c){var d=$(c).attr(\"data-pb-feature-config\");\"string\"==typeof d&&-1==$.inArray(d,b)&&b.push(d)});a.externals=a.externals||[];b.forEach(function(b){a.externals.push(\"//js.washingtonpost.com/pb/gr/f/ssiSingle/\"+b+\"/render.js?\\\\x26_\\\\x3d1709181625\")});window.EventController||a.externals.unshift(\"//js.washingtonpost.com/pb/resources/js/event-controller.v2.js\");TWPHead.load(a.externals)})};if(!a.loadInitialized){if(window.TWPHead)TWPHead.ready(document,a.onReady);else{window.head_conf={head:\"TWPHead\"};var c=document.getElementsByTagName(\"head\")[0],b=document.createElement(\"script\");b.src=\"//js.washingtonpost.com/pb/resources/js/head.min.js\";c.appendChild(b);var e=function(){window.TWPHead?TWPHead.ready(document,a.onReady):setTimeout(e,200)};e()}a.loadInitialized=!0}c=[\"//js.washingtonpost.com/pb/gr/c/ssiSingle/rO609L1qgAmx7p/js/ab0be8c68d.js?_\\\\x3d49be8\",\"https://js.washingtonpost.com/rw/sites/twpweb/js/plugin/plugin.jquery.wp-preroll.min.js\",\"https://jwpsrv.com/library/l33YMDXrEeKu+iIACp8kUw.js\"];a.externals=a.externals||[];for(b=0;b<c.length-1;b++)-1==a.externals.indexOf(c[b])&&a.externals.push(c[b])})();   [And more refugees come ashore in Greece]  One of the reasons it is so expensive is that every refugee must undergo extensive background checks under security measures enacted after the terrorist attacks of Sept. 11, 2001. Those checks have been taking 18 to 24 months for Syrians, according to State Department figures. A senior State Department official said many, many more refugees could be admitted if officials can find ways to streamline the system without jeopardizing security. Refugees admitted for resettlement are selected from lists provided by the United Nations High Commissioner for Refugees. So far, about 1,600 of more than 18,000 Syrians referred by the U.N. refugee agency since the conflict began have arrived in the United States  about 1,500 in this fiscal year alone. More than 10,000 are well along in being vetted, and they are expected to arrive in much greater numbers in the coming months. The goals announced by Kerry are still far short of the 100,000 or more Syrian refugees that some members of Congress and humanitarian agencies have urged the administration to admit, on top of the 70,000 refugees admitted from other countries this year. We want to take more, Kerry said. We understand the responsibility. Wed like to. But taking folks out of Syria, post 9/11, requires a very specific vetting process. We can target it. But we dont have the money allocated by Congress to hire people necessary to do the job. Were doing what we know we can manage immediately. The United States has spent $4.1 billion over the past four years providing humanitarian aid to Syrian refugees. But humanitarian agencies assisting them have had difficulty raising money to fund their work. The United Nations, for example, has received only 40 percent of what it needs to provide humanitarian aid to the Syrian people. The shrinking resources to help growing numbers of people has helped propel the large flow of refugees into an overwhelmed eastern and central Europe. Kerry and Steinmeier met privately for almost an hour with about a dozen Syrian refugees. Most were in the educated middle class  university instructors, journalists, publishers and statisticians among them. I came here in search of a future, said one woman in her 30s, who said she arrived in Germany with one daughter and who left two more daughters in Syria with their grandparents until she can establish herself. Several of them beseeched the United States to do more to find a political solution and to oust Islamic State militants. When one man was asked what prompted him to leave Syria after he had endured almost five years of war, he replied with a challenge: Id ask another way, he said. Are five years not enough for the West to intervene, and especially the USA? The refugee crisis engulfing Europe has caused Kerry to renew his calls for negotiations that would ease Syrian President Bashar al-Assad out of office and would establish a transitional government. On Friday, Kerry said the United States was prepared to resume negotiations and had implored Russia to persuade Assad to join transition talks. It would be delusional to believe that President Assad can ever unite or govern a peaceful Syria, Kerry said Sunday. Assad has the support of Russia and Iran, and Kerry on Sunday warned that their backing is prolonging the conflict. He said that he and Steinmeier had agreed that continued military support for the regime by Russia  or by any other country  risks exacerbating the conflict and only hinders future cooperation toward a successful transition. ],  BERLIN The United States will increase its cap on the number of refugees it admits and resettles to 85,000 in the coming fiscal year and to 100,000 in 2017, Secretary of State John F. Kerry said Sunday. The additional refugees, up from 70,000 in the current fiscal year that ends Sept. 30, will come from countries around the world. But the increase largely reflects the 10,000 Syrian refugees that the White House earlier this month promised to admit. Kerry said the administration is exploring ways to admit even more, but Congress must approve enough money to cover the extra cost of resettlement. This step is in keeping with Americas best tradition as a land of second chances and a beacon of hope, Kerry said in announcing the increase during a visit to Berlin to discuss the Syrian refugee crisis with his German counterpart, Frank-Walter Steinmeier. Even before Syrian refugees began streaming into Europe in recent weeks, the State Department had been considering a modest increase of about 5,000 refugees, including more from Congo, where human rights abuses are rampant. At the end of each fiscal year, the State Department announces the new target number for refugees. Although the administration can unilaterally set a numerical goal for the refugees it wants to accept, it is up to Congress to agree to fund the resettlement. In the current fiscal year, it cost $1.1 billion to bring 70,000 refugees to the United States, put them through an orientation program run by refugee charities and have them dispersed throughout the country. It was not immediately clear how much more it will cost to bring in more Syrians.  [And more refugees come ashore in Greece] , One of the reasons it is so expensive is that every refugee must undergo extensive background checks under security measures enacted after the terrorist attacks of Sept. 11, 2001. Those checks have been taking 18 to 24 months for Syrians, according to State Department figures. A senior State Department official said many, many more refugees could be admitted if officials can find ways to streamline the system without jeopardizing security. Refugees admitted for resettlement are selected from lists provided by the United Nations High Commissioner for Refugees. So far, about 1,600 of more than 18,000 Syrians referred by the U.N. refugee agency since the conflict began have arrived in the United States  about 1,500 in this fiscal year alone. More than 10,000 are well along in being vetted, and they are expected to arrive in much greater numbers in the coming months. The goals announced by Kerry are still far short of the 100,000 or more Syrian refugees that some members of Congress and humanitarian agencies have urged the administration to admit, on top of the 70,000 refugees admitted from other countries this year. We want to take more, Kerry said. We understand the responsibility. Wed like to. But taking folks out of Syria, post 9/11, requires a very specific vetting process. We can target it. But we dont have the money allocated by Congress to hire people necessary to do the job. Were doing what we know we can manage immediately. The United States has spent $4.1 billion over the past four years providing humanitarian aid to Syrian refugees. But humanitarian agencies assisting them have had difficulty raising money to fund their work. The United Nations, for example, has received only 40 percent of what it needs to provide humanitarian aid to the Syrian people. The shrinking resources to help growing numbers of people has helped propel the large flow of refugees into an overwhelmed eastern and central Europe. Kerry and Steinmeier met privately for almost an hour with about a dozen Syrian refugees. Most were in the educated middle class  university instructors, journalists, publishers and statisticians among them. I came here in search of a future, said one woman in her 30s, who said she arrived in Germany with one daughter and who left two more daughters in Syria with their grandparents until she can establish herself. Several of them beseeched the United States to do more to find a political solution and to oust Islamic State militants. When one man was asked what prompted him to leave Syria after he had endured almost five years of war, he replied with a challenge: Id ask another way, he said. Are five years not enough for the West to intervene, and especially the USA?, The refugee crisis engulfing Europe has caused Kerry to renew his calls for negotiations that would ease Syrian President Bashar al-Assad out of office and would establish a transitional government. On Friday, Kerry said the United States was prepared to resume negotiations and had implored Russia to persuade Assad to join transition talks. It would be delusional to believe that President Assad can ever unite or govern a peaceful Syria, Kerry said Sunday. Assad has the support of Russia and Iran, and Kerry on Sunday warned that their backing is prolonging the conflict. He said that he and Steinmeier had agreed that continued military support for the regime by Russia  or by any other country  risks exacerbating the conflict and only hinders future cooperation toward a successful transition.]", "Date": "20150920", "Title": "[15,000 more refugees to be resettled in U.S. next year]", "Link": "https://www.washingtonpost.com/world/15000-more-refugees-to-be-resettled-in-us-next-year/2015/09/20/02565b4e-5e54-11e5-8475-781cc9851652_story.html\n", "Author": "[Carol Morello]"}
{"Content": "[    In a wide-ranging TV interview, Democratic presidential candidate Hillary Clinton calls for the U.S. to begin immediately admitting 65,000 Syrian refugees. (Reuters)    Democratic presidential candidate Hillary Rodham Clinton, a former secretary of state, said Sunday that U.S. efforts to train and equip Syrian rebels have failed and that many of the threats she foresaw from the Syrian conflict have come to pass. \"Were looking at a failed policy,\" she said of a rebel training program that has yielded only a handful of trained soldiers after about $500 million have been spent. Clinton, appearing on CBSs \"Face the Nation,\" said that the Obama administrations announcement that it will take in 10,000 Syrian refugees is \"a good start\" but that the United States should increase the number to 65,000 because of the scale of the refugee crisis after nearly five years of conflict. \"The United States has do more,\" Clinton said inher first appearance on a Sunday public affairs television show in four years. She renewed her call for the United Nations to host a pledging conference during this months General Assembly session at which nations could commit to taking in more refugees or paying into a fund to help them. [In a break with Obama, Clinton lays out tougher worldview] She called President Obamas program to train some Syrian rebels a washout and implied that it came far too late to be effective. She had recommended training and equipping the irregular rebel forces while they were coalescing in 2011 and 2012 to fight the dictatorship of Syrian President Bashar al-Assad. \"I did recommend at thebeginning of this conflict that wedo more to help train those who were in the forefront,\" Clinton said. \"That was not the decision that was taken at that time. A lot of what I worried about has happened,\" including a power vacuum that has allowed the rise of Islamic State militants, Clinton said. Obama, who was elected on a pledgeto end the Iraq war and keep the United States out of similar Mideast morasses,resisted direct U.S. involvement in the Syrian conflict, which arose from the Arab Spring uprisings and quickly became a grinding civil war. Clinton outlined the policy debate in her 2014 State Department memoir \"Hard Choices,\" saying she accepted the outcome. After Clinton left office, the Obama administration began an air campaign inside Syria and inaugurated a small rebel training program. Both efforts are aimed at the Islamic State militant group, notat Assad. The administration position is that Assad has lost his legitimacy to govern but that the United States will take no direct action to oust him. \"Where we are today is not where we were, and where we are today is  we have a failed program,\" Clinton said. In a wide-ranging interview, she also deemed Republican front-runner Donald Trump irresponsible for stirring up what she called some of the worst impulses in American politics. \"He is fueling a level of paranoia and prejudice against all kinds of people,\" Clinton said. She said she is not ready to go on the attack against her stronger-than-expected rival Sen. Bernie Sanders (I-Vt.) and called herself a rightful embodiment of the national mood favoring nontraditional candidates. \"I cannot imagine anyone being more of anoutsider than the first woman president,\" Clinton said. [New poll shows a Clinton-Sanders dead heat in Iowa] Asked to sum herself up in three words, Clinton said she could not do so. Nonetheless, she had a game response, one that seemed to acknowledge the frequent criticism that she appears inauthentic or programmed. \"Look, I ama real person, with all the pluses and minuses that go along with being that,\" she said. Clinton said little new about her use of a privately owned e-mail systemwhen she was secretary of state. Questions about the arrangement have clouded Clintons campaign, cutting deeply into her once-formidable lead over other Democrats and sullying her record as secretary of state in the minds of some voters. [Clinton, using private server, wrote and sent e-mails now deemed classified] \"Ive said that I didnt make the best choice,\" Clinton said, adding that although the arrangement was \"fully above board,\" it was a \"mistake.\" \"Im sorry that I made a choice that has raised all of these questions, because I dont like reading, you know, [that] people have questions about what I did and how I did it,\" Clinton said. \"Im proud of the work we did at the State Department.\" As to whether the decision to set up the system outsideregular State Department operations suggests that Clinton has no one around her to steer her away from bad ideas, she laughed. \"I have too many, actually,\" Clinton said, referring to advisers.], Democratic presidential candidate Hillary Rodham Clinton, a former secretary of state, said Sunday that U.S. efforts to train and equip Syrian rebels have failed and that many of the threats she foresaw from the Syrian conflict have come to pass. \"Were looking at a failed policy,\" she said of a rebel training program that has yielded only a handful of trained soldiers after about $500 million have been spent. Clinton, appearing on CBSs \"Face the Nation,\" said that the Obama administrations announcement that it will take in 10,000 Syrian refugees is \"a good start\" but that the United States should increase the number to 65,000 because of the scale of the refugee crisis after nearly five years of conflict. \"The United States has do more,\" Clinton said inher first appearance on a Sunday public affairs television show in four years. She renewed her call for the United Nations to host a pledging conference during this months General Assembly session at which nations could commit to taking in more refugees or paying into a fund to help them. [In a break with Obama, Clinton lays out tougher worldview], She called President Obamas program to train some Syrian rebels a washout and implied that it came far too late to be effective. She had recommended training and equipping the irregular rebel forces while they were coalescing in 2011 and 2012 to fight the dictatorship of Syrian President Bashar al-Assad. \"I did recommend at thebeginning of this conflict that wedo more to help train those who were in the forefront,\" Clinton said. \"That was not the decision that was taken at that time. A lot of what I worried about has happened,\" including a power vacuum that has allowed the rise of Islamic State militants, Clinton said. Obama, who was elected on a pledgeto end the Iraq war and keep the United States out of similar Mideast morasses,resisted direct U.S. involvement in the Syrian conflict, which arose from the Arab Spring uprisings and quickly became a grinding civil war. Clinton outlined the policy debate in her 2014 State Department memoir \"Hard Choices,\" saying she accepted the outcome. After Clinton left office, the Obama administration began an air campaign inside Syria and inaugurated a small rebel training program. Both efforts are aimed at the Islamic State militant group, notat Assad. The administration position is that Assad has lost his legitimacy to govern but that the United States will take no direct action to oust him. \"Where we are today is not where we were, and where we are today is  we have a failed program,\" Clinton said. In a wide-ranging interview, she also deemed Republican front-runner Donald Trump irresponsible for stirring up what she called some of the worst impulses in American politics. \"He is fueling a level of paranoia and prejudice against all kinds of people,\" Clinton said. She said she is not ready to go on the attack against her stronger-than-expected rival Sen. Bernie Sanders (I-Vt.) and called herself a rightful embodiment of the national mood favoring nontraditional candidates. \"I cannot imagine anyone being more of anoutsider than the first woman president,\" Clinton said. [New poll shows a Clinton-Sanders dead heat in Iowa], Asked to sum herself up in three words, Clinton said she could not do so. Nonetheless, she had a game response, one that seemed to acknowledge the frequent criticism that she appears inauthentic or programmed. \"Look, I ama real person, with all the pluses and minuses that go along with being that,\" she said. Clinton said little new about her use of a privately owned e-mail systemwhen she was secretary of state. Questions about the arrangement have clouded Clintons campaign, cutting deeply into her once-formidable lead over other Democrats and sullying her record as secretary of state in the minds of some voters. [Clinton, using private server, wrote and sent e-mails now deemed classified], \"Ive said that I didnt make the best choice,\" Clinton said, adding that although the arrangement was \"fully above board,\" it was a \"mistake.\", \"Im sorry that I made a choice that has raised all of these questions, because I dont like reading, you know, [that] people have questions about what I did and how I did it,\" Clinton said. \"Im proud of the work we did at the State Department.\", As to whether the decision to set up the system outsideregular State Department operations suggests that Clinton has no one around her to steer her away from bad ideas, she laughed. \"I have too many, actually,\" Clinton said, referring to advisers.]", "Date": "20150920", "Title": "[Clinton criticizes failed effort to train Syrian rebels, says U.S. should admit at least 65,000 refugees]", "Link": "http://www.washingtonpost.com/news/post-politics/wp/2015/09/20/clinton-criticizes-failed-effort-to-train-syrian-rebels-says-u-s-should-admit-at-least-65000-refugees/\n", "Author": "[Anne Gearan]"}
{"Content": "[  JOINT BASE SAN ANTONIO-FORT SAM HOUSTON, Tex.  Army Pfc. Bowe Bergdahl was fed up. He was five weeks into a deployment in southeastern Afghanistan and frustrated with his mission and his leaders. He and his fellow soldiers werent going after the Taliban as aggressively as he wanted, and his sense of disillusion added to the disgust for the Army that he had begun developing while still in basic training. Looking to make a stand, Bergdahl hatched a plan: He would run away from his platoons tiny outpost in Paktika province late on June 29, 2009. He would stay away from the Army a day, maybe two, and then reappear about19 miles away at a larger installation and demand to air his grievances with a general. He knew that the region was crawling with insurgents, but he had outsize impressions of his own capabilities, according to an investigating officer, and was determined to create enough chaos to get the attention of senior commanders. Those were among the details that emerged in a preliminary hearing here late last week. The soldier, carrying just a disguise, a knife and some provisions, was captured by insurgents by 10 a.m. the following morning, beginning four years and 11 months of captivity and torture by the Haqqani network, a group affiliated with the Taliban, according to Maj. Gen. Kenneth Dahl, the senior officer who carried out an investigation of Bergdahls actions and interviewed him at length.  [Bergdahls attorneys raised mental health issues]  The case against Bergdahl, who is charged with desertion and misbehaving before the enemy, is the most closely scrutinized desertion prosecution in the military in decades  perhaps since that of Pvt. Eddie Slovik, a soldier who became the only American executed for desertion since the Civil War. The officer overseeing the Bergdahl hearing, Lt. Col. Mark A. Visger, is expected to make a recommendation in the coming days to U.S. Army Forces Command, at Fort Bragg, N.C. about whether Bergdahl should be court-martialed. Bergdahl, now 29 and a sergeant, was recovered in May 2014 in a controversial swap in which the White House approved the release of five Taliban detainees from the military prison at Guantanamo Bay, Cuba. They are now in Qatar. Emotional testimony has underscored the relentless brutality that Bergdahl had to endure, as well as the chaos caused by his disappearance and the lingering resentment of some of his comrades.  The case has also raised questions about the Obama administrations handling of it, which included inviting Bergdahls parents to speak at the White House after the soldier was recovered, with national security adviser Susan E. Rice saying he served with honor and distinction.  The White House has since concluded that it badly misplayed the optics of Bergdahls release, according to administration officials. Bergdahls parents were in Washington the day he was recovered, and a quick decision was made to include them in a Rose Garden announcement, with little thought given to the ramifications of making Bergdahl appear to be a hero, the officials said. Bergdahl joined the Army a few years after washing out of initial training for the Coast Guard. The Washington Post reported previously that it was for psychological reasons, but Bergdahls lawyer and Dahl were more specific in the hearing: The future Taliban captive was diagnosed with depression and sent home after he was found in distress in a Coast Guard barracks, sitting on a floor with blood in his hands, possibly from a bloody nose, Dahl testified. He wasnt ready for it, Dahl said of life in the Coast Guard. He was overwhelmed, found himself in the hospital and was released. Bergdahl received a waiver to enlist in the Army. He was physically fit and well regarded for his work ethic, but quickly became disenchanted with his fellow soldiers and the Armys training program. Among his gripes: He couldnt believe higher-ranking soldiers wanted him to lock his wall locker to prevent theft and saw pre-deployment training at the National Training Center at Fort Irwin, Calif. as lame, Dahl said. Bergdahl was assigned to the 25th Infantry Divisions 1st Battalion, 501st Infantry Regiment, 4th Brigade Combat Team, of Fort Richardson, Alaska. There, he took offense to a motivational speech made by the senior enlisted soldier to the entire battalion. The command sergeant major said in jest that, like other soldiers, he liked to pillage and plunder, but Bergdahl took it literally, Dahl said.  In Afghanistan, there was another misunderstanding, Dahl said. Soldiers from Bergdahls unit werent all wearing their whole uniforms one day, a violation that upset then-Lt. Col. Clinton Baker, Bergdahls battalion commander.  Baker launched into a tirade to get his point across, kicking rocks in the process. Bergdahl was convinced that Baker had disturbed an Afghan grave, a suggestion that perplexed the others present, Dahl said. The general found that Bergdahls childhood living at the edge of the grid in Idaho in relative isolation hurt his ability to relate to other people. As a result, he was an extremely harsh judge of character and unrealistically idealistic, Dahl said. I think he absolutely believed that the things he perceived were absolutely true, he added.  [Bergdahls writing reveal a fragile young man]  Bergdahl could have gone to a number of people in his chain of command with concerns about his platoon. But he thought that they were in the Army for the money, or otherwise incapable of responding, Dahl said. In some ways, the soldier did consider others before running away from Observation Post Mest, Dahl said. He told Dahl that he picked the night he disappeared in part because he knew another platoon already would be on the way in the morning to relieve Bergdahls, thus providing additional manpower to deal with his vanishing. He didnt want to take his 5.56mm squad automatic machine gun with him alone outside the wire because he figured it would draw attention, but also decided against stealing a 9mm pistol because that would have gotten a fellow soldier in trouble, Dahl said. Bergdahls disappearance was noticed around dawn, when he was due to take a guard shift. Capt. John Billings, his former platoon leader, testified that he was in shock that one of his men could have vanished, and initially thought his soldiers were pulling a joke on him. Reality eventually set in, though, and he informed his company commander, then-Capt. Silvino Silvino. I felt sick to my stomach, said Silvino, now a major. I didnt know what was going to come after that. ... I instructed him to go look high and low, and everywhere he could. Coalition forces across eastern Afghanistan altered their operations that summer looking for Bergdahl, exposing soldiers to additional and dangerous missions. That remains a sensitive point, amid allegations from Bergdahls fellow soldiers that at least six U.S. troops died because of his actions. Dahl said he examined a variety of evidence, and found nothing that connected the deaths directly to Bergdahl. But the search-and-rescue operations undoubtedly altered security in the region, military officials said, and plunged the units involved into hastily planned missions. Baker, the former battalion commander, recalled that one platoon conducted 37 consecutive days of operations  long enough that new socks and T-shirts had to be delivered to the soldiers, since theirs were rotting on their bodies. Bergdahl, meanwhile, was already in Pakistan. He was relentlessly beaten in captivity with rubber hoses and copper cables. He repeatedly tried to escape, said Terrence Russell, an official with the Pentagons Joint Personnel Recovery Agency, who interviewed Bergdahl after his return.  Bergdahl was moved to at least six different locations, including one referred to as a Taliban prison. After escaping once for nearly nine days, Bergdahl was put in a 7-foot cage, blindfolded and left there for most of his last 3 years in captivity, Russell said. Bergdahl has been accused often of cooperating with the insurgents or even seeking them out, but Russell said there is no evidence to support those claims. The Haqqani network forced him to make videos that were released online. Russell grew visibly agitated while describing the conditions Bergdahl faced, wiping tears away at one point. While the sergeant has been accused of many things, Russell said, he was an organization of one, with no fellow prisoners who could keep his spirits up. He did the best job he could do, Russell said, And I respect him for it. Bergdahls attorney, Eugene Fidell, argued during closing arguments at the preliminary hearing that his client should not be court-martialed for either of the charges he now faces. There is probable cause, Fidell acknowledged, to charge him with a lesser offense, being absent without leave for one day, but the moment he was taken captive, Fidell said, that designation should have ended. The maximum penalty for being AWOL for one day is 30 days of confinement.  An Army prosecutor, Maj. Margaret Kurz, said that Bergdahls actions hurt the Army, his fellow soldiers and the mission in Afghanistan, and he must be punished. One does not just walk away into the Afghan wilderness, she said, and then return as though nothing happened.  Karen DeYoung contributed to this report. ],  JOINT BASE SAN ANTONIO-FORT SAM HOUSTON, Tex.  Army Pfc. Bowe Bergdahl was fed up. He was five weeks into a deployment in southeastern Afghanistan and frustrated with his mission and his leaders. He and his fellow soldiers werent going after the Taliban as aggressively as he wanted, and his sense of disillusion added to the disgust for the Army that he had begun developing while still in basic training. Looking to make a stand, Bergdahl hatched a plan: He would run away from his platoons tiny outpost in Paktika province late on June 29, 2009. He would stay away from the Army a day, maybe two, and then reappear about19 miles away at a larger installation and demand to air his grievances with a general. He knew that the region was crawling with insurgents, but he had outsize impressions of his own capabilities, according to an investigating officer, and was determined to create enough chaos to get the attention of senior commanders. Those were among the details that emerged in a preliminary hearing here late last week. The soldier, carrying just a disguise, a knife and some provisions, was captured by insurgents by 10 a.m. the following morning, beginning four years and 11 months of captivity and torture by the Haqqani network, a group affiliated with the Taliban, according to Maj. Gen. Kenneth Dahl, the senior officer who carried out an investigation of Bergdahls actions and interviewed him at length.  [Bergdahls attorneys raised mental health issues] , The case against Bergdahl, who is charged with desertion and misbehaving before the enemy, is the most closely scrutinized desertion prosecution in the military in decades  perhaps since that of Pvt. Eddie Slovik, a soldier who became the only American executed for desertion since the Civil War. The officer overseeing the Bergdahl hearing, Lt. Col. Mark A. Visger, is expected to make a recommendation in the coming days to U.S. Army Forces Command, at Fort Bragg, N.C. about whether Bergdahl should be court-martialed. Bergdahl, now 29 and a sergeant, was recovered in May 2014 in a controversial swap in which the White House approved the release of five Taliban detainees from the military prison at Guantanamo Bay, Cuba. They are now in Qatar. Emotional testimony has underscored the relentless brutality that Bergdahl had to endure, as well as the chaos caused by his disappearance and the lingering resentment of some of his comrades. The case has also raised questions about the Obama administrations handling of it, which included inviting Bergdahls parents to speak at the White House after the soldier was recovered, with national security adviser Susan E. Rice saying he served with honor and distinction. The White House has since concluded that it badly misplayed the optics of Bergdahls release, according to administration officials. Bergdahls parents were in Washington the day he was recovered, and a quick decision was made to include them in a Rose Garden announcement, with little thought given to the ramifications of making Bergdahl appear to be a hero, the officials said. Bergdahl joined the Army a few years after washing out of initial training for the Coast Guard. The Washington Post reported previously that it was for psychological reasons, but Bergdahls lawyer and Dahl were more specific in the hearing: The future Taliban captive was diagnosed with depression and sent home after he was found in distress in a Coast Guard barracks, sitting on a floor with blood in his hands, possibly from a bloody nose, Dahl testified. He wasnt ready for it, Dahl said of life in the Coast Guard. He was overwhelmed, found himself in the hospital and was released. Bergdahl received a waiver to enlist in the Army. He was physically fit and well regarded for his work ethic, but quickly became disenchanted with his fellow soldiers and the Armys training program. Among his gripes: He couldnt believe higher-ranking soldiers wanted him to lock his wall locker to prevent theft and saw pre-deployment training at the National Training Center at Fort Irwin, Calif. as lame, Dahl said. Bergdahl was assigned to the 25th Infantry Divisions 1st Battalion, 501st Infantry Regiment, 4th Brigade Combat Team, of Fort Richardson, Alaska. There, he took offense to a motivational speech made by the senior enlisted soldier to the entire battalion. The command sergeant major said in jest that, like other soldiers, he liked to pillage and plunder, but Bergdahl took it literally, Dahl said. In Afghanistan, there was another misunderstanding, Dahl said. Soldiers from Bergdahls unit werent all wearing their whole uniforms one day, a violation that upset then-Lt. Col. Clinton Baker, Bergdahls battalion commander. Baker launched into a tirade to get his point across, kicking rocks in the process. Bergdahl was convinced that Baker had disturbed an Afghan grave, a suggestion that perplexed the others present, Dahl said. The general found that Bergdahls childhood living at the edge of the grid in Idaho in relative isolation hurt his ability to relate to other people. As a result, he was an extremely harsh judge of character and unrealistically idealistic, Dahl said. I think he absolutely believed that the things he perceived were absolutely true, he added.  [Bergdahls writing reveal a fragile young man] , Bergdahl could have gone to a number of people in his chain of command with concerns about his platoon. But he thought that they were in the Army for the money, or otherwise incapable of responding, Dahl said. In some ways, the soldier did consider others before running away from Observation Post Mest, Dahl said. He told Dahl that he picked the night he disappeared in part because he knew another platoon already would be on the way in the morning to relieve Bergdahls, thus providing additional manpower to deal with his vanishing. He didnt want to take his 5.56mm squad automatic machine gun with him alone outside the wire because he figured it would draw attention, but also decided against stealing a 9mm pistol because that would have gotten a fellow soldier in trouble, Dahl said. Bergdahls disappearance was noticed around dawn, when he was due to take a guard shift. Capt. John Billings, his former platoon leader, testified that he was in shock that one of his men could have vanished, and initially thought his soldiers were pulling a joke on him. Reality eventually set in, though, and he informed his company commander, then-Capt. Silvino Silvino. I felt sick to my stomach, said Silvino, now a major. I didnt know what was going to come after that. ... I instructed him to go look high and low, and everywhere he could. Coalition forces across eastern Afghanistan altered their operations that summer looking for Bergdahl, exposing soldiers to additional and dangerous missions. That remains a sensitive point, amid allegations from Bergdahls fellow soldiers that at least six U.S. troops died because of his actions. Dahl said he examined a variety of evidence, and found nothing that connected the deaths directly to Bergdahl. But the search-and-rescue operations undoubtedly altered security in the region, military officials said, and plunged the units involved into hastily planned missions. Baker, the former battalion commander, recalled that one platoon conducted 37 consecutive days of operations  long enough that new socks and T-shirts had to be delivered to the soldiers, since theirs were rotting on their bodies. Bergdahl, meanwhile, was already in Pakistan. He was relentlessly beaten in captivity with rubber hoses and copper cables. He repeatedly tried to escape, said Terrence Russell, an official with the Pentagons Joint Personnel Recovery Agency, who interviewed Bergdahl after his return. Bergdahl was moved to at least six different locations, including one referred to as a Taliban prison. After escaping once for nearly nine days, Bergdahl was put in a 7-foot cage, blindfolded and left there for most of his last 3 years in captivity, Russell said. Bergdahl has been accused often of cooperating with the insurgents or even seeking them out, but Russell said there is no evidence to support those claims. The Haqqani network forced him to make videos that were released online. Russell grew visibly agitated while describing the conditions Bergdahl faced, wiping tears away at one point. While the sergeant has been accused of many things, Russell said, he was an organization of one, with no fellow prisoners who could keep his spirits up. He did the best job he could do, Russell said, And I respect him for it. Bergdahls attorney, Eugene Fidell, argued during closing arguments at the preliminary hearing that his client should not be court-martialed for either of the charges he now faces. There is probable cause, Fidell acknowledged, to charge him with a lesser offense, being absent without leave for one day, but the moment he was taken captive, Fidell said, that designation should have ended. The maximum penalty for being AWOL for one day is 30 days of confinement. An Army prosecutor, Maj. Margaret Kurz, said that Bergdahls actions hurt the Army, his fellow soldiers and the mission in Afghanistan, and he must be punished. One does not just walk away into the Afghan wilderness, she said, and then return as though nothing happened.  , Karen DeYoung contributed to this report.]", "Date": "20150920", "Title": "[Disillusioned and self-deluded, Bowe Bergdahl vanished into a brutal captivity]", "Link": "https://www.washingtonpost.com/world/national-security/disillusioned-and-self-deluded-bowe-bergdahl-vanished-into-a-brutal-captivity/2015/09/20/b15a8a8c-5f9b-11e5-b38e-06883aacba64_story.html\n", "Author": "[Dan Lamothe]"}
{"Content": "[   Jeff Vomund is a member of Dignity/Washington.   Pope Francis, welcome to Washington! Like the rest of the Catholic world and people of good faith everywhere, we have felt challenged to find God in all people by your focus on the poor and the outcast. We watched you wash the feet of women and non-Christians and were inspired to be more inclusive. We read your words on the moral imperatives caused by our climate crisis and were challenged to change our relationship to the Earth. But never have we been more energized by your words than when, on the first foreign trip of your papacy, you said this to a reporter who asked you about gay priests: If someone is gay and he searches for the Lord and has goodwill, who am I to judge?  As an organization that provides a spiritual home to LGBTQ Catholics, Dignity/Washington works for respect and justice for people of all sexual orientations, genders and gender identities in the Catholic Church. We know what its like to feel judged. For being honest about our sexuality. For wanting to live happy and open lives with families and friends. And, indeed, for wanting to be who we are  LGBTQ and Roman Catholic. We also love our church. We love gathering as a community around the altar for the Eucharist. We love the scriptures and the liturgy and the faith tradition that has shaped our lives. Although we as an organization have been exiled from Catholic buildings and rejected by Catholic leaders because we want to live our sexuality openly and without apology, we are still Catholic, and we still look to you for leadership. That is why we are so grateful for your upcoming presence in our city. We await your arrival with hope and expectation. And we invite you, Holy Father, in the words of Jesus to his first disciples, to come and see.  So often when the church has made pronouncements about homosexuality and the LGBTQ community, it has done so from a distance. Despite the high percentage of gay clergy in the Catholic Church  or perhaps because of it  Vatican and hierarchical statements about homosexuality and LGBTQ people have felt like an intellectual exercise in natural law and interpretations of scriptural text, not statements that speak to the great commandment to love our neighbors as ourselves. Intrinsically disordered,  as the church refers to homosexual acts, may be a legitimate philosophical category, but it is not a label to put on brothers and sisters.  We are, like you and all church leaders, human beings who fall in love, have to learn how to forgive and want to grow old surrounded by friends and family. It is not the churchs judgment about us that has hurt so much, but rather our being judged without being known. For if church leaders knew us, they would also know the love that surrounds us. They would know couples who have cared for each other in sickness and in health  indeed not parting until death. They would see the power of understanding, especially the understanding of parents and children, as we have struggled with our families to make sense of who we are. They would know the joy and laughter that come from friendship and the powerful bond that comes, at times, from feeling outcast together. For any who know us would know that what church teaching has labeled disordered is actually a gift that gives order to our love and to our lives. From the distance of philosophical theology, that might seem impossible. But up close I promise one cannot fail to see it. And so, we invite you, Holy Father, as well as Cardinal Donald Wuerl, our own archbishop, and all of the bishops and priests in whose dioceses and parishes we live, to come and see. Get to know the strength of love that survives despite ridicule and cultural rejection. Experience firsthand couples who have been together for decades praying and seeking to do Gods will. See us in our need for forgiveness, but also in the sharing of our gifts. We are confident that, like those who experienced Jesus firsthand, you would recognize as did the apostle John in his first Letter, Everyone who loves is begotten by God and knows God. Whoever is without love does not know God, for God is love.  We might disagree about the definition of a civil or a sacramental marriage. We might not see eye to eye on the purpose of sexual activity in a same-sex relationship. But we can begin by simply getting to know the love that God has for each of us. We could share that love with you, and you with us  or any other church leader who would be willing to come and see. We believe that once you got to see and know our love, it would no longer make sense to call it disordered or to fire people who work for and serve the church while sharing that love. We believe that once you came to share in our love for one another, labeling it as a cross we had to bear, or treating it as less deserving of government protection, would make no more sense to you than it does to us. Holy Father, come and see for yourself how God is made flesh in our liturgies and in our loves, as in any other Catholic community, and you will not have to ask: Who am I to judge? Because, again echoing John, you will speak of what we have seen with our eyes ... and touched with our hands and proclaim the eternal life ... that was ... made visible to us so that we might have fellowship together and our joy may be complete.   Read more on this issue:    Katrina vanden Heuvel: Pope Francis vs. Wall Street   E.J. Dionne Jr.: The pope, the saint and the climate   Garry Wills: The man who could help prevent a holy war      ],  Jeff Vomund is a member of Dignity/Washington. Pope Francis, welcome to Washington! Like the rest of the Catholic world and people of good faith everywhere, we have felt challenged to find God in all people by your focus on the poor and the outcast. We watched you wash the feet of women and non-Christians and were inspired to be more inclusive. We read your words on the moral imperatives caused by our climate crisis and were challenged to change our relationship to the Earth. But never have we been more energized by your words than when, on the first foreign trip of your papacy, you said this to a reporter who asked you about gay priests: If someone is gay and he searches for the Lord and has goodwill, who am I to judge? , As an organization that provides a spiritual home to LGBTQ Catholics, Dignity/Washington works for respect and justice for people of all sexual orientations, genders and gender identities in the Catholic Church. We know what its like to feel judged. For being honest about our sexuality. For wanting to live happy and open lives with families and friends. And, indeed, for wanting to be who we are  LGBTQ and Roman Catholic. We also love our church. We love gathering as a community around the altar for the Eucharist. We love the scriptures and the liturgy and the faith tradition that has shaped our lives. Although we as an organization have been exiled from Catholic buildings and rejected by Catholic leaders because we want to live our sexuality openly and without apology, we are still Catholic, and we still look to you for leadership. That is why we are so grateful for your upcoming presence in our city. We await your arrival with hope and expectation. And we invite you, Holy Father, in the words of Jesus to his first disciples, to come and see. So often when the church has made pronouncements about homosexuality and the LGBTQ community, it has done so from a distance. Despite the high percentage of gay clergy in the Catholic Church  or perhaps because of it  Vatican and hierarchical statements about homosexuality and LGBTQ people have felt like an intellectual exercise in natural law and interpretations of scriptural text, not statements that speak to the great commandment to love our neighbors as ourselves. Intrinsically disordered,  as the church refers to homosexual acts, may be a legitimate philosophical category, but it is not a label to put on brothers and sisters. We are, like you and all church leaders, human beings who fall in love, have to learn how to forgive and want to grow old surrounded by friends and family. It is not the churchs judgment about us that has hurt so much, but rather our being judged without being known. For if church leaders knew us, they would also know the love that surrounds us. They would know couples who have cared for each other in sickness and in health  indeed not parting until death. They would see the power of understanding, especially the understanding of parents and children, as we have struggled with our families to make sense of who we are. They would know the joy and laughter that come from friendship and the powerful bond that comes, at times, from feeling outcast together. For any who know us would know that what church teaching has labeled disordered is actually a gift that gives order to our love and to our lives. From the distance of philosophical theology, that might seem impossible. But up close I promise one cannot fail to see it. And so, we invite you, Holy Father, as well as Cardinal Donald Wuerl, our own archbishop, and all of the bishops and priests in whose dioceses and parishes we live, to come and see. Get to know the strength of love that survives despite ridicule and cultural rejection. Experience firsthand couples who have been together for decades praying and seeking to do Gods will. See us in our need for forgiveness, but also in the sharing of our gifts. We are confident that, like those who experienced Jesus firsthand, you would recognize as did the apostle John in his first Letter, Everyone who loves is begotten by God and knows God. Whoever is without love does not know God, for God is love. We might disagree about the definition of a civil or a sacramental marriage. We might not see eye to eye on the purpose of sexual activity in a same-sex relationship. But we can begin by simply getting to know the love that God has for each of us. We could share that love with you, and you with us  or any other church leader who would be willing to come and see. We believe that once you got to see and know our love, it would no longer make sense to call it disordered or to fire people who work for and serve the church while sharing that love. We believe that once you came to share in our love for one another, labeling it as a cross we had to bear, or treating it as less deserving of government protection, would make no more sense to you than it does to us. Holy Father, come and see for yourself how God is made flesh in our liturgies and in our loves, as in any other Catholic community, and you will not have to ask: Who am I to judge? Because, again echoing John, you will speak of what we have seen with our eyes ... and touched with our hands and proclaim the eternal life ... that was ... made visible to us so that we might have fellowship together and our joy may be complete.  Read more on this issue:  ,  Katrina vanden Heuvel: Pope Francis vs. Wall Street ,  E.J. Dionne Jr.: The pope, the saint and the climate ,  Garry Wills: The man who could help prevent a holy war ,  ,  ]", "Date": "20150920", "Title": "[An invitation to Pope Francis from D.C.s gay Catholic community]", "Link": "https://www.washingtonpost.com/opinions/an-invitation-to-pope-francis-from-dcs-gay-catholic-community/2015/09/20/680ef5aa-5d77-11e5-b38e-06883aacba64_story.html", "Author": "[Jeff Vomund]"}
